-- -*- M2-comint -*- hash: 1607168026
--loading configuration for package "FourTiTwo" from file /Users/tom/Library/Application Support/Macaulay2/init-FourTiTwo.m2
--loading configuration for package "SOS" from file /Users/tom/Library/Application Support/Macaulay2/init-SOS.m2
Warning: sdpa executable was not found.

i1 : R = QQ[x,y,z];

i2 : nonnegativeForm("Motzkin", R)

      4 2    2 4     2 2 2    6
o2 = x y  + x y  - 3x y z  + z

o2 : R

i3 : nonnegativeForm("Robinson", R)

      6    4 2    2 4    6    4 2     2 2 2    4 2    2 4    2 4    6
o3 = x  - x y  - x y  + y  - x z  + 3x y z  - y z  - x z  - y z  + z

o3 : R

i4 : nonnegativeForm("Schmuedgen", R)

         6    4 2     2 4       6     3 2        4         4 2      2 2 2  
o4 = 199x  - x y  + 2x y  + 200y  - 4x y z + 4x*y z - 1588x z  - 12x y z  -
     ------------------------------------------------------------------------
          4 2      3 3        2 3        2 4        2 4
     1600y z  + 16x z  - 16x*y z  + 3200x z  + 3200y z

o4 : R

i5 : R = QQ[x,y,z,w];

i6 : nonnegativeForm("Lax-Lax", R)

      4    3       3    4    3     2         2     3         2      3      3
o6 = x  - x y - x*y  + y  - x z + x y*z + x*y z - y z + x*y*z  - x*z  - y*z 
     ------------------------------------------------------------------------
        4    3     2         2     3     2                  2         2   
     + z  - x w + x y*w + x*y w - y w + x z*w - 3x*y*z*w + y z*w + x*z w +
     ------------------------------------------------------------------------
        2     3         2        2        2      3      3      3    4
     y*z w - z w + x*y*w  + x*z*w  + y*z*w  - x*w  - y*w  - z*w  + w

o6 : R

i7 : nonnegativeForm("Choi-Lam", R)

      2 2    2 2    2 2               4
o7 = x y  + x z  + y z  - 4x*y*z*w + w

o7 : R

i8 : R = QQ[x,y,z];

i9 : nonnegativeForm("Scheiderer", R)

      4      3    4     2          2      2 2      3      3    4
o9 = x  + x*y  + y  - 3x y*z - 4x*y z + 2x z  + x*z  + y*z  + z

o9 : R

i10 : nonnegativeForm("Harris", R)

         10      8 2      6 4      4 6      2 8      10      8 2      6 2 2  
o10 = 16x   - 36x y  + 20x y  + 20x y  - 36x y  + 16y   - 36x z  + 57x y z  -
      -----------------------------------------------------------------------
         4 4 2      2 6 2      8 2      6 4      4 2 4      2 4 4      6 4  
      38x y z  + 57x y z  - 36y z  + 20x z  - 38x y z  - 38x y z  + 20y z  +
      -----------------------------------------------------------------------
         4 6      2 2 6      4 6      2 8      2 8      10
      20x z  + 57x y z  + 20y z  - 36x z  - 36y z  + 16z

o10 : R

i11 : 
