-- -*- M2-comint -*- hash: -1549979493

i1 : R = QQ[a,b];

i2 : I = ideal(a^2+b^2,a*b);

o2 : Ideal of R

i3 : initialIdeals(I)  

             2   3     3        2
o3 = {{a*b, a , b }, {a , a*b, b }}

o3 : List

i4 : 
