-- -*- M2-comint -*- hash: 18003085181435605007

i1 : R = QQ[a..d];

i2 : I = ideal(a*c-b^2,a*d-b*c,b*d-c^2);  

o2 : Ideal of R

i3 : polymakeStatePolytope(I)

o3 = {{11, 7, 7, 11}, {7, 15, 3, 11}, {4, 18, 6, 8}, {3, 18, 9, 6}, {11, 3,
     ------------------------------------------------------------------------
     15, 7}, {8, 6, 18, 4}, {6, 9, 18, 3}, {3, 15, 15, 3}}

o3 : List

i4 : 
