-- -*- M2-comint -*- hash: 18002316241657736360

i1 : R = QQ[a..d];

i2 : I = ideal(a*c-b^2,a*d-b*c,b*d-c^2);

o2 : Ideal of R

i3 : polymakeStatePolytope(3,I)

o3 = {{9, 6, 6, 9}, {6, 12, 3, 9}, {4, 14, 5, 7}, {3, 14, 8, 5}, {9, 3, 12,
     ------------------------------------------------------------------------
     6}, {7, 5, 14, 4}, {5, 8, 14, 3}, {3, 12, 12, 3}}

o3 : List

i4 : 
