-- -*- M2-comint -*- hash: 2064709601
--loading configuration for package "FourTiTwo" from file /home/tim/.Macaulay2/init-FourTiTwo.m2
--loading configuration for package "Topcom" from file /home/tim/.Macaulay2/init-Topcom.m2
--warning: file katex not installed yet in package Style
--loading configuration for package "NumericalAlgebraicGeometry" from file /home/tim/.Macaulay2/init-NumericalAlgebraicGeometry.m2
--loading configuration for package "Bertini" from file /home/tim/.Macaulay2/init-Bertini.m2

i1 : setRandomSeed 100;

i2 : declareVariable \ {t_1,t_2,u_0,u_1,u_2,u_3};

i3 : paramMatrix = gateMatrix{{u_0,u_1,u_2,u_3}};

i4 : varMatrix = gateMatrix{{t_1,t_2}};

i5 : phi = transpose gateMatrix{{t_1^3, t_1^2*t_2, t_1*t_2^2, t_2^3}};

i6 : loss = sum for i from 0 to 3 list (u_i - phi_(i,0))^2;

i7 : dLoss = diff(varMatrix, gateMatrix{{loss}});

i8 : G = gateSystem(paramMatrix,varMatrix,transpose dLoss);

i9 : monodromyGroup(G,"msOptions" => {NumberOfEdges=>10})

o9 = {{5, 1, 6, 8, 4, 0, 2, 7, 3, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19,
     ------------------------------------------------------------------------
     20}, {4, 2, 6, 7, 5, 0, 1, 8, 3, 15, 10, 16, 12, 17, 14, 9, 11, 13, 18,
     ------------------------------------------------------------------------
     19, 20}, {3, 4, 2, 6, 7, 5, 0, 1, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17,
     ------------------------------------------------------------------------
     18, 19, 20}, {3, 4, 2, 6, 7, 5, 0, 1, 8, 9, 10, 11, 12, 13, 14, 15, 16,
     ------------------------------------------------------------------------
     17, 18, 19, 20}, {3, 4, 2, 6, 7, 5, 0, 1, 8, 9, 10, 11, 12, 13, 14, 15,
     ------------------------------------------------------------------------
     16, 17, 18, 19, 20}, {4, 2, 6, 7, 5, 0, 1, 8, 3, 15, 10, 16, 12, 17, 14,
     ------------------------------------------------------------------------
     9, 11, 13, 18, 19, 20}, {3, 4, 2, 6, 7, 5, 0, 1, 8, 9, 10, 11, 12, 13,
     ------------------------------------------------------------------------
     14, 15, 16, 17, 18, 19, 20}, {9, 4, 18, 11, 7, 19, 13, 1, 20, 3, 10, 6,
     ------------------------------------------------------------------------
     12, 0, 14, 15, 16, 17, 5, 8, 2}, {9, 4, 10, 11, 7, 12, 13, 1, 14, 3, 2,
     ------------------------------------------------------------------------
     6, 5, 0, 8, 15, 16, 17, 19, 20, 18}}

o9 : List

i10 : 
