-- -*- M2-comint -*- hash: -706844698

i1 : A = QQ{x,y,z}

o1 = A

o1 : NCPolynomialRing

i2 : f = y*z + z*y - x^2

            2
o2 = zy+yz-x

o2 : A

i3 : g = x*z + z*x - y^2

         2
o3 = zx-y +xz

o3 : A

i4 : h = z^2 - x*y - y*x

      2
o4 = z -yx-xy

o4 : A

i5 : I = ncIdeal {f,g,h}

                             2      2      2
o5 = Two-sided ideal {zy+yz-x , zx-y +xz, z -yx-xy}

o5 : NCIdeal

i6 : Igb = ncGroebnerBasis I
--Calling Bergman for NCGB calculation.
--running: bergman -i /var/folders/46/9b86vqxj4hjcngvy7kd7sb140000gn/T/M2-12186-0/0.init -on-error exit --silent > /var/folders/46/9b86vqxj4hjcngvy7kd7sb140000gn/T/M2-12186-0/3.ter ... Complete!

      2    2                2
o6 = y x-xy ; Lead Term = (y x, 1)
       2  2                  2
     yx -x y; Lead Term = (yx , 1)
         2
     zx-y +xz; Lead Term = (zx, 1)
            2
     zy+yz-x ; Lead Term = (zy, 1)
      2                      2
     z -yx-xy; Lead Term = (z , 1)

o6 : NCGroebnerBasis

i7 : M = ncMatrix {{x, y, z}}

o7 = | x  y  z |

o7 : NCMatrix

i8 : sigma = ncMap(A,A,{y,z,x})

o8 = NCRingMap A <--- A

o8 : NCRingMap

i9 : N = ncMatrix {{M},{sigma M}, {sigma sigma M}}

o9 = | x  y  z |
     |         |
     | y  z  x |
     |         |
     | z  x  y |

o9 : NCMatrix

i10 : Nred = N^3 % Igb

      |   2   3               2       2    2     2                  2      2   2   3           2   3           2   3        |
o10 = | -y z+y +yxz-yxy+xyz+xy +2xyx+x z+3x y   y z+yxz+2yxy+xyz+3xy -xyx-x z+x y+x          2y z+y +yxy+xyx+2x z+x         |
      |                                                                                                                     |
      |   2                  2      2   2   3           2   3           2   3           2   3               2       2    2  |
      |  y z+yxz+2yxy+xyz+3xy -xyx-x z+x y+x          2y z+y +yxy+xyx+2x z+x          -y z+y +yxz-yxy+xyz+xy +2xyx+x z+3x y |
      |                                                                                                                     |
      |          2   3           2   3           2   3               2       2    2     2                  2      2   2   3 |
      |        2y z+y +yxy+xyx+2x z+x          -y z+y +yxz-yxy+xyz+xy +2xyx+x z+3x y   y z+yxz+2yxy+xyz+3xy -xyx-x z+x y+x  |

o10 : NCMatrix

i11 : B = A/I

o11 = B

o11 : NCQuotientRing

i12 : phi = ncMap(B,A,gens B)

o12 = NCRingMap B <--- A

o12 : NCRingMap

i13 : NB = phi N

o13 = | x  y  z |
      |         |
      | y  z  x |
      |         |
      | z  x  y |

o13 : NCMatrix

i14 : N3B = NB^3

      |   2   3               2       2    2     2                  2      2   2   3           2   3           2   3        |
o14 = | -y z+y +yxz-yxy+xyz+xy +2xyx+x z+3x y   y z+yxz+2yxy+xyz+3xy -xyx-x z+x y+x          2y z+y +yxy+xyx+2x z+x         |
      |                                                                                                                     |
      |   2                  2      2   2   3           2   3           2   3           2   3               2       2    2  |
      |  y z+yxz+2yxy+xyz+3xy -xyx-x z+x y+x          2y z+y +yxy+xyx+2x z+x          -y z+y +yxz-yxy+xyz+xy +2xyx+x z+3x y |
      |                                                                                                                     |
      |          2   3           2   3           2   3               2       2    2     2                  2      2   2   3 |
      |        2y z+y +yxy+xyx+2x z+x          -y z+y +yxz-yxy+xyz+xy +2xyx+x z+3x y   y z+yxz+2yxy+xyz+3xy -xyx-x z+x y+x  |

o14 : NCMatrix

i15 : (phi Nred) == N3B

o15 = true

i16 : 
