-- -*- M2-comint -*- hash: 2129454387

i1 : A = QQ{a,b,c,d}

o1 = A

o1 : NCPolynomialRing

i2 : M = ncMatrix {{a,b,c,d}}

o2 = | a  b  c  d |

o2 : NCMatrix

i3 : N = ncMatrix {{M,2*M,3*M},{4*M,5*M,6*M}}

o3 = |  a   b   c   d  2a  2b  2c  2d  3a  3b  3c  3d |
     |                                                |
     | 4a  4b  4c  4d  5a  5b  5c  5d  6a  6b  6c  6d |

o3 : NCMatrix

i4 : B = QQ{x,y,z}

o4 = B

o4 : NCPolynomialRing

i5 : f = y*z + z*y - x^2

            2
o5 = zy+yz-x

o5 : B

i6 : g = x*z + z*x - y^2

         2
o6 = zx-y +xz

o6 : B

i7 : h = z^2 - x*y - y*x

      2
o7 = z -yx-xy

o7 : B

i8 : I = ncIdeal {f,g,h}

                             2      2      2
o8 = Two-sided ideal {zy+yz-x , zx-y +xz, z -yx-xy}

o8 : NCIdeal

i9 : Igb = ncGroebnerBasis I
--Calling Bergman for NCGB calculation.
--running: bergman -i /var/folders/46/9b86vqxj4hjcngvy7kd7sb140000gn/T/M2-12571-0/0.init -on-error exit --silent > /var/folders/46/9b86vqxj4hjcngvy7kd7sb140000gn/T/M2-12571-0/3.ter ... Complete!

      2    2                2
o9 = y x-xy ; Lead Term = (y x, 1)
       2  2                  2
     yx -x y; Lead Term = (yx , 1)
         2
     zx-y +xz; Lead Term = (zx, 1)
            2
     zy+yz-x ; Lead Term = (zy, 1)
      2                      2
     z -yx-xy; Lead Term = (z , 1)

o9 : NCGroebnerBasis

i10 : M = ncMatrix {{x, y, z}}

o10 = | x  y  z |

o10 : NCMatrix

i11 : sigma = ncMap(B,B,{y,z,x})

o11 = NCRingMap B <--- B

o11 : NCRingMap

i12 : N = ncMatrix {{M},{sigma M}, {sigma sigma M}}

o12 = | x  y  z |
      |         |
      | y  z  x |
      |         |
      | z  x  y |

o12 : NCMatrix

i13 : Nred = N^3 % Igb

      |   2   3               2       2    2     2                  2      2   2   3           2   3           2   3        |
o13 = | -y z+y +yxz-yxy+xyz+xy +2xyx+x z+3x y   y z+yxz+2yxy+xyz+3xy -xyx-x z+x y+x          2y z+y +yxy+xyx+2x z+x         |
      |                                                                                                                     |
      |   2                  2      2   2   3           2   3           2   3           2   3               2       2    2  |
      |  y z+yxz+2yxy+xyz+3xy -xyx-x z+x y+x          2y z+y +yxy+xyx+2x z+x          -y z+y +yxz-yxy+xyz+xy +2xyx+x z+3x y |
      |                                                                                                                     |
      |          2   3           2   3           2   3               2       2    2     2                  2      2   2   3 |
      |        2y z+y +yxy+xyx+2x z+x          -y z+y +yxz-yxy+xyz+xy +2xyx+x z+3x y   y z+yxz+2yxy+xyz+3xy -xyx-x z+x y+x  |

o13 : NCMatrix

i14 : C = B/I

o14 = C

o14 : NCQuotientRing

i15 : phi = ncMap(C,B,gens C)

o15 = NCRingMap C <--- B

o15 : NCRingMap

i16 : NC = phi N

o16 = | x  y  z |
      |         |
      | y  z  x |
      |         |
      | z  x  y |

o16 : NCMatrix

i17 : N3C = NC^3

      |   2   3               2       2    2     2                  2      2   2   3           2   3           2   3        |
o17 = | -y z+y +yxz-yxy+xyz+xy +2xyx+x z+3x y   y z+yxz+2yxy+xyz+3xy -xyx-x z+x y+x          2y z+y +yxy+xyx+2x z+x         |
      |                                                                                                                     |
      |   2                  2      2   2   3           2   3           2   3           2   3               2       2    2  |
      |  y z+yxz+2yxy+xyz+3xy -xyx-x z+x y+x          2y z+y +yxy+xyx+2x z+x          -y z+y +yxz-yxy+xyz+xy +2xyx+x z+3x y |
      |                                                                                                                     |
      |          2   3           2   3           2   3               2       2    2     2                  2      2   2   3 |
      |        2y z+y +yxy+xyx+2x z+x          -y z+y +yxz-yxy+xyz+xy +2xyx+x z+3x y   y z+yxz+2yxy+xyz+3xy -xyx-x z+x y+x  |

o17 : NCMatrix

i18 : X = NC + 3*NC

o18 = | 4x  4y  4z |
      |            |
      | 4y  4z  4x |
      |            |
      | 4z  4x  4y |

o18 : NCMatrix

i19 : Y = NC | 2*NC

o19 = | x  y  z  2x  2y  2z |
      |                     |
      | y  z  x  2y  2z  2x |
      |                     |
      | z  x  y  2z  2x  2y |

o19 : NCMatrix

i20 : Z = X || NC

o20 = | 4x  4y  4z |
      |            |
      | 4y  4z  4x |
      |            |
      | 4z  4x  4y |
      |            |
      |  x   y   z |
      |            |
      |  y   z   x |
      |            |
      |  z   x   y |

o20 : NCMatrix

i21 : 
