-- -*- M2-comint -*- hash: 32498360

i1 : A = QQ{x,y,z}

o1 = A

o1 : NCPolynomialRing

i2 : M = ncMatrix {{x, y, z}}

o2 = | x y z |

o2 : NCMatrix

i3 : sigma = ncMap(A,A,{y,z,x})

o3 = NCRingMap A <--- A

o3 : NCRingMap

i4 : N = ncMatrix {{M},{sigma M}, {sigma sigma M}}

o4 = | x y z |
     | y z x |
     | z x y |

o4 : NCMatrix

i5 : N^3

o5 = | z^2*x+z*y*z+z*x*y+y*z*y+y^2*x+y*x*z+x*z^2+x*y^2+x^3 z^2*y+z*y*x+z*x*z+y*z^2+y^3+y*x^2+x*z*x+x*y*z+x^2*y z^3+z*y^2+z*x^2+y*z*x+y^2*z+y*x*y+x*z*y+x*y*x+x^2*z |
     | z^2*y+z*y*x+z*x*z+y*z^2+y^3+y*x^2+x*z*x+x*y*z+x^2*y z^3+z*y^2+z*x^2+y*z*x+y^2*z+y*x*y+x*z*y+x*y*x+x^2*z z^2*x+z*y*z+z*x*y+y*z*y+y^2*x+y*x*z+x*z^2+x*y^2+x^3 |
     | z^3+z*y^2+z*x^2+y*z*x+y^2*z+y*x*y+x*z*y+x*y*x+x^2*z z^2*x+z*y*z+z*x*y+y*z*y+y^2*x+y*x*z+x*z^2+x*y^2+x^3 z^2*y+z*y*x+z*x*z+y*z^2+y^3+y*x^2+x*z*x+x*y*z+x^2*y |

o5 : NCMatrix

i6 : B = A/ncIdeal{y*z + z*y - x^2, x*z + z*x - y^2, z^2 - x*y - y*x}
--Calling Bergman for NCGB calculation.
Complete!

o6 = B

o6 : NCQuotientRing

i7 : NB = promote(N,B)

o7 = | x y z |
     | y z x |
     | z x y |

o7 : NCMatrix

i8 : NB^3

o8 = | -y^2*z+y^3+y*x*z-y*x*y+x*y*z+x*y^2+2*x*y*x+x^2*z+3*x^2*y y^2*z+y*x*z+2*y*x*y+x*y*z+3*x*y^2-x*y*x-x^2*z+x^2*y+x^3  2*y^2*z+y^3+y*x*y+x*y*x+2*x^2*z+x^3                      |
     | y^2*z+y*x*z+2*y*x*y+x*y*z+3*x*y^2-x*y*x-x^2*z+x^2*y+x^3  2*y^2*z+y^3+y*x*y+x*y*x+2*x^2*z+x^3                      -y^2*z+y^3+y*x*z-y*x*y+x*y*z+x*y^2+2*x*y*x+x^2*z+3*x^2*y |
     | 2*y^2*z+y^3+y*x*y+x*y*x+2*x^2*z+x^3                      -y^2*z+y^3+y*x*z-y*x*y+x*y*z+x*y^2+2*x*y*x+x^2*z+3*x^2*y y^2*z+y*x*z+2*y*x*y+x*y*z+3*x*y^2-x*y*x-x^2*z+x^2*y+x^3  |

o8 : NCMatrix

i9 : 
