-- -*- M2-comint -*- hash: 32498360

i1 : A = QQ{x,y,z}

o1 = A

o1 : NCPolynomialRing

i2 : M = ncMatrix {{x, y, z}}

o2 = | x  y  z |

o2 : NCMatrix

i3 : sigma = ncMap(A,A,{y,z,x})

o3 = NCRingMap A <--- A

o3 : NCRingMap

i4 : N = ncMatrix {{M},{sigma M}, {sigma sigma M}}

o4 = | x  y  z |
     |         |
     | y  z  x |
     |         |
     | z  x  y |

o4 : NCMatrix

i5 : N^3

     |  2               2        2   2  3   2            2  3   2          2    3   2   2      2               2  |
o5 = | z x+zyz+zxy+yzy+y x+yxz+xz +xy +x   z y+zyx+zxz+yz +y +yx +xzx+xyz+x y  z +zy +zx +yzx+y z+yxy+xzy+xyx+x z |
     |                                                                                                            |
     |  2            2  3   2          2    3   2   2      2               2    2               2        2   2  3 |
     | z y+zyx+zxz+yz +y +yx +xzx+xyz+x y  z +zy +zx +yzx+y z+yxy+xzy+xyx+x z  z x+zyz+zxy+yzy+y x+yxz+xz +xy +x  |
     |                                                                                                            |
     |  3   2   2      2               2    2               2        2   2  3   2            2  3   2          2  |
     | z +zy +zx +yzx+y z+yxy+xzy+xyx+x z  z x+zyz+zxy+yzy+y x+yxz+xz +xy +x   z y+zyx+zxz+yz +y +yx +xzx+xyz+x y |

o5 : NCMatrix

i6 : B = A/ncIdeal{y*z + z*y - x^2, x*z + z*x - y^2, z^2 - x*y - y*x}
--Calling Bergman for NCGB calculation.
--running: bergman -i /var/folders/46/9b86vqxj4hjcngvy7kd7sb140000gn/T/M2-12291-0/0.init -on-error exit --silent > /var/folders/46/9b86vqxj4hjcngvy7kd7sb140000gn/T/M2-12291-0/3.ter ... Complete!

o6 = B

o6 : NCQuotientRing

i7 : NB = promote(N,B)

o7 = | x  y  z |
     |         |
     | y  z  x |
     |         |
     | z  x  y |

o7 : NCMatrix

i8 : NB^3

     |   2   3               2       2    2     2                  2      2   2   3           2   3           2   3        |
o8 = | -y z+y +yxz-yxy+xyz+xy +2xyx+x z+3x y   y z+yxz+2yxy+xyz+3xy -xyx-x z+x y+x          2y z+y +yxy+xyx+2x z+x         |
     |                                                                                                                     |
     |   2                  2      2   2   3           2   3           2   3           2   3               2       2    2  |
     |  y z+yxz+2yxy+xyz+3xy -xyx-x z+x y+x          2y z+y +yxy+xyx+2x z+x          -y z+y +yxz-yxy+xyz+xy +2xyx+x z+3x y |
     |                                                                                                                     |
     |          2   3           2   3           2   3               2       2    2     2                  2      2   2   3 |
     |        2y z+y +yxy+xyx+2x z+x          -y z+y +yxz-yxy+xyz+xy +2xyx+x z+3x y   y z+yxz+2yxy+xyz+3xy -xyx-x z+x y+x  |

o8 : NCMatrix

i9 : 
