-- -*- M2-comint -*- hash: -2114378369

i1 : C = fourDimSklyanin(QQ,{a,b,c,d})
--Calling Bergman for NCGB calculation.
Complete!

o1 = C

o1 : NCQuotientRing

i2 : ncGroebnerBasis ideal C

         2  1818276801    2 2143385  2   14253260827  3   150884721  4  10166949  4  2560916417  2 2  444796  4  372650850976079      166872692193833   2   172755830058223 2     26773655493 3 2 138932082197701 3 2  3633135120329 3 2                   2
o2 = babc - ----------baba +-------ba ba+-----------ba b- ---------ad - --------ac - ----------ab c - ------ab - ---------------ababa+---------------aba b- ---------------a bab- -----------a d +---------------a c - -------------a b ; Lead Term = (babc , 1)
             116742400       177408       525340800        51074800      1276870      849756985       638435      58417371619200       9789200467200         12981638137600        3283403200      11358933370400       93875482400
         1    4
     db- -bd- -ac; Lead Term = (db, 1)
         3    3
        2    1
     ca+-bd- -ac; Lead Term = (ca, 1)
        3    3
      2   154     468  2 792  2  1089  2                2
     b a- ---bab- ---ad +---ac - ----ab ; Lead Term = (b a, 1)
          919     919    919      919
        3 324950129    2  844561  2    324950129  3  124834203  4 16823214  4 8946325044  2 2 728827  4 34474710943933       16892056950761   2  15141244924951 2    24103521 3 2  125076396897 3 2 325473383 3 2                  3
     bab +---------baba - ------ba ba- ---------ba b+---------ad +--------ac +----------ab c +------ab +--------------ababa- --------------aba b+--------------a bab+--------a d - ------------a c +---------a b ; Lead Term = (bab , 1)
          160520800       271040       160520800     140455700     7022785    9347326835      638435    17849752439200        2991144587200       8924876219600       9825200       33990279400      25537400
        3   3890140   2   12943        43  2    911  3   1204  3    35878612        9267643   2    1314768  2 3    9717484  2 2  4958833111 2      71950438 3      7012096   4                   3
     bac - --------bab c- -----babad- ---ba bd- ---ba c- ----ab c- ----------ababd+--------aba c- ---------a d - ----------a b d+----------a bac- ---------a bc- -----------a d; Lead Term = (bac , 1)
           10280853       49720       120       720      2757      4294592685      37384920       477176965      1431530895      4580898864       139352565      15746839845
        11    7
     dc+--ba+--ab; Lead Term = (dc, 1)
        18   18
         40    7
     da- --bc+--ad; Lead Term = (da, 1)
         33   33
         7   26
     cb+--bc+--ad; Lead Term = (cb, 1)
        33   33
          7    11
     cd- --ba- --ab; Lead Term = (cd, 1)
         18    18
       2  20  2  11  2   7    919 2                  2
     bd - --bc - --ba - --aba+---a b; Lead Term = (bd , 1)
          11      4     18    396
        2  2260   2  799760   2 10109  3  4480    2  745360  3   713377   2  80758031 2    822640 3                   2
     bad - ----bac +-------bab +-----ba +------abc +-------ab - -------aba - --------a ba+-------a b; Lead Term = (bad , 1)
           1419     1066959      4644    118551     1066959     2133918      46946196     1066959
       3  8 3   116489     1153  2    11739  3   347053  2   370237      108715153 2     31304  3                  3
     bc +--b c- ------babd+----ba c- ------ad - -------ab d+-------abac- ---------a bc- -------a d; Lead Term = (bc , 1)
         99     330840      720      101090     1213080     3639240       80063280      1667985
           726822279  2 2  730237383  2 2  18634  2 2  776151559  4     2 324950129   3  1008 2  2 18634 2 3 74611264729 2  2  230516 3   20566 4
     babab+---------ba d - ---------ba c - -----ba b - ---------ba -abab +---------aba +-----a bc +-----a b +-----------a ba - ------a ba+-----a b; Lead Term = (babab, 1)
           561822800       309002540       91205       204299200          160520800     91205      91205     24720203200        91205     91205

o2 : NCGroebnerBasis

i3 : centralElements(C,2)

o3 = | c^2-11/9*b^2+13/9*a^2 d^2+20/9*b^2-22/9*a^2 |

o3 : NCMatrix

i4 : hilbertBergman(C, DegreeLimit => 6)
--Calling bergman for HS computation.
Complete!

                 2      3      4      5      6
o4 = 1 + 4T + 10T  + 20T  + 35T  + 56T  + 84T

o4 : ZZ[T]

i5 : 
