-- -*- M2-comint -*- {* hash: -264889504 *}

i1 : A = QQ{x,y,z}

o1 = A

o1 : NCPolynomialRing

i2 : isCommutative A

o2 = false

i3 : B = skewPolynomialRing(QQ,(-1)_QQ,{x,y,z})
--Calling Bergman for NCGB calculation.
--running: bergman -i /var/folders/hb/yy6pwl7d1qqf1w7mwkyxb4gm0000gn/T/M2-30164-0/0.init -on-error exit --silent > /var/folders/hb/yy6pwl7d1qqf1w7mwkyxb4gm0000gn/T/M2-30164-0/3.ter ... Complete!

o3 = B

o3 : NCQuotientRing

i4 : isCommutative B

o4 = false

i5 : C = skewPolynomialRing(QQ,1_QQ,{x,y,z})
--Calling Bergman for NCGB calculation.
--running: bergman -i /var/folders/hb/yy6pwl7d1qqf1w7mwkyxb4gm0000gn/T/M2-30164-0/5.init -on-error exit --silent > /var/folders/hb/yy6pwl7d1qqf1w7mwkyxb4gm0000gn/T/M2-30164-0/8.ter ... Complete!

o5 = C

o5 : NCQuotientRing

i6 : isCommutative C

o6 = true

i7 : D = toNCRing(QQ[x,y,SkewCommutative=>true])
--Calling Bergman for NCGB calculation.
--running: bergman -i /var/folders/hb/yy6pwl7d1qqf1w7mwkyxb4gm0000gn/T/M2-30164-0/10.init -on-error exit --silent > /var/folders/hb/yy6pwl7d1qqf1w7mwkyxb4gm0000gn/T/M2-30164-0/13.ter ... Complete!

o7 = D

o7 : NCQuotientRing

i8 : isExterior D

o8 = true

i9 : 
