-- -*- M2-comint -*- hash: -1883275319

i1 : A = QQ{a,b,c}

o1 = A

o1 : NCPolynomialRing

i2 : I = ncIdeal {a*b+b*a,a*c+c*a,b*c+c*b}

o2 = Two-sided ideal {ba+ab, ca+ac, cb+bc}

o2 : NCIdeal

i3 : B = A/I
--Calling Bergman for NCGB calculation.
--running: bergman -i /var/folders/46/9b86vqxj4hjcngvy7kd7sb140000gn/T/M2-12500-0/0.init -on-error exit --silent > /var/folders/46/9b86vqxj4hjcngvy7kd7sb140000gn/T/M2-12500-0/3.ter ... Complete!

o3 = B

o3 : NCQuotientRing

i4 : sigma = ncMap(B,B,{b,c,a})

o4 = NCRingMap B <--- B

o4 : NCRingMap

i5 : isWellDefined sigma

o5 = true

i6 : C = oreExtension(B,sigma,w)
--Calling Bergman for NCGB calculation.
--running: bergman -i /var/folders/46/9b86vqxj4hjcngvy7kd7sb140000gn/T/M2-12500-0/5.init -on-error exit --silent > /var/folders/46/9b86vqxj4hjcngvy7kd7sb140000gn/T/M2-12500-0/8.ter ... Complete!

o6 = C

o6 : NCQuotientRing

i7 : isNormal w^2

o7 = true

i8 : phi = normalAutomorphism w^2

o8 = NCRingMap C <--- C

o8 : NCRingMap

i9 : matrix phi

o9 = | c  a  b  w |

o9 : NCMatrix

i10 : (matrix sigma @@ sigma)

o10 = | c  a  b |

o10 : NCMatrix

i11 : 
