-- -*- M2-comint -*- {* hash: 1828487821 *}

i1 : R = QQ[a,b,c];

i2 : I = ideal(a+b,b+c);

o2 : Ideal of R

i3 : gfan(I)
This is the Gfan program for computing Groebner fans and tropical varieties.
Use the command "gfan list" to view all subcommands.
The command "gfan" is deprecate for computing all Groebner bases of an ideal.
Please use subcommand "gfan _bases" instead. Awaiting input. <Ctrl>-D to end.
LP algorithm being used: "cddgmp".

o3 = ({{b, a}, {c, a}, {c, b}}, {{b + c, a - c}, {b + c, a + b}, {- a + c, a
     ------------------------------------------------------------------------
     + b}})

o3 : Sequence

i4 : gfan(I, Symmetries => {(c,b,a)})
This is the Gfan program for computing Groebner fans and tropical varieties.
Use the command "gfan list" to view all subcommands.
The command "gfan" is deprecate for computing all Groebner bases of an ideal.
Please use subcommand "gfan _bases" instead. Awaiting input. <Ctrl>-D to end.
LP algorithm being used: "cddgmp".

o4 = ({{b, a}, {c, a}}, {{b + c, a - c}, {b + c, a + b}})

o4 : Sequence

i5 : R = QQ[a,b,c,d,e];

i6 : I = ideal"a+b+c+d,ab+bc+cd+da,abc+bcd+cda+dab,abcd-e4"

                                                                         
o6 = ideal (a + b + c + d, a*b + b*c + a*d + c*d, a*b*c + a*b*d + a*c*d +
     ------------------------------------------------------------------------
                       4
     b*c*d, a*b*c*d - e )

o6 : Ideal of R

i7 : #universalGroebnerBasis(I)
This is the Gfan program for computing Groebner fans and tropical varieties.
Use the command "gfan list" to view all subcommands.
The command "gfan" is deprecate for computing all Groebner bases of an ideal.
Please use subcommand "gfan _bases" instead. Awaiting input. <Ctrl>-D to end.
LP algorithm being used: "cddgmp".

o7 = 75

i8 : #universalGroebnerBasis(I, Symmetries => {(b,c,d,a,e)})
This is the Gfan program for computing Groebner fans and tropical varieties.
Use the command "gfan list" to view all subcommands.
The command "gfan" is deprecate for computing all Groebner bases of an ideal.
Please use subcommand "gfan _bases" instead. Awaiting input. <Ctrl>-D to end.
LP algorithm being used: "cddgmp".

o8 = 31

i9 : 
