-- -*- M2-comint -*- {* hash: 1828487821 *}

i1 : R = QQ[a,b,c];

i2 : I = ideal(a+b,b+c);

o2 : Ideal of R

i3 : gfan(I)
using temporary file /tmp/M2-83087-1

o3 = ({{b, a}, {c, a}, {c, b}}, {{b + c, a - c}, {b + c, a + b}, {- a + c, a
     ------------------------------------------------------------------------
     + b}})

o3 : Sequence

i4 : gfan(I, Symmetries => {(c,b,a)})
using temporary file /tmp/M2-83087-2

o4 = ({{b, a}, {c, a}}, {{b + c, a - c}, {b + c, a + b}})

o4 : Sequence

i5 : R = QQ[a,b,c,d,e];

i6 : I = ideal"a+b+c+d,ab+bc+cd+da,abc+bcd+cda+dab,abcd-e4"

                                                                         
o6 = ideal (a + b + c + d, a*b + b*c + a*d + c*d, a*b*c + a*b*d + a*c*d +
     ------------------------------------------------------------------------
                       4
     b*c*d, a*b*c*d - e )

o6 : Ideal of R

i7 : #universalGroebnerBasis(I)
using temporary file /tmp/M2-83087-3

o7 = 75

i8 : #universalGroebnerBasis(I, Symmetries => {(b,c,d,a,e)})
using temporary file /tmp/M2-83087-4

o8 = 27

i9 : 
