-- -*- M2-comint -*- {* hash: 1483647165 *}

i1 : QQ[x,y,z]

o1 = QQ[x, y, z]

o1 : PolynomialRing

i2 : I = ideal "x4,y4,z4,xy2z3,x3yz2,x2y3z"

             4   4   4     2 3   3   2   2 3
o2 = ideal (x , y , z , x*y z , x y*z , x y z)

o2 : Ideal of QQ[x, y, z]

i3 : J = ideal "x4,y4,z4,x2y2z2"

             4   4   4   2 2 2
o3 = ideal (x , y , z , x y z )

o3 : Ideal of QQ[x, y, z]

i4 : null -- renderStaircase(I)

i5 : null -- renderStaircase("twostairs.fig", 6,2,{I,J})

i6 : 
