-- -*- M2-comint -*- hash: -258554283

i1 : k=4;

i2 : n = 8;

i3 : SchubProbP = {{2,2},{2,2},{2,2},{1},{1},{1},{1}}

o3 = {{2, 2}, {2, 2}, {2, 2}, {1}, {1}, {1}, {1}}

o3 : List

i4 : NSC2phc(SchubProbP,k,n)

o4 = | 3 3 4 7 8 |
     | 4 4 6 7 8 |

              2        5
o4 : Matrix ZZ  <--- ZZ

i5 : k=4;

i6 : n = 8;

i7 : SchubProbB = {{3,4,7,8},{3,4,7,8},{3,4,7,8},{4,6,7,8},{4,6,7,8},{4,6,7,8},{4,6,7,8}}

o7 = {{3, 4, 7, 8}, {3, 4, 7, 8}, {3, 4, 7, 8}, {4, 6, 7, 8}, {4, 6, 7, 8},
     ------------------------------------------------------------------------
     {4, 6, 7, 8}, {4, 6, 7, 8}}

o7 : List

i8 : NSC2phc(SchubProbB,4,8)

o8 = | 3 3 4 7 8 |
     | 4 4 6 7 8 |

              2        5
o8 : Matrix ZZ  <--- ZZ

i9 : 
