-- -*- M2-comint -*- hash: 1508845116

i1 : stdio<< "Schubert problem (2,1)^3 in Gr(3,6)"<<endl;
Schubert problem (2,1)^3 in Gr(3,6)

i2 : k=3; n=6;

i4 : l1={2,1};

i5 : l2={2,1};

i6 : l3={2,1};

i7 : stdio<<"Generate flags F: standard flag, oposite flag, and one random"<<endl;
Generate flags F: standard flag, oposite flag, and one random

i8 : F = {(l1, id_(CC^n)), (l2, rsort id_(CC^n)), (l3,random(CC^n,CC^n))}

o8 = {({2, 1}, | 1 0 0 0 0 0 |), ({2, 1}, | 0 0 0 0 0 1 |), ({2, 1}, |
               | 0 1 0 0 0 0 |            | 0 0 0 0 1 0 |            |
               | 0 0 1 0 0 0 |            | 0 0 0 1 0 0 |            |
               | 0 0 0 1 0 0 |            | 0 0 1 0 0 0 |            |
               | 0 0 0 0 1 0 |            | 0 1 0 0 0 0 |            |
               | 0 0 0 0 0 1 |            | 1 0 0 0 0 0 |            |
     ------------------------------------------------------------------------
     .892712+.673395ii  .0741835+.808694ii .830833+.538554ii 
     .29398+.632944ii   .362835+.706096ii  .873665+.415912ii 
     .0258884+.714827ii .127435+.254482ii  .606588+.848005ii 
     .89189+.231053ii   .741046+.108386ii  .191734+.403215ii 
     .461944+.775187ii  .348931+.562428ii  .615911+.0147867ii
     .909047+.314897ii  .246268+.153346ii  .223028+.388829ii 
     ------------------------------------------------------------------------
     .557119+.873708ii .0647412+.877846ii .444183+.644366ii |)}
     .7037+.681869ii   .0340514+.507989ii .194945+.518585ii |
     .276259+.605659ii .150294+.656391ii  .987173+.568273ii |
     .96518+.681683ii  .174853+.626892ii  .184779+.370833ii |
     .914199+.887381ii .350611+.379495ii  .339222+.062212ii |
     .169813+.965004ii .237252+.116721ii  .465736+.40273ii  |

o8 : List

i9 : stdio<<"Generate a random set of flags G"<<endl;
Generate a random set of flags G

i10 : G = randomSchubertProblemInstance({l1,l2,l3},k,n)

o10 = {({2, 1}, | .51095+.859611ii     -.227376-.973807ii .842765-.538281ii 
                | -.923063-.384649ii   -.684587-.728932ii -.991977+.126418ii
                | .91893+.394421ii     -.210222+.977654ii .990088-.140449ii 
                | -.999969-.00781125ii .565772+.824562ii  -.978842+.204616ii
                | .276727+.960949ii    -.166675+.986012ii .824149+.566373ii 
                | .869663+.493645ii    .794218+.607632ii  -.191573+.981478ii
      -----------------------------------------------------------------------
      -.915156-.403101ii -.341238+.939977ii -.110622-.993863ii |), ({2, 1}, |
      .398109-.917338ii  .989783-.142579ii  .930733+.365699ii  |            |
      .233835+.972276ii  -.834955-.550318ii .491643-.870797ii  |            |
      .0976385-.995222ii -.344326+.93885ii  -.974074-.226228ii |            |
      -.788618-.614883ii .74405-.668124ii   .936252-.351329ii  |            |
      -.987864+.155324ii .68453+.728985ii   -.990213-.139564ii |            |
      -----------------------------------------------------------------------
      .476077+.879404ii  -.535925+.844266ii  .415186-.909737ii 
      .990856+.13492ii   -.211093+.977466ii  .984107-.177574ii 
      -.764815-.64425ii  -.64519-.764022ii   .93104+.364917ii  
      -.872433-.488734ii -.636591-.771201ii  .874934-.484241ii 
      -.989838+.142201ii .999541+.0302879ii  -.975254+.221086ii
      -.688944+.724814ii -.997188-.0749361ii .349542-.936921ii 
      -----------------------------------------------------------------------
      .194585-.980886ii  .109319-.994007ii  .560285+.8283ii    |), ({2, 1}, |
      .0000532609+1ii    .978795+.20484ii   .241807+.970324ii  |            |
      .923802+.382872ii  -.129853+.991533ii .889567+.456804ii  |            |
      -.928187-.372115ii .576111-.817371ii  .0831894-.996534ii |            |
      .501178+.865344ii  .158064+.987429ii  .999659+.0261017ii |            |
      -.979473-.201574ii -.898212-.439562ii -.120953+.992658ii |            |
      -----------------------------------------------------------------------
      .827089-.562071ii  -.999917-.0129164ii .766022-.642815ii 
      -.962867-.269978ii .230456+.973083ii   -.633104+.774066ii
      -.963229-.268683ii -.536928-.843628ii  -.988351+.152194ii
      .760295+.649578ii  -.540848-.841121ii  -.590944-.806712ii
      .136209-.99068ii   -.0626679-.998034ii .296021+.955182ii 
      -.36939-.929274ii  .113904+.993492ii   .980864+.194693ii 
      -----------------------------------------------------------------------
      .883228+.468944ii   -.87188+.48972ii    .646246+.763129ii  |)}
      .00745646-.999972ii -.0159426+.999873ii .799835+.600219ii  |
      .781806+.623522ii   .667932+.744222ii   -.876997+.480495ii |
      -.92023-.391377ii   -.96194+.273261ii   .999561+.0296182ii |
      .154803-.987945ii   -.938662-.344838ii  .861477-.507797ii  |
      -.764544+.644572ii  .986813+.161867ii   .983563+.180565ii  |

o10 : List

i11 : stdio<<"We solve with respect to F"<<endl;
We solve with respect to F

i12 : S = solveSchubertProblem(F,k,n)

o12 = {| 1.19794+1.17845ii 0                  0                 |, |
       | 1                 0                  0                 |  |
       | 0                 -.167673-.067078ii 0                 |  |
       | 0                 1                  0                 |  |
       | 0                 0                  .777616-.719709ii |  |
       | 0                 0                  1                 |  |
      -----------------------------------------------------------------------
      .28234+1.41066ii 0                 0                  |}
      1                0                 0                  |
      0                .666069-.500515ii 0                  |
      0                1-5.55112e-17ii   0                  |
      0                0                 -.480231-.307979ii |
      0                0                 1                  |

o12 : List

i13 : FlagsF = F/last;

i14 : FlagsG = G/last;

i15 : stdio<< "and we transform the solutions to get solutions with respect to G"<<endl;
and we transform the solutions to get solutions with respect to G

i16 : stdio<< "We can also choose a different strategy"<<endl;
We can also choose a different strategy

i17 : 
