-- -*- M2-comint -*- {* hash: 1508845116 *}
-- COMPILE TIME: Oct  7 2016, 07:56:28
--loading configuration for package "PHCpack" from file /Users/leykin/Library/Application Support/Macaulay2/init-PHCpack.m2
--loading configuration for package "NumericalAlgebraicGeometry" from file /Users/leykin/Library/Application Support/Macaulay2/init-NumericalAlgebraicGeometry.m2
--loading configuration for package "Bertini" from file /Users/leykin/Library/Application Support/Macaulay2/init-Bertini.m2

i1 : stdio<< "Schubert problem (2,1)^3 in Gr(3,6)"<<endl;
Schubert problem (2,1)^3 in Gr(3,6)

i2 : k=3; n=6;

i4 : l1={2,1};

i5 : l2={2,1};

i6 : l3={2,1};

i7 : stdio<<"Generate flags F: standard flag, oposite flag, and one random"<<endl;
Generate flags F: standard flag, oposite flag, and one random

i8 : F = {(l1, id_(CC^n)), (l2, rsort id_(CC^n)), (l3,random(CC^n,CC^n))}

o8 = {({2, 1}, | 1 0 0 0 0 0 |), ({2, 1}, | 0 0 0 0 0 1 |), ({2, 1}, |
               | 0 1 0 0 0 0 |            | 0 0 0 0 1 0 |            |
               | 0 0 1 0 0 0 |            | 0 0 0 1 0 0 |            |
               | 0 0 0 1 0 0 |            | 0 0 1 0 0 0 |            |
               | 0 0 0 0 1 0 |            | 0 1 0 0 0 0 |            |
               | 0 0 0 0 0 1 |            | 1 0 0 0 0 0 |            |
     ------------------------------------------------------------------------
     .892712+.673395i .074184+.808694i .830833+.538554i .557119+.873708i
     .29398+.632944i  .362835+.706096i .873665+.415912i .7037+.681869i  
     .025888+.714827i .127435+.254482i .606588+.848005i .276259+.605659i
     .89189+.231053i  .741046+.108386i .191734+.403215i .96518+.681683i 
     .461944+.775187i .348931+.562428i .615911+.014787i .914199+.887381i
     .909047+.314897i .246268+.153346i .223028+.388829i .169813+.965004i
     ------------------------------------------------------------------------
     .064741+.877846i .444183+.644366i |)}
     .034051+.507989i .194945+.518585i |
     .150294+.656391i .987173+.568273i |
     .174853+.626892i .184779+.370833i |
     .350611+.379495i .339222+.062212i |
     .237252+.116721i .465736+.40273i  |

o8 : List

i9 : stdio<<"Generate a random set of flags G"<<endl;
Generate a random set of flags G

i10 : G = randomSchubertProblemInstance({l1,l2,l3},k,n)

o10 = {({2, 1}, | .51095+.859611i   -.227376-.973807i .842765-.538281i 
                | -.923063-.384649i -.684587-.728932i -.991977+.126418i
                | .91893+.394421i   -.210222+.977654i .990088-.140449i 
                | -.999969-.007811i .565772+.824562i  -.978842+.204616i
                | .276727+.960949i  -.166675+.986012i .824149+.566373i 
                | .869663+.493645i  .794218+.607632i  -.191573+.981478i
      -----------------------------------------------------------------------
      -.915156-.403101i -.341238+.939977i -.110622-.993863i |), ({2, 1}, |
      .398109-.917338i  .989783-.142579i  .930733+.365699i  |            |
      .233835+.972276i  -.834955-.550318i .491643-.870797i  |            |
      .097639-.995222i  -.344326+.93885i  -.974074-.226228i |            |
      -.788618-.614883i .74405-.668124i   .936252-.351329i  |            |
      -.987864+.155324i .68453+.728985i   -.990213-.139564i |            |
      -----------------------------------------------------------------------
      .476077+.879404i  -.535925+.844266i .415186-.909737i  .194585-.980886i 
      .990856+.13492i   -.211093+.977466i .984107-.177574i  .000053+i        
      -.764815-.64425i  -.64519-.764022i  .93104+.364917i   .923802+.382872i 
      -.872433-.488734i -.636591-.771201i .874934-.484241i  -.928187-.372115i
      -.989838+.142201i .999541+.030288i  -.975254+.221086i .501178+.865344i 
      -.688944+.724814i -.997188-.074936i .349542-.936921i  -.979473-.201574i
      -----------------------------------------------------------------------
      .109319-.994007i  .560285+.8283i    |), ({2, 1}, | .827089-.562071i 
      .978795+.20484i   .241807+.970324i  |            | -.962867-.269978i
      -.129853+.991533i .889567+.456804i  |            | -.963229-.268683i
      .576111-.817371i  .083189-.996534i  |            | .760295+.649578i 
      .158064+.987429i  .999659+.026102i  |            | .136209-.99068i  
      -.898212-.439562i -.120953+.992658i |            | -.36939-.929274i 
      -----------------------------------------------------------------------
      -.999917-.012916i .766022-.642815i  .883228+.468944i  -.87188+.48972i  
      .230456+.973083i  -.633104+.774066i .007456-.999972i  -.015943+.999873i
      -.536928-.843628i -.988351+.152194i .781806+.623522i  .667932+.744222i 
      -.540848-.841121i -.590944-.806712i -.92023-.391377i  -.96194+.273261i 
      -.062668-.998034i .296021+.955182i  .154803-.987945i  -.938662-.344838i
      .113904+.993492i  .980864+.194693i  -.764544+.644572i .986813+.161867i 
      -----------------------------------------------------------------------
      .646246+.763129i  |)}
      .799835+.600219i  |
      -.876997+.480495i |
      .999561+.029618i  |
      .861477-.507797i  |
      .983563+.180565i  |

o10 : List

i11 : stdio<<"We solve with respect to F"<<endl;
We solve with respect to F

i12 : S = solveSchubertProblem(F,k,n)

o12 = {| 1.19794+1.17845i 0                 0                |, |
       | 1                0                 0                |  |
       | 0                -.167673-.067078i 0                |  |
       | 0                1                 0                |  |
       | 0                0                 .777616-.719709i |  |
       | 0                0                 1                |  |
      -----------------------------------------------------------------------
      .28234+1.41066i 0                0                 |}
      1               0                0                 |
      0               .666069-.500515i 0                 |
      0               1                0                 |
      0               0                -.480231-.307979i |
      0               0                1                 |

o12 : List

i13 : FlagsF = F/last;

i14 : FlagsG = G/last;

i15 : stdio<< "and we transform the solutions to get solutions with respect to G"<<endl;
and we transform the solutions to get solutions with respect to G

i16 : stdio<< "We can also choose a different strategy"<<endl;
We can also choose a different strategy

i17 : 
