-- -*- M2-comint -*-

i1 : R = ZZ/101[a..c];

i2 : vars R ++ transpose vars R

o2 = {0}  | a b c 0 |
     {-1} | 0 0 0 a |
     {-1} | 0 0 0 b |
     {-1} | 0 0 0 c |

             4       4
o2 : Matrix R  <--- R

i3 : oo^[1]

o3 = {-1} | 0 0 0 a |
     {-1} | 0 0 0 b |
     {-1} | 0 0 0 c |

             3       4
o3 : Matrix R  <--- R

i4 : a++b++c

o4 = | a 0 0 |
     | 0 b 0 |
     | 0 0 c |

             3       3
o4 : Matrix R  <--- R

i5 : 
