-- -*- M2-comint -*-

i1 : "abc" | "def"

o1 = abcdef

i2 : x = "abc" || "ABC"

o2 = abc
     ABC

i3 : x|"x"|x

o3 = abcxabc
     ABC ABC

i4 : "t = " | 333

o4 = t = 333

i5 : 
