-- -*- M2-comint -*-

i1 : R = QQ[a..d]

o1 = R

o1 : PolynomialRing

i2 : R^{-1}

      1
o2 = R

o2 : R-module, free, degrees {1}

i3 : R^{-1,2:-2,-3}

      4
o3 = R

o3 : R-module, free, degrees {1, 2, 2, 3}

i4 : R = QQ[x,y,z,Degrees=>{{1,0},{1,-1},{1,-2}}]

o4 = R

o4 : PolynomialRing

i5 : R^{{1,2}}

      1
o5 = R

o5 : R-module, free, degrees {{-1, -2}}

i6 : 
