-- -*- M2-comint -*-

i1 : 4/2

o1 = 2

o1 : QQ

i2 : R = GF(9,Variable=>a);

i3 : (a/a^3) * a^2 == 1

o3 = true

i4 : S = ZZ[a,b]

o4 = S

o4 : PolynomialRing

i5 : (a^6-b^6)/(a^9-b^9)

          3    3
         a  + b
o5 = --------------
      6    3 3    6
     a  + a b  + b

o5 : frac(S)

i6 : A = ZZ/101[a,b]/(a*b)

o6 = A

o6 : QuotientRing

i7 : (a+b)/(a-b)

     a + b
o7 = -----
     a - b

o7 : frac(A)

i8 : f = a/b

     a
o8 = -
     b

o8 : frac(A)

i9 : 
