-- -*- M2-comint -*-

i1 : A = set {1,2};

i2 : R = QQ[a..d];

i3 : B = set{a^2-b*c,b*d}

                2
o3 = set {b*d, a  - b*c}

o3 : Set

i4 : toList B

            2
o4 = {b*d, a  - b*c}

o4 : List

i5 : member(1,A)

o5 = true

i6 : member(-b*c+a^2,B)

o6 = true

i7 : A ** A

o7 = set {(1, 1), (1, 2), (2, 1), (2, 2)}

o7 : Set

i8 : A^**2

o8 = set {(1, 1), (1, 2), (2, 1), (2, 2)}

o8 : Set

i9 : set{1,3,2} - set{1}

o9 = set {2, 3}

o9 : Set

i10 : set{4,5} + set{5,6}

o10 = set {4, 5, 6}

o10 : Set

i11 : set{4,5} * set{5,6}

o11 = set {5}

o11 : Set

i12 : set{1,3,2} === set{1,2,3}

o12 = true

i13 : I = ideal(a,b); J = ideal(b,a);

o13 : Ideal of R

o14 : Ideal of R

i15 : I == J

o15 = true

i16 : I === J

o16 = false

i17 : C = set(ideal(a,b),ideal(b,a))

o17 = set {ideal (b, a), ideal (a, b)}

o17 : Set

i18 : C1 = set(trim ideal(a,b),trim ideal(b,a))

o18 = set {ideal (b, a)}

o18 : Set

i19 : 
