-- -*- M2-comint -*-

i1 : S = ZZ/10007[x,y];

i2 : G = gb ideal(x^3+y^3, x*y^4);

i3 : gens G

o3 = | x3+y3 xy4 y7 |

             1       3
o3 : Matrix S  <--- S

i4 : betti G

            0 1
o4 = total: 1 3
         0: 1 .
         1: . .
         2: . 1
         3: . .
         4: . 1
         5: . .
         6: . 1

o4 : BettiTally

i5 : 
