
i1 : S = ZZ/10007[x,y];

i2 : I = ideal(x^2,y^3);

o2 : Ideal of S

i3 : betti I

o3 = generators: total: 1 2
                     0: 1 .
                     1: . 1
                     2: . 1

i4 : 
