-- -*- M2-comint -*-

i1 : R = ZZ/10007[x,y];

i2 : char R

o2 = 10007

i3 : R = ZZ[x]/823671827384723894723894723892

o3 = R

o3 : QuotientRing

i4 : char R

o4 = 823671827384723894723894723892

i5 : 
