-- -*- M2-comint -*-
with packages: Classic, Elimination, LLLBases, PrimaryDecomposition, SchurRings

i1 : run "uname -a"
Linux rhodium 2.6.16 #3 SMP PREEMPT Mon Jun 12 11:56:50 CDT 2006 i686 unknown unknown GNU/Linux

o1 = 0

i2 : "!grep a" << " ba \n bc \n ad \n ef \n" << close
 ba 
 ad 

o2 = !grep a

o2 : File

i3 : peek get "!uname -a"

o3 = "Linux rhodium 2.6.16 #3 SMP PREEMPT Mon Jun 12 11:56:50 CDT 2006 i686
     unknown unknown GNU/Linux\n"

i4 : f = openInOut "!egrep '^in'"

o4 = !egrep '^in'

o4 : File

i5 : scan(keys Core.Dictionary, key -> f << key << endl)

i6 : f << closeOut

o6 = !egrep '^in'

o6 : File

i7 : get f

o7 = interpreterDepth
     infoHelp
     integrate
     inducedMap
     installPackage
     installMethod
     integralClosure
     instance
     info
     intersect
     input
     index
     indexComponents
     installAssignmentMethod
     infinity
     inducesWellDefinedMap
     inverse
     indices
     incomparable
     indeterminate
     in
     independentSets


i8 : f = openIn "!sleep 5; echo -n the answer is 4"

o8 = !sleep 5; echo -n the answer is 4

o8 : File

i9 : isReady f

o9 = false

i10 : while not isReady f do (sleep 1; << "." << flush)
.....
i11 : read f

o11 = the answer is 4

i12 : isReady f

o12 = true

i13 : atEndOfFile f

o13 = true

i14 : close f

o14 = !sleep 5; echo -n the answer is 4

o14 : File

i15 : 
