-- -*- M2-comint -*-

i1 : R = QQ[x,y,z]/ideal(x^6-z^6-y^2*z^4);

i2 : F = ICmap R

         QQ [w , w , x, y, z, MonomialOrder => GRevLex => 5]
              7   6
o2 = map(---------------------------------------------------,R,{x, y, z})
              2                    2         2    2    2
            (x  - w z, w x - w z, w  - w x, w  - y  - z )
                   6    6     7    6    7    7

             QQ [w , w , x, y, z, MonomialOrder => GRevLex => 5]
                  7   6
o2 : RingMap --------------------------------------------------- <--- R
                  2                    2         2    2    2
                (x  - w z, w x - w z, w  - w x, w  - y  - z )
                       6    6     7    6    7    7

i3 : conductor F

             3     2   3    4
o3 = ideal (z , x*z , x z, x )

o3 : Ideal of R

i4 : 
