-- -*- M2-comint -*-

i1 : R = ZZ/5[x,y,z];

i2 : F = R^3

      3
o2 = R

o2 : R-module, free

i3 : F_{0,1,2}

o3 = | 1 0 0 |
     | 0 1 0 |
     | 0 0 1 |

             3       3
o3 : Matrix R  <--- R

i4 : F_{0,1}

o4 = | 1 0 |
     | 0 1 |
     | 0 0 |

             3       2
o4 : Matrix R  <--- R

i5 : F_{1,2}

o5 = | 0 0 |
     | 1 0 |
     | 0 1 |

             3       2
o5 : Matrix R  <--- R

i6 : f = matrix{{x,y,z}}

o6 = | x y z |

             1       3
o6 : Matrix R  <--- R

i7 : 
