-- -*- M2-comint -*-

i1 : R = QQ[a..d];

i2 : I = ideal (a^2*b-c^2, a*b^2-d^3, c^5-d)

             2     2     2    3   5
o2 = ideal (a b - c , a*b  - d , c  - d)

o2 : Ideal of R

i3 : J = monomialIdeal (a^2*b, b*c*d, c^5)

                     2    5
o3 = monomialIdeal (a b, c , b*c*d)

o3 : MonomialIdeal of R

i4 : monomialCurveIdeal(R,{1,2,3})

             2                    2
o4 = ideal (c  - b*d, b*c - a*d, b  - a*c)

o4 : Ideal of R

i5 : 
