--package "Macaulay2Core" loaded
--package "PrimaryDecomposition" loaded
--loading the Macaulay2 documentation
--package "Macaulay2" loaded

i1 : R = ZZ/101[x,y,z];

i2 : M = R^4

      4
o2 = R

o2 : R-module, free

i3 : degrees M

o3 = {{0}, {0}, {0}, {0}}

o3 : List

i4 : F = R^{1,4:2,3,3:4}

      9
o4 = R

o4 : R-module, free, degrees {-1, -2, -2, -2, -2, -3, -4, -4, -4}

i5 : degrees F

o5 = {{-1}, {-2}, {-2}, {-2}, {-2}, {-3}, {-4}, {-4}, {-4}}

o5 : List

i6 : S = ZZ[a,b,c, Degrees=>{{1,2},{2,0},{3,3}}]

o6 = S

o6 : PolynomialRing

i7 : N = S ^ {{-1,-1},{-4,4},{0,0}}

      3
o7 = S

o7 : S-module, free, degrees {{1, 1}, {4, -4}, {0, 0}}

i8 : degree N_0

o8 = {1, 1}

o8 : List

i9 : degree (a*b*N_1)

o9 = {7, -2}

o9 : List

i10 : 
