-- -*- M2-comint -*-

i1 : R = ZZ/101[a..e];

i2 : M = matrix{{a^2*b-c^2, a*b^2-d^3, c^5-d},{a^2*b, b*c*d, c^5}}

o2 = | a2b-c2 ab2-d3 c5-d |
     | a2b    bcd    c5   |

             2       3
o2 : Matrix R  <--- R

i3 : ideal M

             2     2   2      2    3          5       5
o3 = ideal (a b - c , a b, a*b  - d , b*c*d, c  - d, c )

o3 : Ideal of R

i4 : I = ideal(a^2*b-c^2+c*d, a*b^2-b*d^3, c^5,d+e);

o4 : Ideal of R

i5 : generators I

o5 = | a2b-c2+cd -bd3+ab2 c5 d+e |

             1       4
o5 : Matrix R  <--- R

i6 : 
