-- -*- M2-comint -*-

i1 : isField QQ

o1 = true

i2 : isField CC

o2 = true

i3 : isField GF(2,3)

o3 = true

i4 : isField(frac(QQ[x,y]))

o4 = true

i5 : R = QQ[x]/(x^2+1)

o5 = R

o5 : QuotientRing

i6 : isUnit x

o6 = true

i7 : isField R

o7 = false

i8 : F = toField R

o8 = R

o8 : QuotientRing

i9 : isField F

o9 = true

i10 : 
