-- -*- M2-comint -*-

i1 : R = QQ[a..f];

i2 : F = matrix{{a,b,d,e},{b,c,e,f}}

o2 = | a b d e |
     | b c e f |

             2       4
o2 : Matrix R  <--- R

i3 : M = ker F

o3 = image {1} | cd-be  0      e2-df  ce-bf  |
           {1} | -bd+ae e2-df  0      -be+af |
           {1} | b2-ac  -ce+bf -be+af 0      |
           {1} | 0      cd-be  bd-ae  b2-ac  |

                             4
o3 : R-module, submodule of R

i4 : coker F

o4 = cokernel | a b d e |
              | b c e f |

                            2
o4 : R-module, quotient of R

i5 : image F

o5 = image | a b d e |
           | b c e f |

                             2
o5 : R-module, submodule of R

i6 : generators M

o6 = {1} | cd-be  0      e2-df  ce-bf  |
     {1} | -bd+ae e2-df  0      -be+af |
     {1} | b2-ac  -ce+bf -be+af 0      |
     {1} | 0      cd-be  bd-ae  b2-ac  |

             4       4
o6 : Matrix R  <--- R

i7 : relations M

o7 = 0

             4
o7 : Matrix R  <--- 0

i8 : presentation M

o8 = {3} | -f -e |
     {3} | b  a  |
     {3} | -c -b |
     {3} | e  d  |

             4       2
o8 : Matrix R  <--- R

i9 : 
