-- -*- M2-comint -*-

i1 : R = ZZ/101[x,y,z]

o1 = R

o1 : PolynomialRing

i2 : p = matrix {{x,y,z}}

o2 = | x y z |

             1       3
o2 : Matrix R  <--- R

i3 : degrees source p

o3 = {{1}, {1}, {1}}

o3 : List

i4 : isHomogeneous p

o4 = true

i5 : q = vars R

o5 = | x y z |

             1       3
o5 : Matrix R  <--- R

i6 : matrix {{q,q,q}}

o6 = | x y z x y z x y z |

             1       9
o6 : Matrix R  <--- R

i7 : matrix {{q},{q},{q}}

o7 = | x y z |
     | x y z |
     | x y z |

             3       3
o7 : Matrix R  <--- R

i8 : F = R^3

      3
o8 = R

o8 : R-module, free

i9 : matrix {F_2, F_1, x*F_0 + y*F_1 + z*F_2}

o9 = | 0 0 x |
     | 0 1 y |
     | 1 0 z |

             3       3
o9 : Matrix R  <--- R

i10 : 
