-- -*- M2-comint -*-

i1 : f = method(Associative => true)

o1 = f

o1 : Function

i2 : f(String,String) := (i,j) -> "(" | i | ")," | j;

i3 : f("a","b","c","d")

o3 = (((a),b),c),d

i4 : 
