-- -*- M2-comint -*-

i1 : R = QQ[x,y]/(y^2-x^3);

i2 : M = module ideal(x,y)

o2 = image | x y |

                             1
o2 : R-module, submodule of R

i3 : F = map(R^1,M,matrix{{y,x^2}})

o3 = | y x2 |

o3 : Matrix

i4 : source F

o4 = image | x y |

                             1
o4 : R-module, submodule of R

i5 : target F == R^1

o5 = true

i6 : matrix F

o6 = | y x2 |

             1       2
o6 : Matrix R  <--- R

i7 : isWellDefined F

o7 = true

i8 : isIsomorphism F

o8 = false

i9 : inc = inducedMap(R^1, M)

o9 = | x y |

o9 : Matrix

i10 : G = F // inc

o10 = {1} | 0 x |
      {1} | 1 0 |

o10 : Matrix

i11 : target G == M and source G == M

o11 = true

i12 : inc * G == F

o12 = true

i13 : isWellDefined G

o13 = true

i14 : isIsomorphism G

o14 = false

i15 : prune coker G

o15 = cokernel | y x |

                             1
o15 : R-module, quotient of R

i16 : kernel G == 0

o16 = true

i17 : 
