-- -*- M2-comint -*-

i1 : x = {2,3,,4}

o1 = {2, 3, , 4}

o1 : List

i2 : net x

o2 = {2, 3, , 4}

i3 : toString x#2

o3 = null

i4 : peek x

o4 = {2, 3, null, 4}

i5 : 
