-- -*- M2-comint -*-

i1 : R = QQ[a..d];

i2 : I = ideal(a^2-b*d, a^2-b*d, c^2, d^2);

o2 : Ideal of R

i3 : numgens I

o3 = 4

i4 : mingens I

o4 = | d2 c2 a2-bd |

             1       3
o4 : Matrix R  <--- R

i5 : numgens trim I

o5 = 3

i6 : 
