-- -*- M2-comint -*-

i1 : R = ZZ/32003[a..d,x_1..x_4,y_(1,1)..y_(2,2)];

i2 : poly"a2b-3ab-1"

      2
o2 = a b - 3a*b - 1

o2 : R

i3 : poly"a2y[1,1]3-3ab-1"

      2 3
o3 = a y    - 3a*b - 1
        1,1

o3 : R

i4 : poly"(a+b)(a+2c)"

      2
o4 = a  + a*b + 2a*c + 2b*c

o4 : R

i5 : poly"(a+b+c)3-1"

      3     2        2    3     2               2        2       2    3
o5 = a  + 3a b + 3a*b  + b  + 3a c + 6a*b*c + 3b c + 3a*c  + 3b*c  + c  - 1

o5 : R

i6 : poly"3/4a2b-3ab-1"

            2
o6 = - 8000a b - 3a*b - 1

o6 : R

i7 : poly"a5+5a4b+10a3b2+10a2b3+5ab4+b5
     -10a4c-40a3bc-60a2b2c-40ab3c-10b4c
     +40a3c2+120a2bc2+120ab2c2+40b3c2
     -80a2c3-160abc3-80b2c3+80ac4+80bc4-32c5"

      5     4       3 2      2 3       4    5      4       3         2 2   
o7 = a  + 5a b + 10a b  + 10a b  + 5a*b  + b  - 10a c - 40a b*c - 60a b c -
     ---------------------------------------------------------------------------
          3       4       3 2       2   2         2 2      3 2      2 3  
     40a*b c - 10b c + 40a c  + 120a b*c  + 120a*b c  + 40b c  - 80a c  -
     ---------------------------------------------------------------------------
             3      2 3        4        4      5
     160a*b*c  - 80b c  + 80a*c  + 80b*c  - 32c

o7 : R

i8 : poly"(a+(c+y[1,1])2)2-1"

      4     3         2 2         3      4         2                   2      2
o8 = c  + 4c y    + 6c y    + 4c*y    + y    + 2a*c  + 4a*c*y    + 2a*y    + a 
              1,1       1,1       1,1    1,1                 1,1       1,1
     ---------------------------------------------------------------------------
     - 1

o8 : R

i9 : 
