-- -*- M2-comint -*-

i1 : R = ZZ/101[a..d];

i2 : S = ZZ/101[s,t];

i3 : f = map(S,R,matrix{{s^4, s^3*t, s*t^3, t^4}})

               4   3      3   4
o3 = map(S,R,{s , s t, s*t , t })

o3 : RingMap S <--- R

i4 : pushForward1(f,S^1)

o4 = | bc-ad c3-bd2 ac2-b2d b3-a2c |

             1       4
o4 : Matrix R  <--- R

i5 : pushForward1(f,S^1,MonomialOrder=>ProductOrder)

o5 = | bc-ad c3-bd2 ac2-b2d b3-a2c |

             1       4
o5 : Matrix R  <--- R

i6 : f = map(S,R,matrix{{s^4, s^3*t, s*t^3, t^4}})

               4   3      3   4
o6 = map(S,R,{s , s t, s*t , t })

o6 : RingMap S <--- R

i7 : pushForward1(f,S^1,DegreeLimit=>4)

o7 = 0

             1
o7 : Matrix R  <--- 0

i8 : pushForward1(f,S^1,PairLimit=>0)

o8 = | bc-ad c3-bd2 ac2-b2d b3-a2c |

             1       4
o8 : Matrix R  <--- R

i9 : 
