-- -*- M2-comint -*-

i1 : S=ZZ/101[a,b]

o1 = S

o1 : PolynomialRing

i2 : i=ideal(a^4,b^4)

             4   4
o2 = ideal (a , b )

o2 : Ideal of S

i3 : quotient(i, a^3+b^3)

                  3    3
o3 = ideal (a*b, a  - b )

o3 : Ideal of S

i4 : quotient(i, a^3+b^3, MinimalGenerators=>false)

                  3    3
o4 = ideal (a*b, a  - b )

o4 : Ideal of S

i5 : 
