-- -*- M2-comint -*-

i1 : R=ZZ/32003[a..d];

i2 : I=intersect(ideal(a*b+a^2,b^2),ideal(a^2,b^2,c^2),ideal(b^3,c^3,d^3))

             3   2 3   2 3   2 3        3   2   3   3 3   2 2 3        2 3
o2 = ideal (b , b d , b c , a c  + a*b*c , a b*d , a d , a c d  + a*b*c d )

o2 : Ideal of R

i3 : removeLowestDimension I

             2   2
o3 = ideal (b , a  + a*b)

o3 : Ideal of R

i4 : 
