-- -*- M2-comint -*-

i1 : R = ZZ/101[a .. o];

i2 : f = genericMatrix(R, a, 3, 5)

o2 = | a d g j m |
     | b e h k n |
     | c f i l o |

             3       5
o2 : Matrix R  <--- R

i3 : submatrix(f, {1,2,0}, {0..2, 4})

o3 = | b e h n |
     | c f i o |
     | a d g m |

             3       4
o3 : Matrix R  <--- R

i4 : submatrix(f, {1,2}, )

o4 = | b e h k n |
     | c f i l o |

             2       5
o4 : Matrix R  <--- R

i5 : submatrix(f,,{0,1})

o5 = | a d |
     | b e |
     | c f |

             3       2
o5 : Matrix R  <--- R

i6 : f_{0,1}

o6 = | a d |
     | b e |
     | c f |

             3       2
o6 : Matrix R  <--- R

i7 : 
