-- -*- M2-comint -*-

i1 : R = ZZ/101[a .. o];

i2 : f = genericMatrix(R, a, 3, 5)

o2 = | a d g j m |
     | b e h k n |
     | c f i l o |

             3       5
o2 : Matrix R  <--- R

i3 : submatrix(f, {1..3,0})

o3 = | d g j a |
     | e h k b |
     | f i l c |

             3       4
o3 : Matrix R  <--- R

i4 : 
