-- -*- M2-comint -*-

i1 : R = QQ[a..d];

i2 : terms(a+d^2-1+a*b*c)

              2
o2 = {a*b*c, d , a, -1}

o2 : List

i3 : S = R[x,y];

i4 : terms(a*x+b*x+c*x*y+c*x^3+1+a)

         3
o4 = {c*x , c*x*y, (a + b)x, a + 1}

o4 : List

i5 : 
