-- -*- M2-comint -*-

i1 : R=ZZ/32003[a..c];

i2 : I=intersect(ideal(a,b),ideal(b,c),ideal(c,a),ideal(a^2,b^3,c^4));

o2 : Ideal of R

i3 : topComponents I

o3 = ideal (b*c, a*c, a*b)

o3 : Ideal of R

i4 : 
