-- -*- M2-comint -*-

i1 : R = ZZ/101[x,y,z,w];

i2 : gb ideal(x*y-z^2,y^2-w^2)

o2 = GroebnerBasis[status: done; S-pairs encountered up to degree 4]

o2 : GroebnerBasis

i3 : gens oo

o3 = | y2-w2 xy-z2 yz2-xw2 z4-x2w2 |

             1       4
o3 : Matrix R  <--- R

i4 : options gb

o4 = OptionTable{Algorithm => Inhomogeneous        }
                 BasisElementLimit => infinity
                 ChangeMatrix => false
                 CodimensionLimit => infinity
                 DegreeLimit => {}
                 GBDegrees => 
                 HardDegreeLimit => 
                 Hilbert => 
                 PairLimit => infinity
                 StopBeforeComputation => false
                 StopWithMinimalGenerators => false
                 Strategy => {}
                 SubringLimit => infinity
                 Syzygies => false
                 SyzygyLimit => infinity
                 SyzygyRows => infinity

o4 : OptionTable

i5 : gb(ideal(x*y-z^2,y^2-w^2), DegreeLimit => 2)

o5 = GroebnerBasis[status: DegreeLimit; all S-pairs handled up to degree 2]

o5 : GroebnerBasis

i6 : gens oo

o6 = | y2-w2 xy-z2 |

             1       2
o6 : Matrix R  <--- R

i7 : (options gb).Syzygies

o7 = false

i8 : 
