-- -*- M2-comint -*- {* hash: -1173633975 *}

i1 : R = ZZ[x..z]

o1 = R

o1 : PolynomialRing

i2 : C = chainComplex R

o2 = 0

o2 : ChainComplex

i3 : C.dd

o3 = 0

o3 : ChainComplexMap

i4 : C.dd_1 = vars R

o4 = | x y z |

             1       3
o4 : Matrix R  <--- R

i5 : C.dd_3 = transpose vars R

o5 = {-1} | x |
     {-1} | y |
     {-1} | z |

             3       1
o5 : Matrix R  <--- R

i6 : C.dd

          1                 3
o6 = 0 : R  <------------- R  : 1
               | x y z |

          3         3
     1 : R  <----- R  : 2
               0

          3                  1
     2 : R  <-------------- R  : 3
               {-1} | x |
               {-1} | y |
               {-1} | z |

o6 : ChainComplexMap

i7 : C

      1      3      3      1
o7 = R  <-- R  <-- R  <-- R
                           
     0      1      2      3

o7 : ChainComplex

i8 : HH C

o8 = 0 : cokernel | x y z |    

     1 : image {1} | -y 0  -z |
               {1} | x  -z 0  |
               {1} | 0  y  x  |

     2 : cokernel {-1} | x |
                  {-1} | y |
                  {-1} | z |   

     3 : image 0               

o8 : GradedModule

i9 : prune HH C

o9 = 0 : cokernel | z y x |

     1 : cokernel | z  |
                  | x  |
                  | -y |   

     2 : cokernel | x |
                  | y |
                  | z |    

     3 : 0                 

o9 : GradedModule

i10 : 
0.78user 0.04system 0:00.82elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10829minor)pagefaults 0swaps
