-- -*- M2-comint -*-

i1 : R = QQ[a..i, MonomialOrder => Eliminate 3];

i2 : I = ideal(a^2, b-f, d^4, i - b);

o2 : Ideal of R

i3 : selectInSubring(1, gens gb I)

o3 = | f-i d4 |

             1       2
o3 : Matrix R  <--- R

i4 : R = QQ[a..i, MonomialOrder => {Eliminate 3,4,2}];

i5 : d^3 - a*e^4 + b^2*i + a*c*d*f +a*c^2*g + a*c*g

        2               2               4    3
o5 = a*c g + a*c*d*f + b i + a*c*g - a*e  + d

o5 : R

i6 : I = ideal(a..i)

o6 = ideal (a, b, c, d, e, f, g, h, i)

o6 : Ideal of R

i7 : selectInSubring(1, gens gb I);

             1       6
o7 : Matrix R  <--- R

i8 : selectInSubring(2, gens gb I);

             1       5
o8 : Matrix R  <--- R

i9 : selectInSubring(3, gens gb I);

             1       3
o9 : Matrix R  <--- R

i10 : 
