-- -*- M2-comint -*- {* hash: -1339086305 *}

i1 : R = ZZ/7[x]/(x^46-x-1);

i2 : (x+4)^(7^100)

        45    43    42     41     38     37     36     35    34     33     32
o2 = - x   - x   - x   + 3x   + 3x   - 2x   + 2x   + 3x   + x   - 3x   + 3x  
     ------------------------------------------------------------------------
         31     30    29    28    27     26     25    23     22    21     20
     - 2x   + 2x   + x   - x   + x   - 3x   + 2x   + x   + 3x   - x   - 2x  
     ------------------------------------------------------------------------
         19    18     17     16     15     14    13     12     11    10     9
     - 2x   - x   + 3x   - 3x   - 3x   + 2x   + x   + 2x   - 3x   - x   - 3x 
     ------------------------------------------------------------------------
         8     7     6     5    4     2
     - 2x  + 3x  - 2x  + 3x  - x  + 2x  - 3x + 3

o2 : R

i3 : S = ZZ[t,Inverses=>true,MonomialOrder=>RevLex];

i4 : t^-1

      -1
o4 = t

o4 : S

i5 : T = frac(ZZ[a,b,c]);

i6 : (a+b+c)^-1

         1
o6 = ---------
     a + b + c

o6 : T

i7 : 
1.12user 0.06system 0:01.18elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+12961minor)pagefaults 0swaps
