-- -*- M2-comint -*-

i1 : S = QQ[a,b,c];

i2 : R = QQ[x,y,z];

i3 : phi = map(R,S,{x,y,x^2-y^3})

                       3    2
o3 = map(R,S,{x, y, - y  + x })

o3 : RingMap R <--- S

i4 : isInjective phi

o4 = false

i5 : ker phi

            3    2
o5 = ideal(b  - a  + c)

o5 : Ideal of S

i6 : psi = map(R,S,{x,x+y,z-x^2+y^3})

                         3    2
o6 = map(R,S,{x, x + y, y  - x  + z})

o6 : RingMap R <--- S

i7 : isInjective psi

o7 = true

i8 : ker psi

o8 = 0

o8 : Ideal of S

i9 : 
