-- -*- M2-comint -*- {* hash: 1367216088 *}

i1 : 3 ? 4

o1 = <

o1 : Keyword

i2 : "book" ? "boolean"

o2 = <

o2 : Keyword

i3 : 3 ? 3.

o3 = ==

o3 : Keyword

i4 : {1,2,3} ? {4,5}

o4 = <

o4 : Keyword

i5 : R = ZZ[a,b,c]

o5 = R

o5 : PolynomialRing

i6 : a*c ? b^2

o6 = <

o6 : Keyword

i7 : set {1,2} ? set {2,3}

o7 = incomparable

o7 : Symbol

i8 : set {1,2} ? set {1,2,3}

o8 = <

o8 : Keyword

i9 : tally {1,1,2} ? tally {1,2,3}

o9 = incomparable

o9 : Symbol

i10 : tally {1,1,2} ? tally {1,1,2,3}

o10 = <

o10 : Keyword

i11 : 
0.79user 0.04system 0:00.82elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10844minor)pagefaults 0swaps
