-- -*- M2-comint -*-

i1 : A = ZZ[a..d];

i2 : B = A/(3*a^2-1);

i3 : C = B/(a*b-3);

i4 : describe C

     ZZ [a, b, c, d]
     ---------------
           2
         3a  - 1
o4 = ---------------
         a*b - 3

i5 : ambient C

o5 = B

o5 : QuotientRing

i6 : 
