-- -*- M2-comint -*- {* hash: -2041497473 *}

i1 : R = QQ[x_1 .. x_5]

o1 = R

o1 : PolynomialRing

i2 : N = image matrix{{x_1,x_2},{x_2,x_3}}

o2 = image | x_1 x_2 |
           | x_2 x_3 |

                             2
o2 : R-module, submodule of R

i3 : ambient N

      2
o3 = R

o3 : R-module, free

i4 : ambient cokernel vars R

      1
o4 = R

o4 : R-module, free

i5 : ambient kernel vars R

      5
o5 = R

o5 : R-module, free, degrees {1, 1, 1, 1, 1}

i6 : M = image vars R ++ cokernel vars R

o6 = subquotient (| x_1 x_2 x_3 x_4 x_5 0 |, | 0   0   0   0   0   |)
                  | 0   0   0   0   0   1 |  | x_1 x_2 x_3 x_4 x_5 |

                               2
o6 : R-module, subquotient of R

i7 : ambient M

      2
o7 = R

o7 : R-module, free

i8 : ambient M == target generators M

o8 = true

i9 : ambient M == target relations M

o9 = true

i10 : 
0.79user 0.07system 0:00.88elapsed 98%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10847minor)pagefaults 0swaps
