-- -*- M2-comint -*- {* hash: -1811599084 *}

i1 : x = "abcde"

o1 = abcde

i2 : x

o2 = abcde

i3 : y

o3 = y

o3 : Symbol

i4 : y = z

o4 = z

o4 : Symbol

i5 : y

o5 = z

o5 : Symbol

i6 : z = 444

o6 = 444

i7 : z

o7 = 444

i8 : y

o8 = z

o8 : Symbol

i9 : value y

o9 = 444

i10 : y <- 555

o10 = 555

i11 : y

o11 = z

o11 : Symbol

i12 : z

o12 = 555

i13 : y = 666

o13 = 666

i14 : y

o14 = 666

i15 : z

o15 = 555

i16 : 
0.76user 0.08system 0:00.85elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10844minor)pagefaults 0swaps
