-- -*- M2-comint -*- {* hash: -623877768 *}

i1 : S = QQ[x,y,z]/ideal(x^3+y^3+z^3);

i2 : T = QQ[u,v,w]/ideal(u^3+v^3+w^3);

i3 : G = map(T,S,matrix{{u,v,w^2}})

                     2
o3 = map(T,S,{u, v, w })

o3 : RingMap T <--- S

i4 : G(x^3+y^3+z)

        6    2
o4 = - w  + w

o4 : T

i5 : R = QQ[x,y,w];

i6 : F = map(S,R)

o6 = map(S,R,{x, y, 0})

o6 : RingMap S <--- R

i7 : F(x^3)

        3    3
o7 = - y  - z

o7 : S

i8 : U = QQ[s,t,u, Degrees => {{1,2},{1,1},{1,3}}];

i9 : H = map(U,R,matrix{{s^2,t^3,u^4}})

               2   3   4
o9 = map(U,R,{s , t , u })

o9 : RingMap U <--- R

i10 : use R; H(x^2+y^2+w^2)

       8    6    4
o11 = u  + t  + s

o11 : U

i12 : source H

o12 = R

o12 : PolynomialRing

i13 : target H

o13 = U

o13 : PolynomialRing

i14 : H.matrix

o14 = | s2 t3 u4 |

              1       3
o14 : Matrix U  <--- U

i15 : source H.matrix

       3
o15 = U

o15 : U-module, free

i16 : target H.matrix

       1
o16 = U

o16 : U-module, free

i17 : 
0.79user 0.02system 0:00.81elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10850minor)pagefaults 0swaps
