-- -*- M2-comint -*-

i1 : R = ZZ/101[x_0..x_3];

i2 : M = matrix{{x_0,x_1,x_2},{x_1,x_2,x_3}}

o2 = | x_0 x_1 x_2 |
     | x_1 x_2 x_3 |

             2       3
o2 : Matrix R  <--- R

i3 : V = Proj(R/minors(2,M));

i4 : codim V

o4 = 2

i5 : 
