-- -*- M2-comint -*- {* hash: -482070056 *}

i1 : R = ZZ/101[x,y,z]

o1 = R

o1 : PolynomialRing

i2 : m = image vars R

o2 = image | x y z |

                             1
o2 : R-module, submodule of R

i3 : m2 = image symmetricPower(2,vars R)

o3 = image | x2 xy xz y2 yz z2 |

                             1
o3 : R-module, submodule of R

i4 : M = R^1/m2

o4 = cokernel | x2 xy xz y2 yz z2 |

                            1
o4 : R-module, quotient of R

i5 : N = R^1/m

o5 = cokernel | x y z |

                            1
o5 : R-module, quotient of R

i6 : C = cone extend(resolution N,resolution M,id_(R^1))

      1      4      9      9      3
o6 = R  <-- R  <-- R  <-- R  <-- R  <-- 0
                                         
     0      1      2      3      4      5

o6 : ChainComplex

i7 : prune HH_0 C

o7 = 0

o7 : R-module

i8 : prune HH_1 C

o8 = cokernel {1} | z y x 0 0 0 0 0 0 |
              {1} | 0 0 0 z y x 0 0 0 |
              {1} | 0 0 0 0 0 0 z y x |

                            3
o8 : R-module, quotient of R

i9 : prune (m/m2)

o9 = cokernel {1} | z y x 0 0 0 0 0 0 |
              {1} | 0 0 0 z y x 0 0 0 |
              {1} | 0 0 0 0 0 0 z y x |

                            3
o9 : R-module, quotient of R

i10 : 
0.80user 0.08system 0:00.90elapsed 97%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10844minor)pagefaults 0swaps
