-- -*- M2-comint -*-

i1 : S = QQ[a..f];

i2 : I = ideal(a^195, b^195, c^195, d^195, e^195);

o2 : Ideal of S

i3 : degree I

o3 = 281950621875

i4 : degree(S^1/I)

o4 = 281950621875

i5 : I = intersect(ideal(a-1,b-1,c-1),ideal(a-2,b-1,c+1),ideal(a-4,b+7,c-3/4));

o5 : Ideal of S

i6 : degree I

o6 = 3

i7 : 
