-- -*- M2-comint -*- {* hash: -566455404 *}

i1 : F = directSum(a=>ZZ^1, b=>ZZ^2, c=>ZZ^3)

       6
o1 = ZZ

o1 : ZZ-module, free

i2 : F_[b]

o2 = | 0 0 |
     | 1 0 |
     | 0 1 |
     | 0 0 |
     | 0 0 |
     | 0 0 |

              6        2
o2 : Matrix ZZ  <--- ZZ

i3 : F^[c]

o3 = | 0 0 0 1 0 0 |
     | 0 0 0 0 1 0 |
     | 0 0 0 0 0 1 |

              3        6
o3 : Matrix ZZ  <--- ZZ

i4 : F = (a => ZZ^1) ++ (b => ZZ^2)

       3
o4 = ZZ

o4 : ZZ-module, free

i5 : F_[b]

o5 = | 0 0 |
     | 1 0 |
     | 0 1 |

              3        2
o5 : Matrix ZZ  <--- ZZ

i6 : 
0.76user 0.05system 0:00.82elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10841minor)pagefaults 0swaps
