-- -*- M2-comint -*-

i1 : R = QQ[x,y];

i2 : F = R^{1,2,3}

      3
o2 = R

o2 : R-module, free, degrees {-1, -2, -3}

i3 : G = R^{10,20,30}

      3
o3 = R

o3 : R-module, free, degrees {-10, -20, -30}

i4 : f = flip(F,G)

o4 = {-11} | 1 0 0 0 0 0 0 0 0 |
     {-12} | 0 0 0 1 0 0 0 0 0 |
     {-13} | 0 0 0 0 0 0 1 0 0 |
     {-21} | 0 1 0 0 0 0 0 0 0 |
     {-22} | 0 0 0 0 1 0 0 0 0 |
     {-23} | 0 0 0 0 0 0 0 1 0 |
     {-31} | 0 0 1 0 0 0 0 0 0 |
     {-32} | 0 0 0 0 0 1 0 0 0 |
     {-33} | 0 0 0 0 0 0 0 0 1 |

             9       9
o4 : Matrix R  <--- R

i5 : isHomogeneous f

o5 = true

i6 : target f

      9
o6 = R

o6 : R-module, free, degrees {-11, -12, -13, -21, -22, -23, -31, -32, -33}

i7 : source f

      9
o7 = R

o7 : R-module, free, degrees {-11, -21, -31, -12, -22, -32, -13, -23, -33}

i8 : target f === G**F

o8 = true

i9 : source f === F**G

o9 = true

i10 : u = x * F_0

o10 = {-1} | x |
      {-2} | 0 |
      {-3} | 0 |

       3
o10 : R

i11 : v = y * G_1

o11 = {-10} | 0 |
      {-20} | y |
      {-30} | 0 |

       3
o11 : R

i12 : u ** v

o12 = {-11} | 0  |
      {-21} | xy |
      {-31} | 0  |
      {-12} | 0  |
      {-22} | 0  |
      {-32} | 0  |
      {-13} | 0  |
      {-23} | 0  |
      {-33} | 0  |

       9
o12 : R

i13 : v ** u

o13 = {-11} | 0  |
      {-12} | 0  |
      {-13} | 0  |
      {-21} | xy |
      {-22} | 0  |
      {-23} | 0  |
      {-31} | 0  |
      {-32} | 0  |
      {-33} | 0  |

       9
o13 : R

i14 : f * (u ** v)

o14 = {-11} | 0  |
      {-12} | 0  |
      {-13} | 0  |
      {-21} | xy |
      {-22} | 0  |
      {-23} | 0  |
      {-31} | 0  |
      {-32} | 0  |
      {-33} | 0  |

       9
o14 : R

i15 : f * (u ** v) === v ** u

o15 = true

i16 : 
