-- -*- M2-comint -*- {* hash: -885203914 *}

i1 : R = ZZ/101[x,y,z];

i2 : M = R^4

      4
o2 = R

o2 : R-module, free

i3 : m = matrix{{x,y,z},{y,z,0}}

o3 = | x y z |
     | y z 0 |

             2       3
o3 : Matrix R  <--- R

i4 : target m == R^2

o4 = true

i5 : degrees M

o5 = {{0}, {0}, {0}, {0}}

o5 : List

i6 : F = R^{1,4:2,3,3:4}

      9
o6 = R

o6 : R-module, free, degrees {-1, -2, -2, -2, -2, -3, -4, -4, -4}

i7 : degrees F

o7 = {{-1}, {-2}, {-2}, {-2}, {-2}, {-3}, {-4}, {-4}, {-4}}

o7 : List

i8 : S = ZZ[a,b,c, Degrees=>{{1,2},{2,0},{3,3}}]

o8 = S

o8 : PolynomialRing

i9 : N = S ^ {{-1,-1},{-4,4},{0,0}}

      3
o9 = S

o9 : S-module, free, degrees {{1, 1}, {4, -4}, {0, 0}}

i10 : degree N_0

o10 = {1, 1}

o10 : List

i11 : degree (a*b*N_1)

o11 = {7, -2}

o11 : List

i12 : 
0.78user 0.07system 0:00.85elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10852minor)pagefaults 0swaps
