-- -*- M2-comint -*- {* hash: 2029953842 *}

i1 : X = new Type of MutableHashTable

o1 = X

o1 : Type

i2 : x = new X

o2 = X{}

o2 : X

i3 : X.GlobalAssignHook = globalAssignFunction

o3 = globalAssignFunction

o3 : FunctionClosure

i4 : X.GlobalReleaseHook = globalReleaseFunction

o4 = globalReleaseFunction

o4 : FunctionClosure

i5 : x' = new X

o5 = x'

o5 : X

i6 : t = {x,x'}

o6 = {X{}, x'}

o6 : List

i7 : x = x' = 44

o7 = 44

i8 : t

o8 = {X{}, X{}}

o8 : List

i9 : code globalAssignFunction

o9 = -- startup.m2:189-192
          globalAssignFunction = (X,x) -> (
               if not hasAttribute(x,ReverseDictionary) then setAttribute(x,ReverseDictionary,X);
               use x;
               );

i10 : 
0.77user 0.05system 0:00.84elapsed 98%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10841minor)pagefaults 0swaps
