-- -*- M2-comint -*-

i1 : R = QQ[x,y];

i2 : M = image vars R

o2 = image | x y |

                             1
o2 : R-module, submodule of R

i3 : N = coker presentation M

o3 = cokernel {1} | -y |
              {1} | x  |

                            2
o3 : R-module, quotient of R

i4 : f = map(M,N,1)

o4 = {1} | 1 0 |
     {1} | 0 1 |

o4 : Matrix

i5 : isWellDefined f

o5 = true

i6 : isIsomorphism f

o6 = true

i7 : g = map(M,cover M,1)

o7 = {1} | 1 0 |
     {1} | 0 1 |

o7 : Matrix

i8 : isWellDefined g

o8 = true

i9 : isIsomorphism g

o9 = false

i10 : h = map(cover M,M,1)

o10 = {1} | 1 0 |
      {1} | 0 1 |

o10 : Matrix

i11 : isWellDefined h

o11 = false

i12 : 
