-- -*- M2-comint -*-

i1 : R = QQ[a..d];

i2 : I = ideal (a^2*b-c^2, a*b^2-d^3, c^5-d);

o2 : Ideal of R

i3 : J = ideal (a^2,b^2,c^2,d^2);

o3 : Ideal of R

i4 : I:J

               2    3   2     2   5
o4 = ideal (a*b  - d , a b - c , c  - d)

o4 : Ideal of R

i5 : P = quotient(I,J)

               2    3   2     2   5
o5 = ideal (a*b  - d , a b - c , c  - d)

o5 : Ideal of R

i6 : Q = quotient(I,J,MinimalGenerators => false)

                 2    3     2     2     5       4   3         4     3  
o6 = ideal (- a*b  + d , - a b + c , - c  + d, a c*d  - a*d, a b*c*d  -
     ------------------------------------------------------------------------
             4 2   2      2   4   3 2        2   6     2    4 3 2    3   
     a*b*d, a b c*d  - a*b , a b*c d  - a*b*c , a b*c*d  - a c d  - a b +
     ------------------------------------------------------------------------
        2
     a*c )

o6 : Ideal of R

i7 : Q == P

o7 = true

i8 : R = ZZ/32003[a..d];

i9 : I = ideal(a^3-b, a^4-c)

             3       4
o9 = ideal (a  - b, a  - c)

o9 : Ideal of R

i10 : Ih = homogenize(I,d)

              3      2   4      3
o10 = ideal (a  - b*d , a  - c*d )

o10 : Ideal of R

i11 : saturate(Ih,d)

                         2     2    3      2   3      2
o11 = ideal (a*b - c*d, a c - b d, b  - a*c , a  - b*d )

o11 : Ideal of R

i12 : saturate(Ih,d,Strategy => Bayer)

                         2     2    3      2   3      2
o12 = ideal (a*b - c*d, a c - b d, b  - a*c , a  - b*d )

o12 : Ideal of R

i13 : 
