-- -*- M2-comint -*- {* hash: 1865567394 *}

i1 : R = QQ[x,y,z];

i2 : I = monomialIdeal(x*y^2, x^2*z, y^2*z)

                       2   2    2
o2 = monomialIdeal (x*y , x z, y z)

o2 : MonomialIdeal of R

i3 : ideal I

               2   2    2
o3 = ideal (x*y , x z, y z)

o3 : Ideal of R

i4 : I * ideal I

             2 4   3 2      4    3 2    4 2   2 2 2     4    2 2 2   4 2
o4 = ideal (x y , x y z, x*y z, x y z, x z , x y z , x*y z, x y z , y z )

o4 : Ideal of R

i5 : I + ideal(x*y+y*z)

               2   2    2
o5 = ideal (x*y , x z, y z, x*y + y*z)

o5 : Ideal of R

i6 : 
0.77user 0.06system 0:00.84elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10814minor)pagefaults 0swaps
