-- -*- M2-comint -*- {* hash: -1527018168 *}

i1 : R = ZZ/101[w,x,y,z];

i2 : ideal{x^2-w*y, x*y-w*z, x*z-y^2}

             2                      2
o2 = ideal (x  - w*y, x*y - w*z, - y  + x*z)

o2 : Ideal of R

i3 : ideal(y^2-x*z,x^2*y-z^2,x^3-y*z)

             2         2     2   3
o3 = ideal (y  - x*z, x y - z , x  - y*z)

o3 : Ideal of R

i4 : E = ZZ/2[x,y, SkewCommutative => true];

i5 : ideal(x^2,x*y)

o5 = ideal (0, x*y)

o5 : Ideal of E

i6 : W = QQ[x,dx, WeylAlgebra => {x => dx}];

i7 : ideal(dx*x+x*dx)

o7 = ideal(2x*dx + 1)

o7 : Ideal of W

i8 : I = ideal(12,18)

o8 = ideal (12, 18)

o8 : Ideal of ZZ

i9 : mingens I

o9 = | 6 |

              1        1
o9 : Matrix ZZ  <--- ZZ

i10 : 
0.78user 0.03system 0:00.81elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10844minor)pagefaults 0swaps
