-- -*- M2-comint -*- {* hash: -1837574050 *}

i1 : R = ZZ/101[x,y];

i2 : p = matrix{{x,y}}

o2 = | x y |

             1       2
o2 : Matrix R  <--- R

i3 : q = map(R^{3},,p)

o3 = {-3} | x y |

             1       2
o3 : Matrix R  <--- R

i4 : degrees target q

o4 = {{-3}}

o4 : List

i5 : degrees source q

o5 = {{-2}, {-2}}

o5 : List

i6 : 
0.80user 0.02system 0:00.82elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10845minor)pagefaults 0swaps
