-- -*- M2-comint -*-

i1 : R = ZZ/101[x,y,z]

o1 = R

o1 : PolynomialRing

i2 : p = map(R^2,,{{x^2,0,3},{0,y^2,5}})

o2 = | x2 0  3 |
     | 0  y2 5 |

             2       3
o2 : Matrix R  <--- R

i3 : isHomogeneous p

o3 = true

i4 : p = matrix {{x^2,0,3},{0,y^2,5}}

o4 = | x2 0  3 |
     | 0  y2 5 |

             2       3
o4 : Matrix R  <--- R

i5 : R = ZZ/101[x,y]

o5 = R

o5 : PolynomialRing

i6 : f = map(R^2,,{{x^2,y^2},{x*y,0}})

o6 = | x2 y2 |
     | xy 0  |

             2       2
o6 : Matrix R  <--- R

i7 : degrees source f

o7 = {{2}, {2}}

o7 : List

i8 : isHomogeneous f

o8 = true

i9 : 
