-- -*- M2-comint -*- {* hash: 925475272 *}

i1 : R = QQ[a..f]

o1 = R

o1 : PolynomialRing

i2 : I = ideal(a,b,c) * ideal(a,b,c)

             2                  2                  2
o2 = ideal (a , a*b, a*c, a*b, b , b*c, a*c, b*c, c )

o2 : Ideal of R

i3 : mingens I

o3 = | c2 bc ac b2 ab a2 |

             1       6
o3 : Matrix R  <--- R

i4 : J = ideal(a-1, b-2, c-3)

o4 = ideal (a - 1, b - 2, c - 3)

o4 : Ideal of R

i5 : I = J*J

             2                                                             
o5 = ideal (a  - 2a + 1, a*b - 2a - b + 2, a*c - 3a - c + 3, a*b - 2a - b +
     ------------------------------------------------------------------------
         2                                                                  
     2, b  - 4b + 4, b*c - 3b - 2c + 6, a*c - 3a - c + 3, b*c - 3b - 2c + 6,
     ------------------------------------------------------------------------
      2
     c  - 6c + 9)

o5 : Ideal of R

i6 : mingens I

o6 = | c2-6c+9 bc-3b-2c+6 ac-3a-c+3 b2-4b+4 ab-2a-b+2 a2-2a+1 |

             1       6
o6 : Matrix R  <--- R

i7 : M = matrix{{a^2*b*c-d*e*f,a^3*c-d^2*f,a*d*f-b*c*e-1}}

o7 = | a2bc-def a3c-d2f -bce+adf-1 |

             1       3
o7 : Matrix R  <--- R

i8 : I = kernel M

o8 = image {4} | -bce+adf-1 0          a3c-d2f   a4c-bcde-d   -a3ce+d2ef   a4df-bd2ef-a3    -a5df+abd2ef+a4  -a5cf+abcdef+adf |
           {4} | 0          -bce+adf-1 -a2bc+def -a3bc+bce2+e a3df-de2f-a2 -a3bdf+bde2f+a2b a4bdf-abde2f-a3b a4bcf-abce2f-aef |
           {3} | -a2bc+def  -a3c+d2f   0         -a2bcd+a3ce  -a5c+a2d2f   -a2bd2f+a3def    a3bd2f-a4def     a3bcdf-a4cef     |

                             3
o8 : R-module, submodule of R

i9 : J = image mingens I

o9 = image {4} | bce-adf+1 0         a3c-d2f   |
           {4} | 0         bce-adf+1 -a2bc+def |
           {3} | a2bc-def  a3c-d2f   0         |

                             3
o9 : R-module, submodule of R

i10 : I == J

o10 = true

i11 : trim I

o11 = image {4} | bce-adf+1 0         a3c-d2f   |
            {4} | 0         bce-adf+1 -a2bc+def |
            {3} | a2bc-def  a3c-d2f   0         |

                              3
o11 : R-module, submodule of R

i12 : 
0.80user 0.06system 0:00.87elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10839minor)pagefaults 0swaps
