-- -*- M2-comint -*- {* hash: -1242126899 *}

i1 : M = monoid [a,b,c,Degrees=>{2,3,4}]

o1 = M

o1 : GeneralOrderedMonoid

i2 : degrees M

o2 = {{2}, {3}, {4}}

o2 : List

i3 : M_0 * M_1^6

        6
o3 = a*b

o3 : M

i4 : a

o4 = a

o4 : M

i5 : use M

o5 = M

o5 : GeneralOrderedMonoid

i6 : a * b^6

        6
o6 = a*b

o6 : M

i7 : options M

o7 = OptionTable{ConstantCoefficients => true                           }
                 DegreeRank => 1
                 Degrees => {{2}, {3}, {4}}
                 Global => true
                 Heft => {1}
                 Inverses => false
                 Local => false
                 MonomialOrder => {GRevLex => {2, 3, 4}, Position => Up}
                 MonomialSize => 32
                 SkewCommutative => {}
                 VariableBaseName => p
                 Variables => {a, b, c}
                 Weights => {}
                 WeylAlgebra => {}

o7 : OptionTable

i8 : R = ZZ[x,y, Degrees => {-1,-2}, Heft => {-1}]

o8 = R

o8 : PolynomialRing

i9 : degree \ gens R

o9 = {{-1}, {-2}}

o9 : List

i10 : transpose vars R

o10 = {1} | x |
      {2} | y |

              2       1
o10 : Matrix R  <--- R

i11 : R = ZZ/101[x,dx,y,dy,WeylAlgebra => {x=>dx, y=>dy}]

o11 = R

o11 : PolynomialRing

i12 : dx*x

o12 = x*dx + 1

o12 : R

i13 : dx*x^10

       10        9
o13 = x  dx + 10x

o13 : R

i14 : dx*y^10

          10
o14 = dx*y

o14 : R

i15 : R = ZZ[x,y,z,SkewCommutative=>{x,y}]

o15 = R

o15 : PolynomialRing

i16 : x*y

o16 = x*y

o16 : R

i17 : y*x

o17 = -x*y

o17 : R

i18 : x*z-z*x

o18 = 0

o18 : R

i19 : R = QQ[a..d, Weights=>{1,2,3,4}]

o19 = R

o19 : PolynomialRing

i20 : monoid R

o20 = [a, b, c, d]

o20 : GeneralOrderedMonoid

i21 : 
0.79user 0.02system 0:00.81elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10841minor)pagefaults 0swaps
