-- -*- M2-comint -*- {* hash: 823305250 *}

i1 : 1/3p100

o1 = .333333333333333333333333333333

o1 : RR (of precision 100)

i2 : {1/3p100}

o2 = {.333333}

o2 : List

i3 : printingPrecision

o3 = 6

i4 : printingPrecision = 16

o4 = 16

i5 : {1/3p100}

o5 = {.3333333333333333}

o5 : List

i6 : printingPrecision = 0

o6 = 0

i7 : {1/3p100}

o7 = {.333333333333333333333333333333}

o7 : List

i8 : printingAccuracy

o8 = -1

i9 : printingPrecision = 16

o9 = 16

i10 : {1p100e12/3+1p100/3*ii}

o10 = {333333333333.3333+.33333*ii}

o10 : List

i11 : printingAccuracy = 10

o11 = 10

i12 : {1p100e12/3+1p100/3*ii}

o12 = {333333333333.3333+.3333333333*ii}

o12 : List

i13 : 
0.78user 0.02system 0:00.81elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10844minor)pagefaults 0swaps
