-- -*- M2-comint -*- {* hash: 352091299 *}

i1 : R = QQ[a..h]

o1 = R

o1 : PolynomialRing

i2 : rows = {0,1,2}

o2 = {0, 1, 2}

o2 : List

i3 : cols = {0,3}

o3 = {0, 3}

o3 : List

i4 : result = map(R^3, 2, (i,j) -> R_(rows_i + cols_j))

o4 = | a d |
     | b e |
     | c f |

             3       2
o4 : Matrix R  <--- R

i5 : R = ZZ/101[a..d];

i6 : m = matrix{{a^2+a^2*c+a*b+3*d}}

o6 = | a2c+a2+ab+3d |

             1       1
o6 : Matrix R  <--- R

i7 : result = coefficients(m, Variables => {a})

o7 = (| a2 a 1 |, {2} | c+1 |)
                  {1} | b   |
                  {0} | 3d  |

o7 : Sequence

i8 : result_0

o8 = | a2 a 1 |

             1       3
o8 : Matrix R  <--- R

i9 : result_1

o9 = {2} | c+1 |
     {1} | b   |
     {0} | 3d  |

             3       1
o9 : Matrix R  <--- R

i10 : R = QQ[a,b,Degrees=>{{1,0},{1,-1}}];

i11 : m = matrix{{a*b, b^2}}

o11 = | ab b2 |

              1       2
o11 : Matrix R  <--- R

i12 : (degrees source m)_0

o12 = {2, -1}

o12 : List

i13 : R = ZZ/101[a..d]

o13 = R

o13 : PolynomialRing

i14 : m = matrix{{a,b},{c,d}}

o14 = | a b |
      | c d |

              2       2
o14 : Matrix R  <--- R

i15 : copym = map(target m, source m, entries m)

o15 = | a b |
      | c d |

              2       2
o15 : Matrix R  <--- R

i16 : R = ZZ[a..d];

i17 : m = matrix{{a^2,b^3,c^4,d^5}}

o17 = | a2 b3 c4 d5 |

              1       4
o17 : Matrix R  <--- R

i18 : map(R^(numgens source m), source m, 
                       (i,j) -> if i === j then m_(0,i) else 0)

o18 = | a2 0  0  0  |
      | 0  b3 0  0  |
      | 0  0  c4 0  |
      | 0  0  0  d5 |

              4       4
o18 : Matrix R  <--- R

i19 : R = ZZ[a..d];

i20 : m = matrix{{a,b^2},{c^2,d^3}}

o20 = | a  b2 |
      | c2 d3 |

              2       2
o20 : Matrix R  <--- R

i21 : betti m

             0 1
o21 = total: 2 2
          0: 2 .
          1: . 1
          2: . 1

o21 : BettiTally

i22 : n = m ** R^{-1}

o22 = {1} | a  b2 |
      {1} | c2 d3 |

              2       2
o22 : Matrix R  <--- R

i23 : betti n

             0 1
o23 = total: 2 2
          1: 2 .
          2: . 1
          3: . 1

o23 : BettiTally

i24 : R = QQ[a..d]

o24 = R

o24 : PolynomialRing

i25 : S = QQ[s,t]

o25 = S

o25 : PolynomialRing

i26 : m = matrix{{a^2-d, b*c}}

o26 = | a2-d bc |

              1       2
o26 : Matrix R  <--- R

i27 : f = matrix{{s^4,s^3*t,s*t^3,t^4}}

o27 = | s4 s3t st3 t4 |

              1       4
o27 : Matrix S  <--- S

i28 : substitute(m,f)

o28 = | s8-t4 s4t4 |

              1       2
o28 : Matrix S  <--- S

i29 : F = map(R,R,{b,c,d,a})

o29 = map(R,R,{b, c, d, a})

o29 : RingMap R <--- R

i30 : m + F m + F F m + F F F m

o30 = | a2+b2+c2+d2-a-b-c-d ab+bc+ad+cd |

              1       2
o30 : Matrix R  <--- R

i31 : substitute(m, {a=>1, b=>3})

o31 = | -d+1 3c |

              1       2
o31 : Matrix R  <--- R

i32 : R = ZZ[s,t]

o32 = R

o32 : PolynomialRing

i33 : m = s^2+t^2

       2    2
o33 = s  + t

o33 : R

i34 : S = R[a..d]

o34 = S

o34 : PolynomialRing

i35 : substitute(m,S)

       2    2
o35 = s  + t

o35 : S

i36 : R = ZZ[a..d]

o36 = R

o36 : PolynomialRing

i37 : f = matrix{{a^2-b*c,3*b*c^4-1}}

o37 = | a2-bc 3bc4-1 |

              1       2
o37 : Matrix R  <--- R

i38 : J = ideal f

              2            4
o38 = ideal (a  - b*c, 3b*c  - 1)

o38 : Ideal of R

i39 : generators J

o39 = | a2-bc 3bc4-1 |

              1       2
o39 : Matrix R  <--- R

i40 : image f

o40 = image | a2-bc 3bc4-1 |

                              1
o40 : R-module, submodule of R

i41 : cokernel f

o41 = cokernel | a2-bc 3bc4-1 |

                             1
o41 : R-module, quotient of R

i42 : id_(R^4)

o42 = | 1 0 0 0 |
      | 0 1 0 0 |
      | 0 0 1 0 |
      | 0 0 0 1 |

              4       4
o42 : Matrix R  <--- R

i43 : myanswer = 2*(numgens R) - 1

o43 = 7

i44 : R = ZZ/31991[a..d]

o44 = R

o44 : PolynomialRing

i45 : a

o45 = a

o45 : R

i46 : a = 43

o46 = 43

i47 : a

o47 = 43

i48 : use R

o48 = R

o48 : PolynomialRing

i49 : a

o49 = a

o49 : R

i50 : I = ideal(a^2-b,c-1,d^2-a*b)

              2                      2
o50 = ideal (a  - b, c - 1, - a*b + d )

o50 : Ideal of R

i51 : J = ideal(a*b-1, c*d-2)

o51 = ideal (a*b - 1, c*d - 2)

o51 : Ideal of R

i52 : intersect(I,J)

              2                                                 3  
o52 = ideal (c d - c*d - 2c + 2, a*b*c - a*b - c + 1, - 10664c*d  +
      -----------------------------------------------------------------------
                                               2                   2 2  
      10664a*b*d + 10663a*b + 10664c*d - 10663d  - 10664d, - 10664c d  +
      -----------------------------------------------------------------------
                         2            2                                     
      10664a*b*c + 10663c d + 10664c*d  - 10664a*b + 10665c*d + c + 10663d -
      -----------------------------------------------------------------------
                 2   2           3         2                2         2   
      1, - 10664b c*d  + 10664a*b  + 10663b c*d + 10664a*c*d  - 10665a b -
      -----------------------------------------------------------------------
            2                  2                           2         2 2  
      10663b d - 10663a*c*d + b  + 10663a*d, - 10664a*b*c*d  + 10664a b  +
      -----------------------------------------------------------------------
                                          2                                  
      10663a*b*c*d - 10663a*b*d + 10664c*d  - 10664a*b - 10663c*d + 10663d, -
      -----------------------------------------------------------------------
            2   2         3          2                2           2  
      10664a c*d  + 10664a b + 10663a c*d + 10664b*c*d  - 10664a*b  -
      -----------------------------------------------------------------------
            2                  2
      10663a d - 10663b*c*d + a  + 10663b*d - b)

o52 : Ideal of R

i53 : 
0.79user 0.09system 0:00.89elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10914minor)pagefaults 0swaps
