-- -*- M2-comint -*-

i1 : R = ZZ/101[x,y,z,w];

i2 : M = cokernel matrix {{x*y-z^2,y^2-w^2,w^4}}

o2 = cokernel | xy-z2 y2-w2 w4 |

                            1
o2 : R-module, quotient of R

i3 : res(M,SyzygyLimit => 1)

      1      1
o3 = R  <-- R  <-- 0
                    
     0      1      2

o3 : ChainComplex

i4 : res(M,SyzygyLimit => 2)

      1      2
o4 = R  <-- R  <-- 0
                    
     0      1      2

o4 : ChainComplex

i5 : res(M,SyzygyLimit => infinity)

      1      3      3      1
o5 = R  <-- R  <-- R  <-- R  <-- 0
                                  
     0      1      2      3      4

o5 : ChainComplex

i6 : 
