-- -*- M2-comint -*-

i1 : R = ZZ/101[x,y,z,w];

i2 : M = cokernel matrix {{x*y-z^2,y^2-w^2}}

o2 = cokernel | xy-z2 y2-w2 |

                            1
o2 : R-module, quotient of R

i3 : res(M,DegreeLimit => 1)

      1      2
o3 = R  <-- R  <-- 0
                    
     0      1      2

o3 : ChainComplex

i4 : res(M,DegreeLimit => 2)

      1      2      1
o4 = R  <-- R  <-- R  <-- 0
                           
     0      1      2      3

o4 : ChainComplex

i5 : 
