-- -*- M2-comint -*-

i1 : R = ZZ[a..f];

i2 : m = mutableMatrix genericMatrix(R,a,2,3)

o2 = | a c e |
     | b d f |

o2 : MutableMatrix

i3 : rowAdd(m,0,c,1)

o3 = | bc+a cd+c cf+e |
     | b    d    f    |

o3 : MutableMatrix

i4 : m

o4 = | bc+a cd+c cf+e |
     | b    d    f    |

o4 : MutableMatrix

i5 : 
