-- -*- M2-comint -*-

i1 : separate( ".", "a.b.c.d" )

o1 = {a, b, c, d}

o1 : List

i2 : peek separate( ".", "a.b.c.d" )

o2 = {"a", "b", "c", "d"}

i3 : demark("=",ooo)

o3 = a=b=c=d

i4 : 
