-- -*- M2-comint -*-

i1 : M = matrix{{1,2,3},{1,34,45},{2213,1123,6543},{0,0,0}}

o1 = | 1    2    3    |
     | 1    34   45   |
     | 2213 1123 6543 |
     | 0    0    0    |

              4        3
o1 : Matrix ZZ  <--- ZZ

i2 : (D,P,Q) = smithNormalForm M

o2 = (| 135654 0 0 |, | 1 33471 -43292 0 |, | 171927 -42421 54868  |)
      | 0      1 0 |  | 0 1     0      0 |  | 93042  -22957 29693  |
      | 0      0 1 |  | 0 0     1      0 |  | -74119 18288  -23654 |
      | 0      0 0 |  | 0 0     0      1 |

o2 : Sequence

i3 : D == P * M * Q

o3 = true

i4 : (D,P) = smithNormalForm(M, ChangeMatrix=>{true,false})

o4 = (| 135654 0 0 |, | 1 33471 -43292 0 |)
      | 0      1 0 |  | 0 1     0      0 |
      | 0      0 1 |  | 0 0     1      0 |
      | 0      0 0 |  | 0 0     0      1 |

o4 : Sequence

i5 : D = smithNormalForm(M, ChangeMatrix=>{false,false}, KeepZeroes=>true)

o5 = | 135654 0 0 |
     | 0      1 0 |
     | 0      0 1 |

              3        3
o5 : Matrix ZZ  <--- ZZ

i6 : prune coker M

o6 = cokernel | 135654 |
              | 0      |

                              2
o6 : ZZ-module, quotient of ZZ

i7 : S = ZZ/101[t]

o7 = S

o7 : PolynomialRing

i8 : D = diagonalMatrix{t^2+1, (t^2+1)^2, (t^2+1)^3, (t^2+1)^5}

o8 = | t2+1 0        0            0                       |
     | 0    t4+2t2+1 0            0                       |
     | 0    0        t6+3t4+3t2+1 0                       |
     | 0    0        0            t10+5t8+10t6+10t4+5t2+1 |

             4       4
o8 : Matrix S  <--- S

i9 : P = random(S^4, S^4)

o9 = | 42  -15 -29 -38 |
     | -50 -22 -39 2   |
     | 39  50  30  -4  |
     | 9   45  19  -36 |

             4       4
o9 : Matrix S  <--- S

i10 : Q = random(S^4, S^4)

o10 = | -16 -32 -42 17  |
      | -6  -38 -50 -28 |
      | -32 31  -41 37  |
      | 31  24  15  -22 |

              4       4
o10 : Matrix S  <--- S

i11 : M = P*D*Q

o11 = | 34t10-32t8-45t6-18t4+38t2-24  -3t10-15t8-20t6-36t4+13t2+41
      | -39t10+7t8+50t6-49t4-33t2+20  48t10+38t8-22t6+12t4-14t2-38
      | -23t10-14t8+22t6+24t4+23t2+12 5t10+25t8-30t6+31t4-11t2+9  
      | -5t10-25t8+49t6-23t4-8t2-17   45t10+23t8+29t6+2t4+t2+50   
      -----------------------------------------------------------------------
      36t10-22t8+34t6+31t4+49t2+9  28t10+39t8+15t6+6t4-10t2-12   |
      30t10+49t8-20t6+36t4-45t2-19 -44t10-18t8+36t6-12t4-26t2-4  |
      41t10+3t8-12t6-23t4-23t2+26  -13t10+36t8-30t6-18t4+17t2-44 |
      -35t10+27t8-18t6+12t4-17t2-8 -16t10+21t8+38t6-18t4-35t2-16 |

              4       4
o11 : Matrix S  <--- S

i12 : (D1,P1,Q1) = smithNormalForm M;

i13 : D1 - P1*M*Q1 == 0

o13 = true

i14 : prune coker M

o14 = cokernel | 0                       0            0        t2+1 |
               | 0                       0            t4+2t2+1 0    |
               | 0                       t6+3t4+3t2+1 0        0    |
               | t10+5t8+10t6+10t4+5t2+1 0            0        0    |

                             4
o14 : S-module, quotient of S

i15 : 
