-- -*- M2-comint -*-

i1 : P = Proj(QQ[a,b,c])

o1 = P

o1 : ProjectiveVariety

i2 : TP = tangentSheaf(P)

o2 = image {-2} | a  b 0 |
           {-2} | -c 0 b |
           {-2} | 0  c a |

                                         3
o2 : coherent sheaf on P, subsheaf of OO  (2)
                                        P

i3 : HH^0(TP(-1))

       3
o3 = QQ

o3 : QQ-module, free

i4 : HH^1(TP(-3))

       1
o4 = QQ

o4 : QQ-module, free

i5 : Node = Proj(QQ[a,b,c]/ideal(b^2*c-a^2*(a+c)))

o5 = Node

o5 : ProjectiveVariety

i6 : Cusp = Proj(QQ[a,b,c]/ideal(b^2*c-a^3))

o6 = Cusp

o6 : ProjectiveVariety

i7 : TNode = tangentSheaf(Node)

o7 = image {0}  | 0  0     |
           {-1} | b  a2+ac |
           {-1} | 2a 2bc   |

                                               1          2
o7 : coherent sheaf on Node, subsheaf of OO      ++ OO     (1)
                                           Node       Node

i8 : HH^0(TNode)

       1
o8 = QQ

o8 : QQ-module, free

i9 : HH^1(TNode)

o9 = 0

o9 : QQ-module

i10 : TCusp = tangentSheaf(Cusp)

o10 = image {1}  | 0   0   |
            {-1} | -2a -2b |
            {-2} | 3bc 3a2 |

                                                1              1             1
o10 : coherent sheaf on Cusp, subsheaf of OO     (-1) ++ OO     (1) ++ OO     (2)
                                            Cusp           Cusp          Cusp

i11 : HH^0(TCusp)

        2
o11 = QQ

o11 : QQ-module, free

i12 : HH^1(TCusp)

o12 = 0

o12 : QQ-module

i13 : 
