-- -*- M2-comint -*- {* hash: 1861653319 *}

i1 : S = ZZ/10007[x,y,z];

i2 : F = res ideal vars S;

i3 : F.dd

          1                 3
o3 = 0 : S  <------------- S  : 1
               | x y z |

          3                        3
     1 : S  <-------------------- S  : 2
               {1} | -y -z 0  |
               {1} | x  0  -z |
               {1} | 0  x  y  |

          3                  1
     2 : S  <-------------- S  : 3
               {2} | z  |
               {2} | -y |
               {2} | x  |

          1
     3 : S  <----- 0 : 4
               0

o3 : ChainComplexMap

i4 : transpose F.dd

           1                       3
o4 = -3 : S  <------------------- S  : -2
                {-3} | z -y x |

           3                        3
     -2 : S  <-------------------- S  : -1
                {-2} | y -x 0  |
                {-2} | z 0  -x |
                {-2} | 0 z  -y |

           3                  1
     -1 : S  <-------------- S  : 0
                {-1} | x |
                {-1} | y |
                {-1} | z |

o4 : ChainComplexMap

i5 : 
0.78user 0.03system 0:00.81elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10829minor)pagefaults 0swaps
