-- -*- M2-comint -*-

i1 : value "2 + 2"

o1 = 4

i2 : value "a := 33
     a+a"

o2 = 66

i3 : a

o3 = a

o3 : Symbol

i4 : 
