-- -*- M2-comint -*- {* hash: 2700966857888603741

i1 : K=QQ;

i2 : R=K[v,u,z];

i3 : I=ideal(v^8-u^3*(z+u)^5);

o3 : Ideal of R

i4 : p=parametrize(I)

o4 = | t_0^2t_1t_2  |
     | -t_2^4       |
     | -t_0^4+t_2^4 |

            /QQ[t , t , t ]\       /QQ[t , t , t ]\
            |    0   1   2 |3      |    0   1   2 |1
o4 : Matrix |--------------|  <--- |--------------|
            |    2         |       |    2         |
            |   t  - t t   |       |   t  - t t   |
            \    1    0 2  /       \    1    0 2  /

i5 : parametrize(I,parametrizeConic=>true)

o5 = | t_0^3t_1^5  |
     | -t_0^8      |
     | t_0^8-t_1^8 |

                        3                  1
o5 : Matrix (QQ[t , t ])  <--- (QQ[t , t ])
                 0   1              0   1

i6 : Irnc=mapToRNC(I);

o6 : Ideal of QQ[x , x , x , x , x , x , x ]
                  0   1   2   3   4   5   6

i7 : parametrize(Irnc)

o7 = | t_0^2t_2   |
     | -t_1t_2^2  |
     | t_0^3      |
     | -t_0t_1t_2 |
     | t_2^3      |
     | -t_0^2t_1  |
     | t_0t_2^2   |

            /QQ[t , t , t ]\       /QQ[t , t , t ]\
            |    0   1   2 |7      |    0   1   2 |1
o7 : Matrix |--------------|  <--- |--------------|
            |    2         |       |    2         |
            |   t  - t t   |       |   t  - t t   |
            \    1    0 2  /       \    1    0 2  /

i8 : parametrize(Irnc,parametrizeConic=>true)

o8 = | -t_0^2t_1^4 |
     | t_0^5t_1    |
     | -t_1^6      |
     | t_0^3t_1^3  |
     | -t_0^6      |
     | t_0t_1^5    |
     | -t_0^4t_1^2 |

                        7                  1
o8 : Matrix (QQ[t , t ])  <--- (QQ[t , t ])
                 0   1              0   1

i9 : Iconic=ideal ring p

            2
o9 = ideal(t  - t t )
            1    0 2

o9 : Ideal of QQ[t , t , t ]
                  0   1   2

i10 : parametrize(Iconic)

o10 = | -t_1^2  |
      | -t_0t_1 |
      | -t_0^2  |

                         3                  1
o10 : Matrix (QQ[t , t ])  <--- (QQ[t , t ])
                  0   1              0   1

i11 : K=QQ;

i12 : R=K[v,u,z];

i13 : I=ideal(u^5+2*u^2*v*z^2+2*u^3*v*z+u*v^2*z^2-4*u*v^3*z+2*v^5);

o13 : Ideal of R

i14 : parametrize(I)

o14 = | -2t_0^2t_1^3+t_0t_1^4 |
      | 4t_0^4t_1-2t_0^3t_1^2 |
      | -4t_0^5+t_1^5         |

                         3                  1
o14 : Matrix (QQ[t , t ])  <--- (QQ[t , t ])
                  0   1              0   1

i15 : Irnc=mapToRNC(I);

o15 : Ideal of QQ[x , x , x , x ]
                   0   1   2   3

i16 : parametrize(Irnc)

o16 = | 2t_0^2t_1 |
      | -t_1^3    |
      | 2t_0^3    |
      | -t_0t_1^2 |

                         4                  1
o16 : Matrix (QQ[t , t ])  <--- (QQ[t , t ])
                  0   1              0   1

i17 : K=QQ;

i18 : R=K[v,u,z];

i19 : I=ideal(v^8-u^3*(z+u)^5);

o19 : Ideal of R

i20 : J=ideal(u^6+4*u^5*z+6*u^4*z^2+4*u^3*z^3+u^2*z^4,v*u^5+3*v*u^4*z+3*v*u^3*z^2+v*u^2*z^3,v^2*u^4+3*v^2*u^3*z+3*v^2*u^2*z^2+v^2*u*z^3,v^3*u^3+2*v^3*u^2*z+v^3*u*z^2,v^4*u^2+v^4*u*z,v^5*u+v^5*z,v^6);

o20 : Ideal of R

i21 : p=parametrize(I,J)

o21 = | t_0^2t_1t_2  |
      | -t_2^4       |
      | -t_0^4+t_2^4 |

             /QQ[t , t , t ]\       /QQ[t , t , t ]\
             |    0   1   2 |3      |    0   1   2 |1
o21 : Matrix |--------------|  <--- |--------------|
             |    2         |       |    2         |
             |   t  - t t   |       |   t  - t t   |
             \    1    0 2  /       \    1    0 2  /

i22 : parametrize(I,J,parametrizeConic=>true)

o22 = | t_0^3t_1^5  |
      | -t_0^8      |
      | t_0^8-t_1^8 |

                         3                  1
o22 : Matrix (QQ[t , t ])  <--- (QQ[t , t ])
                  0   1              0   1

i23 : Irnc=mapToRNC(I,J);

o23 : Ideal of QQ[x , x , x , x , x , x , x ]
                   0   1   2   3   4   5   6

i24 : parametrize(Irnc)

o24 = | t_0^2t_2   |
      | -t_1t_2^2  |
      | t_0^3      |
      | -t_0t_1t_2 |
      | t_2^3      |
      | -t_0^2t_1  |
      | t_0t_2^2   |

             /QQ[t , t , t ]\       /QQ[t , t , t ]\
             |    0   1   2 |7      |    0   1   2 |1
o24 : Matrix |--------------|  <--- |--------------|
             |    2         |       |    2         |
             |   t  - t t   |       |   t  - t t   |
             \    1    0 2  /       \    1    0 2  /

i25 : parametrize(Irnc,parametrizeConic=>true)

o25 = | -t_0^2t_1^4 |
      | t_0^5t_1    |
      | -t_1^6      |
      | t_0^3t_1^3  |
      | -t_0^6      |
      | t_0t_1^5    |
      | -t_0^4t_1^2 |

                         7                  1
o25 : Matrix (QQ[t , t ])  <--- (QQ[t , t ])
                  0   1              0   1

i26 : Iconic=ideal ring p

             2
o26 = ideal(t  - t t )
             1    0 2

o26 : Ideal of QQ[t , t , t ]
                   0   1   2

i27 : parametrize(Iconic)

o27 = | -t_1^2  |
      | -t_0t_1 |
      | -t_0^2  |

                         3                  1
o27 : Matrix (QQ[t , t ])  <--- (QQ[t , t ])
                  0   1              0   1

i28 : K=QQ;

i29 : R=K[v,u,z];

i30 : I=ideal(u^5+2*u^2*v*z^2+2*u^3*v*z+u*v^2*z^2-4*u*v^3*z+2*v^5);

o30 : Ideal of R

i31 : J=ideal(u^3+v*u*z,v*u^2+v^2*z,v^2*u-u^2*z,v^3-v*u*z);

o31 : Ideal of R

i32 : parametrize(I,J)

o32 = | -2t_0^2t_1^3+t_0t_1^4 |
      | 4t_0^4t_1-2t_0^3t_1^2 |
      | -4t_0^5+t_1^5         |

                         3                  1
o32 : Matrix (QQ[t , t ])  <--- (QQ[t , t ])
                  0   1              0   1

i33 : Irnc=mapToRNC(I,J);

o33 : Ideal of QQ[x , x , x , x ]
                   0   1   2   3

i34 : parametrize(Irnc)

o34 = | 2t_0^2t_1 |
      | -t_1^3    |
      | 2t_0^3    |
      | -t_0t_1^2 |

                         4                  1
o34 : Matrix (QQ[t , t ])  <--- (QQ[t , t ])
                  0   1              0   1

i35 : 
