-- -*- M2-comint -*- {* hash: 3690009934660897938

i1 : R=QQ[y_0..y_2];

i2 : I=ideal(7*y_0^2+11*y_2^2+13*y_0*y_2+17*y_1^2+19*y_1*y_2);

o2 : Ideal of R

i3 : p=rationalPointOnConic I

o3 = | 67 49 -70 |

              1        3
o3 : Matrix QQ  <--- QQ

i4 : sub(I,{y_0=>p_(0,0),y_1=>p_(0,1),y_2=>p_(0,2)})

o4 = ideal 0

o4 : Ideal of QQ

i5 : I=ideal(y_0^2+y_1^2+2*y_0*y_1+y_2^2);

o5 : Ideal of R

i6 : p=rationalPointOnConic I

o6 = | -1 1 0 |

              1        3
o6 : Matrix QQ  <--- QQ

i7 : sub(I,{y_0=>p_(0,0),y_1=>p_(0,1),y_2=>p_(0,2)})

o7 = ideal 0

o7 : Ideal of QQ

i8 : I=ideal(y_0^2+y_2^2+2*y_0*y_2+2*y_1^2+2*y_1*y_2+4*y_0*y_1);

o8 : Ideal of R

i9 : p=rationalPointOnConic I

o9 = | 1 -1 1 |

              1        3
o9 : Matrix QQ  <--- QQ

i10 : sub(I,{y_0=>p_(0,0),y_1=>p_(0,1),y_2=>p_(0,2)})

o10 = ideal 0

o10 : Ideal of QQ

i11 : I=ideal(y_0^2+y_2^2+y_1^2);

o11 : Ideal of R

i12 : p=rationalPointOnConic I

o12 = 0

               1        3
o12 : Matrix QQ  <--- QQ

i13 : 
