-- -*- M2-comint -*- hash: 9537531392588719295

i1 : rayList={{1,0},{0,1},{-1,-1},{0,-1}}

o1 = {{1, 0}, {0, 1}, {-1, -1}, {0, -1}}

o1 : List

i2 : coneList={{0,1},{1,2},{2,3},{3,0}}

o2 = {{0, 1}, {1, 2}, {2, 3}, {3, 0}}

o2 : List

i3 : X = normalToricVariety(rayList,coneList)

o3 = X

o3 : NormalToricVariety

i4 : C = X_{0,1} + X_{0,2} - 2*X_{0,3} + X_{0}

o4 = X    + X       + X       - 2*X
      {0}    {0, 1}    {0, 2}      {0, 3}

o4 : ToricCycle on X

i5 : C_{0,1}

o5 = 1

i6 : C_{0,2}

o6 = 1

i7 : C_{0,3}

o7 = -2

o7 : QQ

i8 : C_0

o8 = 1

i9 : 
