-- -*- M2-comint -*- hash: 10334800726171494429

i1 : X = toricProjectiveSpace 5

o1 = X

o1 : NormalToricVariety

i2 : D = X_{0,1}+5*X_{1,3}-X_{2}+2*X_{3}

o2 = X       - X    + 2*X    + 5*X
      {0, 1}    {2}      {3}      {1, 3}

o2 : ToricCycle on X

i3 : C = X_{2,3}

o3 = X
      {2, 3}

o3 : ToricCycle on X

i4 : D*C

o4 = X          + X             + 5*X
      {2, 3, 5}    {0, 1, 2, 3}      {1, 2, 3, 5}

o4 : ToricCycle on X

i5 : X = toricProjectiveSpace 2

o5 = X

o5 : NormalToricVariety

i6 : Y = toricBlowup({0,1},X)

o6 = Y

o6 : NormalToricVariety

i7 : D = Y_{3}

o7 = Y
      {3}

o7 : ToricCycle on Y

i8 : D*D

o8 = - Y
        {1, 3}

o8 : ToricCycle on Y

i9 : 
