-- -*- M2-comint -*- hash: 6011130988159146538

i1 : X = toricProjectiveSpace 4

o1 = X

o1 : NormalToricVariety

i2 : D = X_0+2*X_1+3*X_2+4*X_3

o2 = X  + 2*X  + 3*X  + 4*X
      0      1      2      3

o2 : ToricDivisor on X

i3 : C = X_{2,3}

o3 = X
      {2, 3}

o3 : ToricCycle on X

i4 : D*C

o4 = 10*X
         {1, 2, 3}

o4 : ToricCycle on X

i5 : X = toricProjectiveSpace 2

o5 = X

o5 : NormalToricVariety

i6 : Y = toricBlowup({0,1},X)

o6 = Y

o6 : NormalToricVariety

i7 : D = Y_3

o7 = Y
      3

o7 : ToricDivisor on Y

i8 : C = Y_{3}

o8 = Y
      {3}

o8 : ToricCycle on Y

i9 : D*C

o9 = - Y
        {1, 3}

o9 : ToricCycle on Y

i10 : 
