-- -*- M2-comint -*- hash: 8455720840136440177

i1 : rayList={{1,0},{0,1},{-1,-1},{0,-1}}

o1 = {{1, 0}, {0, 1}, {-1, -1}, {0, -1}}

o1 : List

i2 : coneList={{0,1},{1,2},{2,3},{3,0}}

o2 = {{0, 1}, {1, 2}, {2, 3}, {3, 0}}

o2 : List

i3 : X = normalToricVariety(rayList,coneList)

o3 = X

o3 : NormalToricVariety

i4 : D = X_3

o4 = X
      3

o4 : ToricDivisor on X

i5 : D*{2}

o5 = X
      {2, 3}

o5 : ToricCycle on X

i6 : D*{1}

o6 = 0

o6 : ToricCycle on X

i7 : D = X_0 + 2*X_1 + 3*X_2 + 4*X_3

o7 = X  + 2*X  + 3*X  + 4*X
      0      1      2      3

o7 : ToricDivisor on X

i8 : C = (orbits X)#1#0

o8 = {0}

o8 : List

i9 : D*C

o9 = 6*X
        {0, 3}

o9 : ToricCycle on X

i10 : 
