-- -*- M2-comint -*- hash: 8149921156246695818

i1 : X = toricProjectiveSpace 3;

i2 : R = QQ[x_1 .. x_3];

i3 : f = x_1*x_2*x_3 + x_1*x_2 + x_1*x_3 + x_2*x_3;

i4 : T = tropicalVariety(ideal f);

i5 : F = gfanFanCommonRefinement(fan X, fan T);

i6 : X' = makeSimplicial (normalToricVariety F);

i7 : mult = refineMultiplicity(T,X');

i8 : pushforwardMultiplicity(X,X',mult,dim T)

o8 = {3, 3, 3, 3, 3, 3}

o8 : List

i9 : 
