-- -*- M2-comint -*- hash: 1570067667

i1 : NumberToB'String(2+5*ii)

o1 = .2e1 .5e1

i2 : NumberToB'String(1/3,M2Precision=>16)
Warning: rational numbers will be converted to floating point.

o2 = .33333333333333331e0 .0e0

i3 : NumberToB'String(1/3,M2Precision=>128)
Warning: rational numbers will be converted to floating point.

o3 = .3333333333333333333333333333333333333338e0 .0e0

i4 : 
