-- -*- M2-comint -*- {* hash: -644878192 *}
--loading configuration for package "Bertini" from file /Users/jo/Library/Application Support/Macaulay2/init-Bertini.m2

i1 : R=CC[x0,x1,x2]

o1 = R

o1 : PolynomialRing

i2 : F={x0^3-x1^3+x2^3+1}

        3     3     3
o2 = {x0  - x1  + x2  + 1}

o2 : List

i3 : sliceH=makeB'Slice({2},{{x0,x1,x2,1}},NameB'Slice=>"H")
2
{{}, {}}

o3 = B'Slice{...4...}

o3 : B'Slice

i4 : makeB'InputFile(storeBM2Files,
         AffVariableGroup=>{x0,x1,x2},
         ParameterGroup=>{T},
         B'Configs=>{{ParameterHomotopy,1}},
         B'Functions=>{sliceH},
         B'Polynomials=>{"H0+T","H1"}|F)

o4 = /var/folders/j_/gx42s4z576z_vj47_ym0j5xm0000gn/T/M2-59485-0/0/input

o4 : File

i5 : runBertini(storeBM2Files,PreparePH2=>true)
~/bertini

i6 : b'TraceTestImage(storeBM2Files)
~/bertini
~/bertini

o6 = {4.44089e-16+4.44089e-16*ii, 4.44089e-16-2.22045e-16*ii,
     ------------------------------------------------------------------------
     -8.88178e-16-1.88738e-15*ii}

o6 : List

i7 : R=CC[x,y,z]**CC[a,b]

o7 = R

o7 : PolynomialRing

i8 : xyzSub={{x,a},{y,a^2+b},{z,a^2+b^2}}

                   2            2    2
o8 = {{x, a}, {y, a  + b}, {z, a  + b }}

o8 : List

i9 : sliceH=makeB'Slice({2},{{x,y,z,1}},NameB'Slice=>"H")
2
{{}, {}}

o9 = B'Slice{...4...}

o9 : B'Slice

i10 : makeB'InputFile(storeBM2Files,
          AffVariableGroup=>{a,b},
          ParameterGroup=>{T},
          B'Configs=>{{ParameterHomotopy,1}},
          B'Functions=>xyzSub|{sliceH},
          B'Polynomials=>{"H1","H0+T"})

o10 = /var/folders/j_/gx42s4z576z_vj47_ym0j5xm0000gn/T/M2-59485-0/0/input

o10 : File

i11 : runBertini(storeBM2Files,PreparePH2=>true)
~/bertini

i12 : s=importSolutionsFile(storeBM2Files)

o12 = {{-1.29076-.462161*ii, -.147531-1.61687*ii}, {-.214743-.12604*ii,
      -----------------------------------------------------------------------
      -.144177+.855286*ii}, {-.372046+2.85026*ii, 3.52829+.267463*ii},
      -----------------------------------------------------------------------
      {.18+.746277*ii, -1.23658+.494121*ii}}

o12 : List

i13 : b'TraceTestImage(storeBM2Files,MapPoints=>({a,a^2+b,a^2+b^2},{a,b}))
~/bertini
~/bertini

o13 = {-2.66454e-15*ii, 7.10543e-15 + 3.10862e-15*ii, 3.10862e-15 -
      -----------------------------------------------------------------------
      3.9968e-15*ii}

o13 : List

i14 : R=CC[x0,x1,x2]

o14 = R

o14 : PolynomialRing

i15 : F={x0^3-x1^3+x2^3+1}

         3     3     3
o15 = {x0  - x1  + x2  + 1}

o15 : List

i16 : sliceH=makeB'Slice(2,{x0,x1,x2,1},NameB'Slice=>"H")
2
{{}, {}}

o16 = B'Slice{...4...}

o16 : B'Slice

i17 : makeB'InputFile(storeBM2Files,
          AffVariableGroup=>{x0,x1,x2},
          ParameterGroup=>{T},
          B'Configs=>{{ParameterHomotopy,1}},
          B'Functions=>{sliceH},
          B'Polynomials=>{"H0+T","H1"}|F)

o17 = /var/folders/j_/gx42s4z576z_vj47_ym0j5xm0000gn/T/M2-59485-0/0/input

o17 : File

i18 : runBertini(storeBM2Files,PreparePH2=>true)
~/bertini

i19 : b'TraceTestImage(storeBM2Files,StopBeforeTest=>true)--Returns the trace for each parameter homotopy using -gammma, 0, and gamma respectively.
~/bertini
~/bertini

o19 = {{.798506+.751172*ii, .204728+.630249*ii, -2.14159-.776108*ii},
      -----------------------------------------------------------------------
      {.439075+.451355*ii, .243072+.525944*ii, -2.01035-.397428*ii},
      -----------------------------------------------------------------------
      {.0796441+.151539*ii, .281417+.421639*ii, -1.87911-.018748*ii}}

o19 : List

i20 : 
