-- -*- M2-comint -*- hash: 1488243299

i1 : R = CC[x,y];

i2 : F = {x^2-1,y^2-2};

i3 : S = bertiniZeroDimSolve F

o3 = {{1, 1.41421}, {1, -1.41421}, {-1, 1.41421}, {-1, -1.41421}}

o3 : List

i4 : peek S_0

o4 = Point{AccuracyEst => 5.55221e-14        }
           AccuracyEstInternal => 1.09532e-14
           ConditionNumber => 3.19545
           Coordinates => {1, 1.41421}
           CycleNumber => 1
           FinalTValue => .000390625
           FunctionResidual => 1.11886e-16
           MaxPrecisionUtilized => 52
           Multiplicity => 1
           NewtonResidual => 8.23628e-17
           PathNumber => 0
           PathsWithSameEndpoint => {}
           PrecisionIncreased => 0
           SolutionNumber => 1

i5 : R = CC[x];

i6 : F = {x^2*(x-1)};

i7 : S = bertiniZeroDimSolve F

o7 = {{1}, {3.51449e-14+6.41131e-14*ii}}

o7 : List

i8 : B = bertiniZeroDimSolve(F,UseRegeneration=>1)

o8 = {{1}}

o8 : List

i9 : 
