-- -*- M2-comint -*- {* hash: 107541960 *}
/Users/MacMath/Library/Application Support/Macaulay2/local/share/Macaulay2/NAGtypes.m2:635: warning: documentation already provided for 'NAGtypes :: generalEquations'
/Users/MacMath/Library/Application Support/Macaulay2/local/share/Macaulay2/NAGtypes.m2:290: ... here is the (end of the) previous documentation
--loading configuration for package "Bertini" from file /Users/MacMath/Library/Application Support/Macaulay2/init-Bertini.m2
/Users/MacMath/Desktop/M2PackagesExist/packages/Bertini.m2:370:10:(3):[10]: warning: local declaration of f shields variable with same name
/Users/MacMath/Desktop/M2PackagesExist/packages/Bertini.m2:556:8:(3):[10]: warning: local declaration of l shields variable with same name
/Users/MacMath/Desktop/M2PackagesExist/packages/Bertini.m2:564:8:(3):[10]: warning: local declaration of pts shields variable with same name
/Users/MacMath/Desktop/M2PackagesExist/packages/Bertini.m2:567:13:(3):[10]: warning: local declaration of maxPrec shields variable with same name
/Users/MacMath/Desktop/M2PackagesExist/packages/Bertini.m2:772:8:(3):[10]: warning: local declaration of l shields variable with same name
/Users/MacMath/Desktop/M2PackagesExist/packages/Bertini.m2:781:8:(3):[10]: warning: local declaration of pts shields variable with same name
/Users/MacMath/Desktop/M2PackagesExist/packages/Bertini.m2:786:13:(3):[10]: warning: local declaration of maxPrec shields variable with same name
/Users/MacMath/Desktop/M2PackagesExist/packages/Bertini.m2:817:8:(3):[10]: warning: local declaration of numVars shields variable with same name
/Users/MacMath/Desktop/M2PackagesExist/packages/Bertini.m2:822:8:(3):[10]: warning: local declaration of l shields variable with same name

i1 : R = CC[x,y,z]

o1 = R

o1 : PolynomialRing

i2 : F = {(y^2+x^2+z^2-1)*x,
          (y^2+x^2+z^2-1)*y}

       3      2      2       2     3      2
o2 = {x  + x*y  + x*z  - x, x y + y  + y*z  - y}

o2 : List

i3 : NV = bertiniPosDimSolve(F)
Temporary directory for input and output files:/tmp/M2-14886-0/0

The version of Bertini you have installed on your computer was used for this run. 
Bertini is under ongoing development by D. Bates, J. Hauenstein, A. Sommese, and C. Wampler.


o3 = A variety of dimension 2 with components in
     dim 1:  [dim=1,deg=1]
     dim 2:  [dim=2,deg=2]

o3 : NumericalVariety

i4 : pts = {{0,0,0}} --z-axis

o4 = {{0, 0, 0}}

o4 : List

i5 : bertiniComponentMemberTest(NV,pts)
Temporary directory for input and output files:/tmp/M2-14886-0/1

The version of Bertini you have installed on your computer was used for this run.           {1}
Bertini is under ongoing development by D. Bates, J. Hauenstein, A. Sommese, and C. Wampler.


{}

o5 = {{[dim=1,deg=1]}}

o5 : List

i6 : 
