-- -*- M2-comint -*- hash: 1437360351269936102

i1 : radicalList({2.000,1.999})

o1 = {2, 1.999}

o1 : List

i2 : radicalList({2.000,1.999},1e-10)

o2 = {2, 1.999}

o2 : List

i3 : radicalList({2.000,1.999},1e-2)

o3 = {2}

o3 : List

i4 : 
