-- -*- M2-comint -*- hash: -1326406187

i1 : R=CC[x,y,z]

o1 = R

o1 : PolynomialRing

i2 : f=z*x+y

o2 = x*z + y

o2 : R

i3 : subPoint(f,{x,y},{.1,.2})

o3 = .1z + .2

o3 : R

i4 : subPoint(f,{x,y,z},{.1,.2,.3},SpecifyVariables=>{y})

o4 = x*z + .2

o4 : R

i5 : R=CC_200[x,y,z]

o5 = R

o5 : PolynomialRing

i6 : f=z*x+y

o6 = x*z + y

o6 : R

i7 : subPoint(f,{x,y,z},{.1,.2,.3},SubIntoCC=>true)

o7 = .23

o7 : CC (of precision 53)

i8 : subPoint(f,{x,y,z},{.1234567890123456789012345678901234567890p200,
             0,1},SubIntoCC=>true,M2Precision=>200)

o8 = .123456789012345678901234567890123456789

o8 : CC (of precision 200)

i9 : 
