-- -*- M2-comint -*- hash: 438712966

i1 : valueBM2("1.22e-2 4e-5")

o1 = .0122+.00004*ii

o1 : CC (of precision 53)

i2 : valueBM2("1.22 4e-5")

o2 = 1.22+.00004*ii

o2 : CC (of precision 53)

i3 : valueBM2("1.22 4")

o3 = 1.22+4*ii

o3 : CC (of precision 53)

i4 : valueBM2("1.22e+2 4 ")

o4 = 122+4*ii

o4 : CC (of precision 53)

i5 : n1=valueBM2("1.11",M2Precision=>52)

o5 = 1.11

o5 : RR (of precision 52)

i6 : n2=valueBM2("1.11",M2Precision=>300)

o6 = 1.11

o6 : RR (of precision 300)

i7 : toExternalString n1

o7 = .11099999999999999p52e1

i8 : toExternalString n2

o8 = .11100000000000000000000000000000000000000000000000000000000000000000000000000000000000000003p300e1

i9 : 
