-- -*- M2-comint -*- {* hash: -881763398 *}

i1 : R=QQ[x,y,z]

o1 = R

o1 : PolynomialRing

i2 : S={x+y+z-1,x^2+y^2,x+y-z-3}

                      2    2
o2 = {x + y + z - 1, x  + y , x + y - z - 3}

o2 : List

i3 : printWidth = 300 -- want output to fit on one line

o3 = 300

i4 : L=phcSolve(S)
using temporary file name /tmp/M2-69391-1PHCinput

o4 = {{1+ii, 1-ii, -1}, {1-ii, 1+ii, -1}}

o4 : List

i5 : I=ideal(y-x^2,z-x^3,x^2-y)

               2         3       2
o5 = ideal (- x  + y, - x  + z, x  - y)

o5 : Ideal of R

i6 : dim I

o6 = 1

i7 : system = flatten entries gens I

         2         3       2
o7 = {- x  + y, - x  + z, x  - y}

o7 : List

i8 : vol = mixedVolume(system) --this returns zero, but that's not informative!
using temporary file name /tmp/M2-69391-2PHCinput

o8 = 0

i9 : phcSolve(system)
using temporary file name /tmp/M2-69391-3PHCinput

o9 = {(-4.45338e-16+3.18282e-16*ii, -3.2821e-31-1.22655e-30*ii, 3.42073e-31+4.1963e-31*ii)}

o9 : List

i10 : numgens I

o10 = 3

i11 : numgens ring I

o11 = 3

i12 : numcols mingens I --not all generators are minimal.

o12 = 2

i13 : dim trim I

o13 = 1

i14 : system={y-x^2, z-x^3,x+y+z-1,x+y+ x^3 -1}

          2         3                      3
o14 = {- x  + y, - x  + z, x + y + z - 1, x  + x + y - 1}

o14 : List

i15 : #system > numcols vars R --overdetermined system

o15 = true

i16 : solns =phcSolve(system); --but code still works (slack vars)
using temporary file name /tmp/M2-69391-4PHCinput

i17 : numSolns = #solns

o17 = 3

i18 : 
