
i1 : S = ZZ[x, y, z];

i2 : elementaryBasis = ideal(x+y+z, x*y+x*z+y*z, x*y*z);

o2 : Ideal of S

i3 : saturate(elementaryBasis, x)

o3 = ideal 1

o3 : Ideal of S

i4 : powerSumBasis = ideal(x+y+z, x^2+y^2+z^2, x^3+y^3+z^3);

o4 : Ideal of S

i5 : saturate(powerSumBasis, x)

                                  2           2
o5 = ideal (6, x + y + z, 3y*z, 2y  - y*z + 2z )

o5 : Ideal of S

i6 : clearAll

i7 : S = QQ[t, y_0 .. y_8, a..i, MonomialOrder => Eliminate 10];

i8 : N3 = (matrix {{0,1,0},{0,0,1},{0,0,0}}) ** S

o8 = | 0 1 0 |
     | 0 0 1 |
     | 0 0 0 |

             3       3
o8 : Matrix S  <--- S

i9 : G = genericMatrix(S, y_0, 3, 3)

o9 = | y_0 y_3 y_6 |
     | y_1 y_4 y_7 |
     | y_2 y_5 y_8 |

             3       3
o9 : Matrix S  <--- S

i10 : classicalAdjoint = (G) -> (
           n := degree target G;
           m := degree source G;
           matrix table(n, n, (i, j) -> (-1)^(i+j) * det(
                     submatrix(G, {0..j-1, j+1..n-1}, 
                          {0..i-1, i+1..m-1}))));

i11 : num = G * N3 * classicalAdjoint(G);

              3       3
o11 : Matrix S  <--- S

i12 : D = det(G);

i13 : M = genericMatrix(S, a, 3, 3);

              3       3
o13 : Matrix S  <--- S

i14 : elimIdeal = minors(1, (D*id_(S^3))*M - num) + ideal(1-D*t);

o14 : Ideal of S

i15 : closureOfOrbit = ideal selectInSubring(1, gens gb elimIdeal);

o15 : Ideal of S

i16 : X = ideal substitute(
              contract(matrix{{t^2,t,1}}, det(t-M)),
              {t => 0_S})

o16 = ideal (- a - e - i, - b*d + a*e - c*g - f*h + a*i + e*i, c*e*g - b*f*g - c*d*h + a*f*h + b*d*i - a*e*i)

o16 : Ideal of S

i17 : closureOfOrbit == X

o17 = true

i18 : clearAll

i19 : S = QQ[x, y, z, a..j, MonomialOrder => Eliminate 2];

i20 : F = a*x^3+b*x^2*y+c*x^2*z+d*x*y^2+e*x*y*z+f*x*z^2+g*y^3+h*y^2*z+
                   i*y*z^2+j*z^3;

i21 : partials = submatrix(jacobian matrix{{F}}, {0..2}, {0})

o21 = {1} | 3x2a+2xyb+y2d+2xzc+yze+z2f |
      {1} | x2b+2xyd+3y2g+xze+2yzh+z2i |
      {1} | x2c+xye+y2h+2xzf+2yzi+3z2j |

              3       1
o21 : Matrix S  <--- S

i22 : singularities = ideal(partials) + ideal(F);

o22 : Ideal of S

i23 : elimDiscr = time ideal selectInSubring(1,gens gb singularities);
     -- used 18.3771 seconds

o23 : Ideal of S

i24 : elimDiscr = substitute(elimDiscr, {z => 1});

o24 : Ideal of S

i25 : A = contract(matrix{{x^2,x*y,y^2,x*z,y*z,z^2}},
              diff(transpose matrix{{x,y,z}},F))

o25 = {1} | 3a 2b d  2c e  f  |
      {1} | b  2d 3g e  2h i  |
      {1} | c  e  h  2f 2i 3j |

              3       6
o25 : Matrix S  <--- S

i26 : hess = det submatrix(jacobian ideal partials, {0..2}, {0..2});

i27 : B = contract(matrix{{x^2,x*y,y^2,x*z,y*z,z^2}},
              diff(transpose matrix{{x,y,z}},hess))

o27 = {1} | -24c2d+24bce-18ae2-24b2f+72adf               4be2-16bdf-48c2g+144afg+32bch-48aeh-16b2i+48adi         2de2-8d2f-24ceg+24bfg+16cdh-24ah2-8bdi+72agi  4ce2-16cdf-16c2h+48afh+32bci-48aei-48b2j+144adj         2e3-8def-24cfg-8ceh+24bfh+24cdi-8bei-24ahi-24bdj+216agj 2e2f-8df2-8cfh+16bfi-24ai2+24cdj-24bej+72ahj  |
      {1} | 2be2-8bdf-24c2g+72afg+16bch-24aeh-8b2i+24adi 4de2-16d2f-48ceg+48bfg+32cdh-48ah2-16bdi+144agi         -18e2g+24deh-24bh2-24d2i+72bgi                2e3-8def-24cfg-8ceh+24bfh+24cdi-8bei-24ahi-24bdj+216agj -48efg+4e2h+32dfh-16ch2+48cgi-16bhi-48d2j+144bgj        -24f2g+2e2i+16dfi-8chi-8bi2-24dej+72cgj+24bhj |
      {1} | 2ce2-8cdf-8c2h+24afh+16bci-24aei-24b2j+72adj 2e3-8def-24cfg-8ceh+24bfh+24cdi-8bei-24ahi-24bdj+216agj -24efg+2e2h+16dfh-8ch2+24cgi-8bhi-24d2j+72bgj 4e2f-16df2-16cfh+32bfi-48ai2+48cdj-48bej+144ahj         -48f2g+4e2i+32dfi-16chi-16bi2-48dej+144cgj+48bhj        -24f2h+24efi-24ci2-18e2j+72chj                |

              3       6
o27 : Matrix S  <--- S

i28 : detDiscr = ideal det (A || B, Strategy=>Cofactor);

o28 : Ideal of S

i29 : detDiscr == elimDiscr

o29 = true

i30 : detDiscr_0

            2   4 3 2             5 3 2           6 3 2          2 2 2 4 2                3 4 2         2 4 4 2              4 4 2          2 3 5 2              2   5 2          2   2 5 2            2 2 5 2          2 2 6 2            3 6 2         3 3 3 3          3     4 3            2 2 4 3              3 4 3            2   5 3           2     5 3                   5 3              2 5 3          3 6 3                 6 3          4 4 4             2 5 4           2 6 4         2   5 2                6 2              7 2             2 2 3 3                   4 3            2 5 3                 5 3             2 3   4                 2 2 4             2   3 4               2 3 4             2 2   5               3   5            3 4 2 2           3   2 3 2             2 3 3 2               4 3 2           3 2 4 2              2     4 2            2   2 4 2                  2 4 2                3 4 2           2     5 2                2 5 2            3   5 2                    5 2           4   3 3             3 4 3              2   4 3                  5 3             2   5 3          2 2 4 2 2               5 2 2             6 2 2          2 3 2 3 2              2 3 3 2         2   4 3 2            2 4 3 2          2 4 4 2              3   4 2          2 2 2 4 2            3 2 4 2          2 3 5 2            4 5 2          3   3 2   2            2 4 2   2              5 2   2          3 2   3   2             2   2 3   2          2   3 3   2                3 3   2              4 3   2             2 2 4   2           2       4   2               2   4   2          3 2 4   2                2 4   2          3   5   2               2 5   2          4 2 2 2 2          4   3 2 2            3   3 2 2             2 2 3 2 2         2 2 4 2 2             2   4 2 2                   4 2 2           2 2 4 2 2            2 5 2 2           2   5 2 2          3 2 2 2 3            2   3 2 3         2   4 2 3                4 2 3             5 2 3          3 3 3 3            2 2   3 3          2     2 3 3              2 2 3 3         3 3 3 3                3 3 3          2   2 4 3               3 4 3          3     4 3               2   4 3          4     2   3            3 2 2   3            2 3 2   3             3   3   3          2 2   3   3             2     3   3               2 3   3          2 3 3   3          3   4   3                   4   3            2   4   3           2     4   3          5 2 2 3             3 3 2 3           2   4 2 3          4 2 2 4            3     2 4          2 2 2 2 4            2   2 2 4                3 2 4         2 4 2 4          2 2   3 4            2 2 3 4          3     3 4                    3 4            2 2 3 4           2   2 3 4          4 4 4             2   4 4           2 2 4 4            4 2   4            3   2   4               2 3   4           2     3   4           2   4   4          2 3 2 5            3   2 5              2   2 5          2   2 2 5            2   3 5           2     3 5           2     3 5          2 2 2 6          3 3 6         2   6                  7                8               2 2 4 2                   5 2            2 6 2                 6 2             2 3 2 3                 2 3 3             2   4 3               2 4 3             2 4 4                 3   4             2 2 2 4                3 2 4             2 3 5                4 5            3 5   2           3   3 2 2             2 4 2 2               5 2 2           3 2   3 2             2   2 3 2            2   3 3 2                  3 3 2                4 3 2              2 2 4 2            2       4 2                2   4 2            3 2 4 2                  2 4 2            3   5 2                2 5 2           4 2 2 3           4   3 3             3   3 3              2 2 3 3           2 2 4 3              2   4 3                    4 3            2 2 4 3             2   5 3          2 2 5                    6                  7               2 3 3 2                 2 4 2            2   5 2               2 5 2             2 4   3                 3 2 3             2 2 3 3               3 3 3             2 3   4               4   4             3   4                   2 5                     6                  3 2 2 2                  2   3 2               2   4 2                     4 2                   5 2                3 3 3                 2 2   3                2     2 3                    2 2 3               3 3 3                      3 3               2   2 4                    3 4               3     4                   2   4               4 3   2              4     2 2               3 2 2 2               2 3 2 2                3   3 2              2 2   3 2                2     3 2                    2 3 2              2 3 3 2              3   4 2                       4 2               2   4 2              2     4 2             5 2 3                3 3 3               2   4 3             3 2 3   2             2   4   2          2   5   2                 5   2              6   2           3 3   2 2              2 2 2 2 2           2     3 2 2               2 3 2 2          3 4 2 2                 4 2 2             2 3 3 2            2   2   3 2                3   3 2           3   2 3 2                2 2 3 2           3 2 4 2                3 4 2           4   2     2             3 3     2             2 4     2            4 2 2   2             3     2   2            2 2 2 2   2             2   2 2   2                3 2   2            2 4 2   2            2 2   3   2              2 2 3   2            3     3   2                      3   2              2 2 3   2             2   2 3   2            4 4   2              2   4   2            2 2 4   2           5     2 2              4 2 2 2              3   2 2 2                 2 3 2 2            2     3 2 2             2   4 2 2           4 2     3             3   2   3           2 2 3   3             2   3   3                 4   3          2 5   3             3 2 2 3            2 2     2 3             2 2   2 3           3   2 2 3                    2 2 3             2 3 2 3            2   3 2 3           3     3 3                 2 3 3           4   3 3              2     3 3            2 2   3 3             4       3             3 2     3           2 3 2   3              3   2   3                2   2   3            2   2 2   3              2   3   3             2     3   3            2     3   3           2 3     4             3       4               2 2   4           2   3   4           3 2 2 4               2   2 4              2     2 4            2       2 4            2   2 2 4             3 3 4            2     3 4            2 2 2   4            3 3   4           2 2     5           2     2 5            3   2 5          2 3 4   2             2 5   2           2 6   2          2 4 2 2 2              3 3 2 2         2 2 4 2 2            3 4 2 2          2 5 3 2              4   3 2          2 3 2 3 2            4 2 3 2          2 4 4 2            5 4 2         3   5   2           2 6   2             7   2          3 2 3     2            2   4     2          2   5     2                5     2              6     2          3 3   2   2             2 2 2 2   2          2     3 2   2               2 3 2   2          3 4 2   2                4 2   2            2 3 3   2          2   2   3   2               3   3   2          3   2 3   2               2 2 3   2          3 2 4   2               3 4   2         4 4 2 2           4   2   2 2             3 3   2 2             2 4   2 2         4 2 2 2 2             3     2 2 2           2 2 2 2 2 2             2   2 2 2 2                 3 2 2 2           2 4 2 2 2          2 2   3 2 2             2 2 3 2 2           3     3 2 2                      3 2 2             2 2 3 2 2           2   2 3 2 2           4 4 2 2             2   4 2 2           2 2 4 2 2           5     3 2            4 2 3 2              3   2 3 2               2 3 3 2            2     3 3 2            2   4 3 2         3 2 4   2           2   5   2               6   2          3 3 2     2            2 2 3     2          2     4     2              2 4     2                5     2          3 4 2   2             2 3   2   2           2   2 2 2   2               3 2 2   2          3   3 2   2              2 3 2   2          2   3 3   2               4 3   2          3 2   3   2               3   3   2          4   3     2            3 4     2            2 5     2           4 2         2             3   2       2          2 2 3       2           2   3       2                4       2          2 5       2             3 2 2     2           2 2     2     2             2 2   2     2           3   2 2     2                   2 2     2             2 3 2     2           2   3 2     2          3     3     2                 2 3     2           4   3     2              2     3     2          2 2   3     2          5 2 2   2          5     2   2             4     2   2             3 2   2   2          2 3 2 2   2             3   2 2   2                2   2 2   2            2   2 2 2   2             2   3 2   2           2     3 2   2           2     3 2   2          4 2 2 2 2            3   3 2 2         2 2 4 2 2            2   4 2 2               5 2 2          4 3   2 2             3 2     2 2           2 2   2   2 2             2 2 2   2 2          3   3   2 2                   3   2 2            2 4   2 2          2   4   2 2          2 2 2 2 2 2             2 3 2 2 2           3       2 2 2                 2   2 2 2          4 2 2 2 2             2   2 2 2 2           2 2 2 2 2 2          4   3 2 2             2 2 3 2 2           2 3 3 2 2          5       2 2            4 2   2 2            3 3   2 2            4       2 2          2 3       2 2             3         2 2              2 2     2 2          2   3     2 2           3 2 2   2 2               2   2   2 2             2     2   2 2            2       2   2 2           2   2 2   2 2             3 3   2 2           2     3   2 2          6 2 2 2             4   2 2 2           2 2 2 2 2 2            3 3 2 2 2          5 2 3 2            4     3 2          2 3 2 3 2            3   2 3 2              2 3 3 2         2   4 3 2          2 3     3 2            3 2   3 2          3 2     3 2              2       3 2             2   2   3 2          2     2   3 2          2   3   3 2          4   2 3 2             2     2 3 2          2   2 2 3 2            3   2 3 2           2       2 3 2            5   3 2            4     3 2               3     3 2           2 2       3 2           2     2   3 2            3   2   3 2          2 4 4 2            4   4 2              3   4 2          2 2 2 4 2             2 2   4 2           2 2     4 2           2         4 2          3 2   4 2         2 2 2 4 2          3   2 4 2          2 3 5 2          3     5 2         3 3 3 3           2 2 4 3             2 5 3          3 4     3            2 3 2   3          2   2 3   3              3 3   3              2 4   3            2 4 2 3          2   3   2 3               4   2 3          3 2 2 2 3              3 2 2 3          3 3 3 3               4 3 3          4 2 2   3            3   3   3          2 2 4   3            2   4   3                5   3         2 6   3          4 3     3             3 2       3           2 2   2     3             2 2 2     3          3   3     3                   3     3            2 4     3           2   4     3           2 2 2 2   3             2 3 2   3           3       2   3                  2   2   3          4 2 2   3             2   2 2   3           2 2 2 2   3           4   3   3             2 2 3   3           2 3 3   3           5     2 3             4 2 2 3            3 3 2 3             4     2 3           2 3     2 3             3       2 3                2 2   2 3           2   3   2 3           3 2 2 2 3               2   2 2 3            2     2 2 3           2       2 2 3           2   2 2 2 3             3 3 2 3           2     3 2 3          6 3 3             4   3 3            2 2 2 3 3            3 3 3 3          4 3     3            3 2 2   3          2 2   3   3            2 2 3   3                  4   3         2   5   3            3 3     3           2 2 2       3             2 3       3          3     2     3                 2 2     3            2   3     3           2 2 3     3          3   2 2   3                3 2   3          4     2   3            2 2   2   3           2 3   2   3          5 2     3            4         3          2 3 2     3           3   2     3              2 3     3          2   4     3          2 3         3             3 2       3           3 2         3               2           3             2   2       3           2     2       3           2   3       3           4   2     3             2     2     3           2   2 2     3             3   2     3            2       2     3             5 2   3             4   2   3                3   2   3           2 2     2   3           2     2 2   3            3   2 2   3            4 2 2 3          2 3     2 3            3 2   2 3          3 2 2 2 3               2   2 2 3            2   3 2 3          2     3 2 3         2   4 2 3          3 2     2 3               2 2   2 3          4       2 3            2         2 3           2   2     2 3            3 2   2 3          2     2   2 3          5 2 2 3            3   2 2 3          2   2 2 2 3          2 4   2 3             4     2 3               3     2 3           2 2 2   2 3             2 2     2 3            2 2       2 3           2           2 3           3 2     2 3           2 2 2   2 3           3   2   2 3          3 3 3 3               3   3 3            2 2   3 3          2 2     3 3          2     2 3 3         3 3 3 3             3     3 3           2         3 3          2 2     3 3          3       3 3           2 3   3 3           3       3 3          2   2 4 3          3     4 3          3     4 3          4 4 4            3 3   4          2 2 2 2 4            2 3 2 4                2 3 4         2 2 4 4          2 2 3   4             2 4   4          3   2     4                3     4            2 2 2   4           2 3 2   4          4 2 2 4            2 3 2 4           2 4 2 4             4 2   4           2 3       4            3 2     4          3 2 2   4              2   2   4            2   3   4           2     3   4          2   4   4           3 2       4               2 2     4          4         4            2           4          2   2       4             3 2     4           2     2     4          5 2   4             3   2   4           2   2 2   4           2 4 2 4             4   2 4               3   2 4           2 2 2 2 4             2 2   2 4            2 2     2 4           2         2 4           3 2   2 4           2 2 2 2 4            3   2 2 4          2 3 2   4            3 3   4          3 2       4               2 2     4            2     2   4           2   2 2   4          2     3   4            2   2     4           2   3     4            3         4           2   2       4           3 3     4               3       4             2 2       4           2 2         4           2     2     4          3 3     4             3         4            2             4           2 2         4           3           4           2 3 2   4            3     2   4          4 2 2 4             2 2   2 4         2 2 2 2 4            3     2 4           2         2 4          2 2 2 2 4          3   2 2 4            4   2 4           2 2     2 4          3 2   2 4           2   2   2 4           3       2 4           3       2 4          2 2   3 4          3     3 4          3     3 4          4 4 4          3 2 2 5              2 3 5            2   2   5           2   3   5          2   2 2 5            3 2   5           2   3   5          4 2   5             2 2     5          2 2 2   5            3       5           2           5          2 2 2   5          3   2   5             4     5           2 2       5           2   2 2 5            3     2 5            3     2 5          2     2   5          2 2       5           3 2     5           2 2       5           3         5           3         5          2 3 2 5          3     2 5           4   2 5          2 2 2 6          3 3 6          2 3   6           3       6           4 2 6         2   7                8              9             2 2 5                     6              2 7                   7               2 3 3 2                 2 4 2             2   5 2                2 5 2             2 4   3                 3 2 3             2 2 3 3                3 3 3             2 3   4                4   4            3 6 2           3   4   2             2 5   2               6   2            3 2 2 2 2             2   3 2 2            2   4 2 2                  4 2 2                5 2 2            3 3 3 2              2 2   3 2            2     2 3 2                 2 2 3 2           3 3 3 2                  3 3 2            2   2 4 2                3 4 2            3     4 2                 2   4 2           4 3   3            4     2 3              3 2 2 3              2 3 2 3              3   3 3             2 2   3 3               2     3 3                  2 3 3            2 3 3 3            3   4 3                     4 3             2     4 3            5 2 4               3 3 4             2   4 4          2 2 6                  7                8             2 3 4                   2 5              2   6                 2 6               2 4 2 2                 3 3 2             2 2 4 2               3 4 2             2 5 3                 4   3             2 3 2 3                4 2 3             2 4 4                5 4             3   5                 2 6                   7               3 2 3                   2   4                 2   5                       5                     6                  3 3   2                 2 2 2 2              2     3 2                    2 3 2               3 4 2                      4 2                  2 3 3                2   2   3                    3   3              3   2 3                    2 2 3                3 2 4                     3 4               4 4 2              4   2   2                3 3   2                2 4   2              4 2 2 2                3     2 2              2 2 2 2 2                 2   2 2 2                    3 2 2              2 4 2 2              2 2   3 2                 2 2 3 2              3     3 2                         3 2                2 2 3 2              2   2 3 2              4 4 2                 2   4 2               2 2 4 2              5     3                4 2 3                 3   2 3                   2 3 3               2     3 3               2   4 3             3 2 4 2             2   5 2          2   6 2                 6 2              7 2           3 3 2   2             2 2 3   2           2     4   2               2 4   2          3 5   2                 5   2           3 4 2 2             2 3   2 2            2   2 2 2 2                3 2 2 2           3   3 2 2                2 3 2 2           2   3 3 2                4 3 2           3 2   3 2                3   3 2           4   3   2             3 4   2              2 5   2            4 2       2              3   2     2            2 2 3     2              2   3     2                  4     2            2 5     2              3 2 2   2            2 2     2   2               2 2   2   2            3   2 2   2                    2 2   2              2 3 2   2            2   3 2   2            3     3   2                   2 3   2           4   3   2              2     3   2             2 2   3   2           5 2 2 2            5     2 2              4     2 2               3 2   2 2            2 3 2 2 2               3   2 2 2                 2   2 2 2             2   2 2 2 2              2   3 2 2             2     3 2 2            2     3 2 2           4 2 2 3             3   3 3           2 2 4 3             2   4 3                 5 3          2 6 3            4 3   3              3 2     3            2 2   2   3              2 2 2   3           3   3   3                    3   3             2 4   3            2   4   3            2 2 2 2 3              2 3 2 3            3       2 3                   2   2 3           4 2 2 3              2   2 2 3            2 2 2 2 3           4   3 3              2 2 3 3            2 3 3 3           5       3              4 2   3              3 3   3              4       3            2 3       3              3         3                2 2     3            2   3     3            3 2 2   3                 2   2   3              2     2   3             2       2   3            2   2 2   3             3 3   3            2     3   3           6 2 3              4   2 3             2 2 2 2 3             3 3 2 3           5 2 4             4     4           2 3 2 4              3   2 4               2 3 4           2   4 4            2 3     4              3 2   4            3 2     4               2       4             2   2   4            2     2   4            2   3   4            4   2 4              2     2 4            2   2 2 4             3   2 4           2       2 4              5   4              4     4                 3     4             2 2       4             2     2   4           2 4 5              4   5               3   5           2 2 2 5              2 2   5            2 2     5            2         5           3 2   5           2 2 2 5           2 3 6            3     6          2 3 5                2 6              2 7             2 4 3                   3 4              2 2 5                 3 5               2 5   2                 4 2 2             2 3 3 2               4 3 2             2 4   3               5   3             3 2 4                 2   5               2   6                     6                   7              3 3 2                  2 2 3                 2     4                      2 4                 3 5                       5                  3 4 2                  2 3   2               2   2 2 2                    3 2 2               3   3 2                    2 3 2                2   3 3                     4 3                3 2   3                    3   3                4   3 2                3 4 2                2 5 2              4 2     2                3   2   2              2 2 3   2                2   3   2                    4   2              2 5   2                 3 2 2 2               2 2     2 2                 2 2   2 2               3   2 2 2                       2 2 2                2 3 2 2              2   3 2 2               3     3 2                     2 3 2              4   3 2                 2     3 2              2 2   3 2             5 2 3              5     3                4     3                3 2   3              2 3 2 3                 3   2 3                   2   2 3              2   2 2 3               2     3 3               2     3 3             3 3 3                 2 2 4               2     5                   2 5                     6               3 4                      2 3 2                  2   2 3                      3 3                 3   4                     2 4                   2 4 2               2   3   2                   4   2                3 2 2 2                    3 2 2                3 3 3                    4 3               4 2 2                    3   3                 2 2 4                    2   4                       5                 2 6                  4 3                      3 2                      2 2   2                      2 2 2                    3   3                             3                      2 4                    2   4                    2 2 2 2                     2 3 2                  3       2                         2   2                 4 2 2                    2   2 2                  2 2 2 2                  4   3                     2 2 3                  2 3 3                  5     2                  4 2 2                  3 3 2                   4     2                 2 3     2                   3       2                     2 2   2               2   3   2                3 2 2 2                     2   2 2                   2     2 2                 2       2 2                 2   2 2 2                  3 3 2                 2     3 2                6 3                   4   3                 2 2 2 3                 3 3 3                4 3   2                3 2 2 2             2 2   3 2                2 2 3 2             3   4 2                     4 2               2 5 2             2   5 2               3 3   2              2 2 2     2                 2 3     2              3     2   2                    2 2   2             4 3   2              2   3   2              2 2 3   2              3   2 2 2                    3 2 2              4     2 2                2 2   2 2             2 3   2 2              5 2   2               4       2              2 3 2   2                3   2   2                  2 3   2              2   4   2              2 3       2                 3 2     2               3 2       2                   2         2                2   2     2               2     2     2              2   3     2              4   2   2                 2     2   2               2   2 2   2                3   2   2               2       2   2                5 2 2                 4   2 2                   3   2 2               2 2     2 2               2     2 2 2               3   2 2 2                4 2 3              2 3     3                3 2   3             3 2 2 3                  2   2 3               2   3 3              2     3 3             2   4 3             3 2     3                  2 2   3             4       3                2         3               2   2     3              3 2   3              2     2   3             5 2 3                3   2 3              2   2 2 3              2 4   3                 4     3                  3     3               2 2 2   3                 2 2     3               2 2       3               2           3              3 2     3              2 2 2   3              3 3 4                  3   4                2 2   4              2 2     4              2     2 4             3 3 4                3     4               2         4              2 2     4              3       4              2 3   4               3       4              2   2 5              3     5              3     5             3 4 2 2             2 3 3 2           2   2 4 2               3 4 2               2 5 2           3 5   2              2 4     2            2   3 2   2               4 2   2           3 2 3   2               3 3   2            2   4 2 2                5 2 2           3 3   2 2                4   2 2           4 3     2              3 2 2   2            2 2   3   2              2 2 3   2           3   4   2                    4   2              2 5   2            2   5   2              3 3     2            2 2 2       2              2 3       2            3     2     2                  2 2     2           4 3     2              2   3     2            2 2 3     2            3   2 2   2                   3 2   2            4     2   2               2 2   2   2             2 3   2   2           5 2 2 2             4     2 2            2 3 2 2 2              3   2 2 2                2 3 2 2            2   4 2 2            2 3     2 2              3 2   2 2           3 2     2 2                 2       2 2              2   2   2 2             2     2   2 2            2   3   2 2            4   2 2 2               2     2 2 2             2   2 2 2 2               3   2 2 2             2       2 2 2             2 2     3 2             2     2 3 2              3   2 3 2            4 4   2              3 3     2            2 2 2 2   2              2 3 2   2           3     3   2                2 3   2             2   4   2            2 2 4   2            2 2 3     2              2 4     2           3   2       2                  3       2           4   2     2             2 2 2     2             2 3 2     2            4 2 2   2              2 3 2   2            2 4 2   2              4 2     2             2 3         2              3 2       2            3 2 2     2                2   2     2              2   3     2            2     3     2            2   4     2            3 2         2                 2 2       2           4           2               2             2             2   2         2              3 2       2             2     2       2            5 2     2               3   2     2             2   2 2     2            2 4 2   2               4   2   2                 3   2   2             2 2 2 2   2               2 2   2   2             2 2     2   2             2         2   2            3 2   2   2             2 2 2 2   2             3   2 2   2            2 3 2 2 2              3 3 2 2           3 2     2 2                2 2   2 2           4   2 2 2             2     2 2 2            2   2 2 2 2             3 3 2 2           2     3 2 2           4       2 2              2   2   2 2            2   3   2 2           5     2 2              3       2 2             2   2     2 2            3 3   2 2                 3     2 2               2 2     2 2             2 2       2 2             2     2   2 2            3 3   2 2               3       2 2             2           2 2             2 2       2 2             3         2 2             2 3 2 2 2             3     2 2 2           4 2 3 2              2 2   3 2            2 2 2 3 2              3     3 2            2         3 2            2 2 2 3 2            3   2 3 2              4   3 2             2 2     3 2            3 2   3 2             2   2   3 2             3       3 2             3       3 2            2 2   4 2            3     4 2            3     4 2            4 5 2             3 4 3           2 2 3   3             2 4   3           3   2 2 3                3 2 3             2 2 3 3           2 3 3 3            3   3   3                  4   3           4 2     3              2 3     3            2 4     3            2 3 2   3             3 3   3            3 2       3                2 2     3            4   2   3              2     2   3            2   2 2   3              3 3   3            2     3   3            4         3               2   2     3            2   3     3           5       3              3         3             2   2       3            3 3 2 3                3   2 3               2 2   2 3            2 2     2 3            2     2 2 3            3 3 2 3              3     2 3             2         2 3            2 2     2 3             3       2 3             2 3 3 3             3     3 3           3 2 2   3                2 3   3           4         3              2   2     3            2   3     3             3   2   3            2   2 2   3              3 2     3             2   3     3            4 2     3               2 2       3            2 2 2     3              3         3             2             3             2 2 2     3            3   2     3               4       3             2 2         3             2   2 2   3             3     2   3             3     2   3           5   2 3              3     2 3            2     2 2 3             4   2 3            2 2     2 3             3 2   2 3             2 2     2 3             3       2 3             3       2 3            2 3 3 3            3     3 3             4   3 3           4   2 4              2   3 4            2   4 4             3 2   4            2   3   4            5     4               3       4             2     2   4              4     4             2 2       4             2 2   2 4             3     2 4             3     2 4            2 2 2   4            3 3   4            2 3     4             3         4             4 2   4          2 4 4 2             3 5 2           3 6 2          2 5 2   2              4 3   2         2 3 4   2            4 4   2          2 6 2 2              5   2 2          2 4 2 2 2            5 2 2 2          2 5 3 2            6 3 2          3 3 3   2             2 2 4   2          2     5   2               2 5   2         3 6   2                6   2           3 4       2             2 3 2     2          2   2 3     2               3 3     2          3   4     2               2 4     2             2 4 2   2           2   3   2   2                4   2   2           3 2 2 2   2                3 2 2   2           3 3 3   2               4 3   2           4 2 2 2 2             3   3 2 2           2 2 4 2 2             2   4 2 2                 5 2 2           2 6 2 2           4 3   2 2             3 2     2 2            2 2   2   2 2              2 2 2   2 2           3   3   2 2                  3   2 2             2 4   2 2           2   4   2 2           2 2 2 2 2 2              2 3 2 2 2           3       2 2 2                  2   2 2 2           4 2 2 2 2              2   2 2 2 2           2 2 2 2 2 2           4   3 2 2              2 2 3 2 2            2 3 3 2 2            5     3 2             4 2 3 2             3 3 3 2              4     3 2            2 3     3 2              3       3 2               2 2   3 2           2   3   3 2            3 2 2 3 2                2   2 3 2              2     2 3 2            2       2 3 2            2   2 2 3 2              3 3 3 2            2     3 3 2           6 4 2              4   4 2             2 2 2 4 2            3 3 4 2           3 4 2   2             2 3 3   2          2   2 4   2               3 4   2         3   5   2              2 5   2           3 5     2             2 4       2          2   3 2     2               4 2     2          3 2 3     2               3 3     2           2   4 2   2               5 2   2          3 3   2   2               4   2   2           4 3       2              3 2 2     2           2 2   3     2             2 2 3     2           3   4     2                   4     2             2 5     2           2   5     2              3 3       2            2 2 2         2              2 3         2           3     2       2                  2 2       2           4 3       2             2   3       2           2 2 3       2            3   2 2     2                  3 2     2           4     2     2              2 2   2     2           2 3   2     2           5 2 2   2             4     2   2           2 3 2 2   2             3   2 2   2               2 3 2   2           2   4 2   2           2 3     2   2              3 2   2   2           3 2     2   2                2       2   2              2   2   2   2            2     2   2   2            2   3   2   2            4   2 2   2              2     2 2   2            2   2 2 2   2             3   2 2   2            2       2 2   2              5 3   2              4   3   2                3   3   2            2 2     3   2            2     2 3   2            3   2 3   2           4 4 2 2             3 3   2 2           2 2 2 2 2 2             2 3 2 2 2           3     3 2 2                 2 3 2 2         4 4 2 2             2   4 2 2           2 2 4 2 2          2 2 3   2 2             2 4   2 2           3   2     2 2                  3     2 2           4   2   2 2             2 2 2   2 2           2 3 2   2 2         4 2 2 2 2             2 3 2 2 2           2 4 2 2 2             4 2   2 2          2 3       2 2              3 2     2 2           3 2 2   2 2               2   2   2 2             2   3   2 2           2     3   2 2           2   4   2 2           3 2       2 2                2 2     2 2          4         2 2              2           2 2            2   2       2 2             3 2     2 2            2     2     2 2          5 2   2 2             3   2   2 2            2   2 2   2 2           2 4 2 2 2              4   2 2 2               3   2 2 2           2 2 2 2 2 2              2 2   2 2 2            2 2     2 2 2            2         2 2 2            3 2   2 2 2           2 2 2 2 2 2            3   2 2 2 2           2 3 2 3 2             3 3 3 2           3 2     3 2              2 2   3 2           4   2 3 2              2     2 3 2           2   2 2 3 2            3 3 3 2           2     3 3 2           4       3 2             2   2   3 2           2   3   3 2           5     3 2             3       3 2           2   2     3 2           3 3   3 2               3     3 2              2 2     3 2           2 2       3 2           2     2   3 2           3 3   3 2             3       3 2            2           3 2           2 2       3 2            3         3 2            2 3 2 3 2            3     2 3 2           4 2 4 2             2 2   4 2           2 2 2 4 2             3     4 2           2         4 2           2 2 2 4 2           3   2 4 2             4   4 2            2 2     4 2            3 2   4 2            2   2   4 2            3       4 2            3       4 2           2 2   5 2            3     5 2            3     5 2           4 6 2           3 5     2             2 4 2   2          2   3 3   2               4 3   2         3 2 4   2              3 4   2            2 5     2           2   4       2               5       2          3 3 2     2               4 2     2          3 4 2   2               5 2   2           4 4     2             3 3       2           2 2 2 2     2             2 3 2     2           3     3     2                 2 3     2          4 4     2             2   4     2           2 2 4     2           2 2 3       2              2 4       2           3   2         2                  3         2           4   2       2              2 2 2       2           2 3 2       2           4 2 2     2              2 3 2     2            2 4 2     2              4 2 2   2           2 3     2   2             3 2   2   2           3 2 2 2   2                2   2 2   2             2   3 2   2            2     3 2   2           2   4 2   2           3 2     2   2                2 2   2   2           4       2   2              2         2   2            2   2     2   2             3 2   2   2            2     2   2   2           5 2 2   2              3   2 2   2            2   2 2 2   2            2 4 3   2              4   3   2                3   3   2            2 2 2 3   2              2 2   3   2            2 2     3   2            2         3   2             3 2   3   2            2 2 2 3   2            3   2 3   2             3 4     2           2 2 3       2            2 4       2          3   2 2     2                 3 2     2          4   3     2            2 2 3     2           2 3 3     2           3   3       2                  4       2           4 2         2             2 3         2           2 4         2           2 3 2       2             3 3       2            3 2           2                2 2         2           4   2       2              2     2       2            2   2 2       2             3 3       2          2     3       2            4             2              2   2         2            2   3         2           5           2              3             2            2   2           2           3 3 2     2                3   2     2              2 2   2     2            2 2     2     2            2     2 2     2           3 3 2     2              3     2     2             2         2     2            2 2     2     2            3       2     2            2 3 3     2             3     3     2          3 2 2 2   2               2 3 2   2           4       2   2              2   2   2   2           2   3   2   2          5 2 2   2             3   2 2   2            2   2 2 2   2          5     2   2             3 2   2   2           2   3   2   2           4 2   2   2              2 2     2   2            2 2 2   2   2              3       2   2            2           2   2            2 2 2   2   2           3   2   2   2              4     2   2            2 2       2   2            3 2     2   2            2   2 2 2   2            3     2 2   2            3     2 2   2           5   3   2              3     3   2           2     2 3   2             4   3   2           2 2     3   2            3 2   3   2            2 2     3   2            3       3   2            3       3   2           2 3 4   2            3     4   2            4   4   2         2 2 4 2 2            2 5 2 2          3   3   2 2                 4   2 2          4 2 2 2 2             2 3 2 2 2           2 4 2 2 2          4 3   2 2             2 4   2 2           2 5   2 2           3 2 2   2 2               2 3   2 2           4         2 2              2   2     2 2           2   3     2 2          5 2   2 2              3   2   2 2            2   2 2   2 2           5       2 2              3 2     2 2            2   3     2 2           4 2 2 2 2              2 2   2 2 2           2 2 2 2 2 2             3     2 2 2            2         2 2 2           2 2 2 2 2 2            3   2 2 2 2              4   2 2 2            2 2     2 2 2            3 2   2 2 2            2   2 3 2 2            3     3 2 2            3     3 2 2           4   2   2 2              2   3   2 2            2   4   2 2          5       2 2             3 2     2 2           2   3     2 2           5       2 2              3         2 2            2     2     2 2              4       2 2            2 2         2 2            3 2       2 2            2 2   2   2 2            3     2   2 2            3     2   2 2          6 2 2 2             4   2 2 2           2 2 2 2 2 2            3 3 2 2 2            2 3   2 2 2            3       2 2 2             4 2 2 2 2          5 2 3 2             3 3 3 2           2   4 3 2          6   3 2             4     3 2            2 2 2   3 2            3 3   3 2            2 3 2 3 2            3     2 3 2            4 3 3 2          3 6 3             2 5   3          2   4 2 3              5 2 3         3 3 3 3              4 3 3          2   5   3               6   3          3 4     3               5     3             3 4   3            2 2 3     3           3   2 2   3                 3 2   3          4   3   3             2 2 3   3           2 3 3   3           3   3     3                  4     3           4 2       3              2 3       3            2 4       3            2 3 2 2 3              3 3 2 3            3 2     2 3                2 2   2 3           4   2 2 3             2     2 2 3            2   2 2 2 3             3 3 2 3           2     3 2 3            4       2 3              2   2   2 3            2   3   2 3            5     2 3              3       2 3            2   2     2 3            3 3 3 3                3   3 3               2 2   3 3            2 2     3 3             2     2 3 3            3 3 3 3              3     3 3             2         3 3            2 2     3 3             3       3 3            2 3 4 3             3     4 3          2 2 4   3          3   3     3                 4     3          4 2 2   3             2 3 2   3           2 4 2   3          4 3     3             2 4     3            2 5     3           3 2 2     3           4           3              2   2       3            2   3       3          5 2     3             3   2     3           2   2 2     3           5         3              3 2       3            2   3       3            4 2 2   3              2 2   2   3            2 2 2 2   3              3     2   3            2         2   3            2 2 2 2   3             3   2 2   3              4   2   3            2 2     2   3            3 2   2   3            2   2 3   3             3     3   3             3     3   3          4   2 2 3             2   3 2 3            2   4 2 3           5     2 3              3 2   2 3            2   3   2 3            2     2   2 3            2 2       2 3             3 2     2 3            2 2   2 2 3            3     2 2 3            3     2 2 3          6 3 3             4   3 3            2 2 2 3 3            3 3 3 3            2 3   3 3            3       3 3            4 2 3 3          3   4   3                 5   3          4 3     3             2 4     3            2 5     3           4   2     3              2   3     3            2   4     3           5         3              3 2       3            2   3       3            5   2   3              3     2   3            2     2 2   3              4   2   3            2 2     2   3            3 2   2   3            2 2   3   3             3     3   3             3     3   3          5 2     3             3 3     3            2   4     3           6       3              4         3            2 2 2       3            3 3       3            2 3 2     3             3     2     3             4 3     3          4 4 4             2 5 4           2 6 4           5 2   4              3 3   4            2   4   4           6 2 4              4   2 4             2 2 2 2 4            3 3 2 4            2 3 3 4             3     3 4             4 4 4
o30 = 13824c d*e f g  - 13824b*c*e f g  + 13824a*e f g  - 110592c d e f g  + 110592b*c*d*e f g  + 13824b e f g  - 165888a*d*e f g  + 221184c d f g  - 221184b*c*d e*f g  - 110592b d*e f g  + 663552a*d e f g  + 221184b d f g  - 884736a*d f g  - 13824c e f g  + 497664c d*e*f g  - 414720b*c e f g  + 497664a*c*e f g  - 995328b*c d*f g  + 1327104b c*e*f g  - 1990656a*c*d*e*f g  - 995328a*b*e f g  - 884736b f g  + 3981312a*b*d*f g  - 373248c f g  + 2985984a*c f g  - 5971968a f g  - 13824c d*e f g*h + 13824b*c*e f g*h - 13824a*e f g*h + 110592c d e f g*h - 110592b*c*d*e f g*h - 13824b e f g*h + 165888a*d*e f g*h - 221184c d e*f g*h + 221184b*c*d e f g*h + 110592b d*e f g*h - 663552a*d e f g*h - 221184b d e*f g*h + 884736a*d e*f g*h + 13824c e f g h - 635904c d*e f g h + 566784b*c e f g h - 663552a*c*e f g h - 331776c d f g h + 1714176b*c d*e*f g h - 1935360b c*e f g h + 2322432a*c*d*e f g h + 1492992a*b*e f g h - 221184b c*d*f g h + 1327104a*c*d f g h + 1327104b e*f g h - 5971968a*b*d*e*f g h + 497664c e*f g h + 497664b*c f g h - 4976640a*c e*f g h - 1990656a*b*c*f g h + 11943936a e*f g h + 13824c d e f h  - 13824b*c*d*e f h  + 13824a*d*e f h  - 110592c d e f h  + 110592b*c*d e f h  + 13824b d*e f h  - 165888a*d e f h  + 221184c d f h  - 221184b*c*d e*f h  - 110592b d e f h  + 663552a*d e f h  + 221184b d f h  - 884736a*d f h  + 110592c d*e f g*h  - 138240b*c e f g*h  + 152064a*c*e f g*h  + 884736c d e*f g*h  - 1161216b*c d*e f g*h  + 566784b c*e f g*h  + 276480a*c*d*e f g*h  - 470016a*b*e f g*h  - 1105920b*c d f g*h  + 1714176b c*d*e*f g*h  - 3538944a*c*d e*f g*h  - 414720b e f g*h  + 774144a*b*d*e f g*h  - 995328b d*f g*h  + 4423680a*b*d f g*h  - 110592c e f g h  - 331776c d*f g h  - 718848b*c e*f g h  + 2239488a*c e f g h  - 27648b c f g h  + 3317760a*c d*f g h  + 2654208a*b*c*e*f g h  - 6967296a e f g h  + 331776a*b f g h  - 7962624a d*f g h  - 110592c d e f h  + 110592b*c d*e f h  + 13824b c*e f h  - 138240a*c*d*e f h  - 13824a*b*e f h  - 442368c d f h  + 884736b*c d e*f h  - 635904b c*d*e f h  + 110592a*c*d e f h  - 13824b e f h  + 608256a*b*d*e f h  - 331776b c*d f h  + 1769472a*c*d f h  + 497664b d*e*f h  - 2211840a*b*d e*f h  - 221184c d*e*f g*h  + 442368b*c e f g*h  - 552960a*c e f g*h  + 1105920b*c d*f g*h  - 718848b c e*f g*h  - 1105920a*c d*e*f g*h  - 55296a*b*c*e f g*h  + 995328a e f g*h  + 497664b c*f g*h  - 4423680a*b*c*d*f g*h  - 331776a*b e*f g*h  + 7962624a d*e*f g*h  + 221184c f g h  - 1880064a*c f g h  + 3981312a c*f g h  + 221184c d f h  - 221184b*c d*e*f h  - 110592b c e f h  + 442368a*c d*e f h  + 110592a*b*c*e f h  + 13824a e f h  - 331776b c d*f h  - 442368a*c d f h  + 497664b c*e*f h  + 221184a*b*c*d*e*f h  - 414720a*b e f h  - 1105920a d*e f h  - 373248b f h  + 1990656a*b d*f h  - 1769472a d f h  - 442368b*c f g*h  + 663552a*c e*f g*h  + 2433024a*b*c f g*h  - 2654208a c*e*f g*h  - 2654208a b*f g*h  + 221184b c f h  - 442368a*c d*f h  - 221184a*b*c e*f h  - 110592a c*e f h  - 995328a*b c*f h  + 1769472a c*d*f h  + 1327104a b*e*f h  + 221184a c f h  - 884736a f h  + 13824c d*e f*g*i - 13824b*c*e f*g*i + 13824a*e f*g*i - 138240c d e f g*i + 138240b*c*d*e f g*i + 13824b e f g*i - 193536a*d*e f g*i + 442368c d e f g*i - 442368b*c*d e f g*i - 138240b d*e f g*i + 995328a*d e f g*i - 442368c d f g*i + 442368b*c*d e*f g*i + 442368b d e f g*i - 2211840a*d e f g*i - 442368b d f g*i + 1769472a*d f g*i - 13824c e f*g i + 566784c d*e f g i - 456192b*c e f g i + 539136a*c*e f g i - 718848c d e*f g i - 691200b*c d*e f g i + 1603584b c*e f g i - 2820096a*c*d*e f g i - 1244160a*b*e f g i + 2101248b*c d f g i - 2433024b c*d*e*f g i + 2654208a*c*d e*f g i - 1105920b e f g i + 6967296a*b*d*e f g i + 1769472b d*f g i - 7962624a*b*d f g i - 414720c e f g i + 497664c d*f g i + 165888b*c e*f g i + 3234816a*c e f g i - 663552b c f g i - 4976640a*c d*f g i + 1990656a*b*c*e*f g i - 8957952a e f g i + 11943936a d*f g i - 13824c d e f*h*i + 13824b*c*d*e f*h*i - 13824a*d*e f*h*i + 110592c d e f h*i - 110592b*c*d e f h*i - 13824b d*e f h*i + 165888a*d e f h*i - 221184c d e*f h*i + 221184b*c*d e f h*i + 110592b d e f h*i - 663552a*d e f h*i - 221184b d e*f h*i + 884736a*d e*f h*i - 110592c d*e f*g*h*i + 138240b*c e f*g*h*i - 152064a*c*e f*g*h*i - 1161216c d e f g*h*i + 1631232b*c d*e f g*h*i - 774144b c*e f g*h*i - 552960a*c*d*e f g*h*i + 691200a*b*e f g*h*i + 1105920c d f g*h*i - 774144b*c d e*f g*h*i - 1105920b c*d*e f g*h*i + 5750784a*c*d e f g*h*i + 608256b e f g*h*i - 2543616a*b*d*e f g*h*i + 884736b c*d f g*h*i - 4423680a*c*d f g*h*i + 221184b d*e*f g*h*i - 884736a*b*d e*f g*h*i + 110592c e f*g h*i + 1714176c d*e*f g h*i - 691200b*c e f g h*i - 870912a*c e f g h*i - 3594240b*c d*f g h*i + 4368384b c e*f g h*i - 6137856a*c d*e*f g h*i - 7299072a*b*c*e f g h*i + 9455616a e f g h*i - 2211840b c*f g h*i + 13934592a*b*c*d*f g h*i - 663552a*b e*f g h*i - 1990656a d*e*f g h*i - 995328c f g h*i + 8460288a*c f g h*i - 17915904a c*f g h*i + 110592c d e f*h i - 110592b*c d*e f*h i - 13824b c*e f*h i + 138240a*c*d*e f*h i + 13824a*b*e f*h i + 884736c d e*f h i - 1492992b*c d e f h i + 787968b c*d*e f h i + 387072a*c*d e f h i + 13824b e f h i - 774144a*b*d*e f h i - 221184b*c d f h i + 1050624b c*d e*f h i - 3760128a*c*d e*f h i - 635904b d*e f h i + 2543616a*b*d e f h i - 331776b d f h i + 1327104a*b*d f h i + 221184c d*e f*g*h i - 442368b*c e f*g*h i + 552960a*c e f*g*h i - 1105920c d f g*h i - 774144b*c d*e*f g*h i + 1078272b c e f g*h i + 663552a*c d*e f g*h i - 27648a*b*c*e f g*h i - 1575936a e f g*h i + 1050624b c d*f g*h i + 3760128a*c d f g*h i - 3262464b c*e*f g*h i + 8736768a*b*c*d*e*f g*h i + 3179520a*b e f g*h i - 12275712a d*e f g*h i + 1990656b f g*h i - 9400320a*b d*f g*h i + 2654208a d f g*h i - 221184c e*f*g h i + 2101248b*c f g h i - 1161216a*c e*f g h i - 11778048a*b*c f g h i + 7962624a c*e*f g h i + 13934592a b*f g h i - 221184c d e*f*h i + 221184b*c d*e f*h i + 110592b c e f*h i - 442368a*c d*e f*h i - 110592a*b*c*e f*h i - 13824a e f*h i - 221184b*c d f h i + 1050624b c d*e*f h i - 221184a*c d e*f h i - 635904b c*e f h i - 1105920a*b*c*d*e f h i + 566784a*b e f h i + 1603584a d*e f h i - 165888b c*d*f h i + 221184a*b*c*d f h i + 497664b e*f h i - 3262464a*b d*e*f h i + 5750784a d e*f h i + 442368b*c e*f*g*h i - 663552a*c e f*g*h i - 774144b c f g*h i + 2654208a*c d*f g*h i - 2985984a*b*c e*f g*h i + 4810752a c*e f g*h i + 5031936a*b c*f g*h i - 10616832a c*d*f g*h i - 3317760a b*e*f g*h i - 221184b c e*f*h i + 442368a*c d*e*f*h i + 221184a*b*c e f*h i + 110592a c*e f*h i - 331776b c f h i + 884736a*b*c d*f h i + 1714176a*b c*e*f h i - 2433024a c*d*e*f h i - 1935360a b*e f h i + 497664a*b f h i - 2211840a b*d*f h i - 1990656a c f g*h i + 7962624a f g*h i - 221184a c e*f*h i - 221184a b*c*f h i + 1327104a e*f h i + 13824c d e f*i  - 13824b*c*d e f*i  + 13824a*d e f*i  - 110592c d e f i  + 110592b*c*d e f i  + 13824b d e f i  - 165888a*d e f i  + 221184c d f i  - 221184b*c*d e*f i  - 110592b d e f i  + 663552a*d e f i  + 221184b d f i  - 884736a*d f i  - 13824c d*e g*i  + 13824b*c e g*i  - 13824a*c*e g*i  + 566784c d e f*g*i  - 774144b*c d*e f*g*i  + 165888b c*e f*g*i  + 691200a*c*d*e f*g*i  - 193536a*b*e f*g*i  - 718848c d e*f g*i  + 1078272b*c d e f g*i  + 387072b c*d*e f g*i  - 3373056a*c*d e f g*i  - 165888b e f g*i  + 940032a*b*d*e f g*i  - 774144b*c d f g*i  - 221184b c*d e*f g*i  + 3317760a*c*d e*f g*i  + 110592b d*e f g*i  - 1216512a*b*d e f g*i  - 442368b d f g*i  + 2211840a*b*d f g*i  + 13824c e g i  - 1935360c d*e f*g i  + 1603584b*c e f*g i  - 1575936a*c e f*g i  - 27648c d f g i  + 4368384b*c d*e*f g i  - 6303744b c e f g i  + 7713792a*c d*e f g i  + 6635520a*b*c*e f g i  - 2861568a e f g i  - 774144b c d*f g i  + 1658880a*c d f g i  + 5750784b c*e*f g i  - 21897216a*b*c*d*e*f g i  - 1658880a*b e f g i  + 3981312a d*e f g i  - 1769472b f g i  + 7962624a*b d*f g i  - 5971968a d f g i  + 1327104c e*f*g i  - 663552b*c f g i  - 10948608a*c e*f g i  + 4976640a*b*c f g i  + 23887872a c*e*f g i  - 11943936a b*f g i  + 13824c d e h*i  - 13824b*c d*e h*i  + 13824a*c*d*e h*i  - 635904c d e f*h*i  + 787968b*c d e f*h*i  - 110592b c*d*e f*h*i  - 774144a*c*d e f*h*i  + 138240a*b*d*e f*h*i  - 331776c d f h*i  + 1050624b*c d e*f h*i  - 1492992b c*d e f h*i  + 2543616a*c*d e f h*i  + 110592b d*e f h*i  + 387072a*b*d e f h*i  - 221184b c*d f h*i  + 1327104a*c*d f h*i  + 884736b d e*f h*i  - 3760128a*b*d e*f h*i  + 110592c d*e g*h*i  - 138240b*c e g*h*i  + 152064a*c e g*h*i  + 1714176c d e*f*g*h*i  - 1105920b*c d*e f*g*h*i  + 387072b c e f*g*h*i  - 27648a*c d*e f*g*h*i  - 552960a*b*c*e f*g*h*i  + 539136a e f*g*h*i  + 1050624b*c d f g*h*i  - 1658880b c d*e*f g*h*i  - 7962624a*c d e*f g*h*i  + 2543616b c*e f g*h*i  - 1990656a*b*c*d*e f g*h*i  - 3373056a*b e f g*h*i  + 6635520a d*e f g*h*i  + 221184b c*d*f g*h*i  - 2433024a*b*c*d f g*h*i  - 2211840b e*f g*h*i  + 10838016a*b d*e*f g*h*i  + 663552a d e*f g*h*i  - 110592c e g h*i  - 221184c d*f*g h*i  - 2433024b*c e*f*g h*i  + 4810752a*c e f*g h*i  - 774144b c f g h*i  - 1161216a*c d*f g h*i  + 19408896a*b*c e*f g h*i  - 25380864a c*e f g h*i  - 3317760a*b c*f g h*i  + 7962624a c*d*f g h*i  - 9953280a b*e*f g h*i  - 110592c d e h i  + 110592b*c d*e h i  + 13824b c e h i  - 138240a*c d*e h i  - 13824a*b*c*e h i  - 331776c d f*h i  + 1050624b*c d e*f*h i  - 1492992b c d*e f*h i  + 1078272a*c d e f*h i  + 110592b c*e f*h i  + 1631232a*b*c*d*e f*h i  - 138240a*b e f*h i  - 456192a d*e f*h i  - 912384b c d f h i  + 2211840a*c d f h i  + 1050624b c*d*e*f h i  - 1658880a*b*c*d e*f h i  - 110592b e f h i  + 1078272a*b d*e f h i  - 6303744a d e f h i  - 331776b d*f h i  + 2211840a*b d f h i  - 3317760a d f h i  - 221184c d*e*g*h i  + 442368b*c e g*h i  - 552960a*c e g*h i  + 884736b*c d*f*g*h i  - 221184b c e*f*g*h i  - 2985984a*c d*e*f*g*h i  + 663552a*b*c e f*g*h i  - 870912a c*e f*g*h i  + 2211840b c f g*h i  - 7630848a*b*c d*f g*h i  - 7962624a*b c*e*f g*h i  + 19408896a c*d*e*f g*h i  + 7713792a b*e f g*h i  - 2543616a*b f g*h i  + 8957952a b*d*f g*h i  + 221184c g h i  - 1990656a*c f*g h i  + 9704448a c f g h i  - 20901888a f g h i  + 221184c d h i  - 221184b*c d*e*h i  - 110592b c e h i  + 442368a*c d*e h i  + 110592a*b*c e h i  + 13824a c*e h i  - 221184b c d*f*h i  - 774144a*c d f*h i  + 884736b c e*f*h i  - 774144a*b*c d*e*f*h i  - 1161216a*b c*e f*h i  - 691200a c*d*e f*h i  + 566784a b*e f*h i  - 331776b c*f h i  + 1050624a*b c*d*f h i  - 774144a c*d f h i  - 718848a*b e*f h i  + 4368384a b*d*e*f h i  - 442368b*c g*h i  + 663552a*c e*g*h i  + 2654208a*b*c f*g*h i  - 1161216a c e*f*g*h i  - 1161216a b*c*f g*h i  - 10948608a e*f g*h i  + 221184b c h i  - 442368a*c d*h i  - 221184a*b*c e*h i  - 110592a c e h i  - 1105920a*b c f*h i  + 2101248a c d*f*h i  + 1714176a b*c*e*f*h i  - 414720a e f*h i  - 27648a b f h i  - 663552a d*f h i  + 221184a c h i  - 995328a c*f*h i  - 13824c d e i  + 13824b*c d e i  - 13824a*c*d e i  + 497664c d e*f*i  - 635904b*c d e f*i  + 110592b c*d e f*i  + 608256a*c*d e f*i  - 138240a*b*d e f*i  - 331776b*c d f i  + 884736b c*d e*f i  - 2211840a*c*d e*f i  - 110592b d e f i  + 110592a*b*d e f i  - 442368b d f i  + 1769472a*b*d f i  - 414720c d e g*i  + 608256b*c d*e g*i  - 165888b c e g*i  - 470016a*c d*e g*i  + 165888a*b*c*e g*i  + 13824a e g*i  + 497664c d f*g*i  - 3262464b*c d e*f*g*i  + 2543616b c d*e f*g*i  + 3179520a*c d e f*g*i  - 663552b c*e f*g*i  - 2543616a*b*c*d*e f*g*i  + 995328a*b e f*g*i  - 1244160a d*e f*g*i  + 2211840b c d f g*i  - 2543616a*c d f g*i  - 3760128b c*d*e*f g*i  + 10838016a*b*c*d e*f g*i  + 663552b e f g*i  - 1216512a*b d*e f g*i  - 1658880a d e f g*i  + 1769472b d*f g*i  - 8404992a*b d f g*i  + 1769472a d f g*i  + 1327104c d*e*g i  - 1105920b*c e g i  + 995328a*c e g i  - 2211840b*c d*f*g i  + 5750784b c e*f*g i  - 3317760a*c d*e*f*g i  - 12275712a*b*c e f*g i  + 9455616a c*e f*g i  - 3317760b c f g i  + 8957952a*b*c d*f g i  + 663552a*b c*e*f g i  - 9953280a c*d*e*f g i  + 3981312a b*e f g i  + 1769472a*b f g i  + 3981312a b*d*f g i  - 884736c g i  + 7962624a*c f*g i  - 20901888a c f g i  + 11943936a f g i  + 497664c d e*h*i  - 635904b*c d e h*i  + 110592b c d*e h*i  + 566784a*c d e h*i  - 110592a*b*c*d*e h*i  - 13824a d*e h*i  - 165888b*c d f*h*i  + 1050624b c d e*f*h*i  - 3262464a*c d e*f*h*i  + 221184b c*d*e f*h*i  - 1105920a*b*c*d e f*h*i  - 442368a*b d*e f*h*i  + 1603584a d e f*h*i  - 221184b c*d f h*i  + 221184a*b*c*d f h*i  - 221184b d*e*f h*i  - 221184a*b d e*f h*i  + 5750784a d e*f h*i  - 995328c d g*h*i  + 221184b*c d*e*g*h*i  + 110592b c e g*h*i  - 55296a*c d*e g*h*i  + 276480a*b*c e g*h*i  - 663552a c*e g*h*i  + 221184b c d*f*g*h*i  + 5031936a*c d f*g*h*i  - 3760128b c e*f*g*h*i  + 8736768a*b*c d*e*f*g*h*i  + 5750784a*b c*e f*g*h*i  - 7299072a c*d*e f*g*h*i  - 2820096a b*e f*g*h*i  + 1327104b c*f g*h*i  - 2433024a*b c*d*f g*h*i  - 3317760a c*d f g*h*i  + 3317760a*b e*f g*h*i  - 21897216a b*d*e*f g*h*i  + 1769472b*c g h*i  - 2654208a*c e*g h*i  - 10616832a*b*c f*g h*i  + 7962624a c e*f*g h*i  + 7962624a b*c*f g h*i  + 23887872a e*f g h*i  - 331776b*c d h i  + 884736b c d*e*h i  - 718848a*c d e*h i  - 110592b c e h i  - 1161216a*b*c d*e h i  + 110592a*b c*e h i  + 566784a c*d*e h i  + 13824a b*e h i  - 221184b c d*f*h i  + 1050624a*b*c d f*h i  - 221184b c*e*f*h i  - 774144a*b c*d*e*f*h i  + 4368384a c*d e*f*h i  + 442368a*b e f*h i  - 691200a b*d*e f*h i  + 221184b f h i  - 774144a*b d*f h i  - 774144a b*d f h i  - 442368b c g*h i  + 2433024a*c d*g*h i  - 1105920a*b*c e*g*h i  + 2239488a c e g*h i  + 3760128a*b c f*g*h i  - 11778048a c d*f*g*h i  - 6137856a b*c*e*f*g*h i  + 3234816a e f*g*h i  + 1658880a b f g*h i  + 4976640a d*f g*h i  - 442368b c h i  + 1105920a*b*c d*h i  + 884736a*b c e*h i  - 718848a c d*e*h i  - 635904a b*c*e h i  - 13824a e h i  + 1105920a*b c*f*h i  - 3594240a b*c*d*f*h i  - 718848a b e*f*h i  + 165888a d*e*f*h i  - 1880064a c g*h i  + 8460288a c*f*g*h i  - 331776a b*c h i  + 497664a c*e*h i  + 497664a b*f*h i  - 373248c d i  + 497664b*c d e*i  - 110592b c d e i  - 414720a*c d e i  + 110592a*b*c*d e i  + 13824a d e i  - 331776b c d f*i  + 1990656a*c d f*i  - 221184b c*d e*f*i  + 221184a*b*c*d e*f*i  + 442368a*b d e f*i  - 1105920a d e f*i  + 221184b d f i  - 442368a*b d f i  - 1769472a d f i  + 1990656b*c d g*i  - 2211840b c d*e*g*i  - 331776a*c d e*g*i  + 663552b c e g*i  + 774144a*b*c d*e g*i  - 663552a*b c*e g*i  + 1492992a c*d*e g*i  - 165888a b*e g*i  + 1327104b c d*f*g*i  - 9400320a*b*c d f*g*i  + 884736b c*e*f*g*i  - 884736a*b c*d*e*f*g*i  - 663552a c*d e*f*g*i  - 2211840a*b e f*g*i  + 6967296a b*d*e f*g*i  - 884736b f g*i  + 2211840a*b d*f g*i  + 7962624a b*d f g*i  - 1769472b c g i  - 2654208a*c d*g i  + 7962624a*b*c e*g i  - 6967296a c e g i  + 2654208a*b c f*g i  + 13934592a c d*f*g i  - 1990656a b*c*e*f*g i  - 8957952a e f*g i  - 5971968a b f g i  - 11943936a d*f g i  - 331776b c d h*i  + 497664a*c d h*i  - 221184b c d*e*h*i  + 1714176a*b*c d e*h*i  + 221184a*b c*d*e h*i  - 1935360a c*d e h*i  + 110592a b*d*e h*i  + 884736a*b c*d f*h*i  - 2211840a c*d f*h*i  + 442368a*b d*e*f*h*i  - 2433024a b*d e*f*h*i  + 1769472b c g*h*i  - 4423680a*b*c d*g*h*i  - 3538944a*b c e*g*h*i  + 2654208a c d*e*g*h*i  + 2322432a b*c*e g*h*i  + 497664a e g*h*i  - 4423680a*b c*f*g*h*i  + 13934592a b*c*d*f*g*h*i  + 2654208a b e*f*g*h*i  + 1990656a d*e*f*g*h*i  + 3981312a c g h*i  - 17915904a c*f*g h*i  + 221184b c h i  - 1105920a*b c d*h i  - 27648a c d h i  - 221184a*b c*e*h i  + 1714176a b*c*d*e*h i  - 110592a b e h i  - 414720a d*e h i  - 442368a*b f*h i  + 2101248a b d*f*h i  - 663552a d f*h i  + 3317760a b*c g*h i  - 4976640a c*e*g*h i  - 4976640a b*f*g*h i  - 331776a b c*h i  + 497664a c*d*h i  + 497664a b*e*h i  - 373248a h i  + 221184b c d i  - 995328a*b*c d i  - 221184a*b c*d e*i  + 1327104a c*d e*i  - 110592a b*d e i  - 442368a*b d f*i  + 1769472a b*d f*i  - 884736b c g*i  + 4423680a*b c d*g*i  + 331776a c d g*i  + 884736a*b c*e*g*i  - 5971968a b*c*d*e*g*i  + 663552a b e g*i  - 995328a d*e g*i  + 1769472a*b f*g*i  - 7962624a b d*f*g*i  - 7962624a b*c g i  + 11943936a c*e*g i  + 11943936a b*f*g i  - 221184a b*c*d h*i  - 221184a b d*e*h*i  + 1327104a d e*h*i  + 1327104a b c*g*h*i  - 1990656a c*d*g*h*i  - 1990656a b*e*g*h*i  + 221184a b h i  - 995328a b*d*h i  + 2985984a g*h i  + 221184a b d i  - 884736a d i  - 884736a b g*i  + 3981312a b*d*g*i  - 5971968a g i  - 13824c d*e g*j + 13824b*c*e g*j - 13824a*e g*j + 152064c d e f*g*j - 152064b*c*d*e f*g*j - 13824b e f*g*j + 207360a*d*e f*g*j - 552960c d e f g*j + 552960b*c*d e f g*j + 152064b d*e f g*j - 1161216a*d e f g*j + 663552c d e*f g*j - 663552b*c*d e f g*j - 552960b d e f g*j + 2875392a*d e f g*j + 663552b d e*f g*j - 2654208a*d e*f g*j + 13824c e g j - 663552c d*e f*g j + 539136b*c e f*g j - 622080a*c*e f*g j + 2239488c d e f g j - 870912b*c d*e f g j - 1575936b c*e f g j + 4727808a*c*d*e f g j + 1119744a*b*e f g j - 1880064c d f g j - 1161216b*c d e*f g j + 4810752b c*d*e f g j - 10948608a*c*d e f g j + 995328b e f g j - 7464960a*b*d*e f g j - 1990656b c*d f g j + 7962624a*c*d f g j - 2654208b d*e*f g j + 11943936a*b*d e*f g j + 497664c e f*g j - 4976640c d*e*f g j + 3234816b*c e f g j - 7091712a*c e f g j + 8460288b*c d*f g j - 10948608b c e*f g j + 25380864a*c d*e*f g j + 7464960a*b*c*e f g j + 7464960a e f g j + 7962624b c*f g j - 35831808a*b*c*d*f g j - 17915904a d*e*f g j + 2985984c f g j - 25380864a*c f g j + 53747712a c*f g j + 13824c d e h*j - 13824b*c*d*e h*j + 13824a*d*e h*j - 138240c d e f*h*j + 138240b*c*d e f*h*j + 13824b d*e f*h*j - 193536a*d e f*h*j + 442368c d e f h*j - 442368b*c*d e f h*j - 138240b d e f h*j + 995328a*d e f h*j - 442368c d f h*j + 442368b*c*d e*f h*j + 442368b d e f h*j - 2211840a*d e f h*j - 442368b d f h*j + 1769472a*d f h*j + 165888c d*e g*h*j - 193536b*c e g*h*j + 207360a*c*e g*h*j + 276480c d e f*g*h*j - 552960b*c d*e f*g*h*j + 691200b c*e f*g*h*j - 663552a*c*d*e f*g*h*j - 539136a*b*e f*g*h*j - 1105920c d e*f g*h*j + 663552b*c d e f g*h*j - 27648b c*d*e f g*h*j - 1658880a*c*d e f g*h*j - 470016b e f g*h*j + 2156544a*b*d*e f g*h*j + 2654208b*c d f g*h*j - 2985984b c*d e*f g*h*j + 3981312a*c*d e*f g*h*j - 55296b d*e f g*h*j + 2654208a*b*d e f g*h*j + 2433024b d f g*h*j - 10616832a*b*d f g*h*j - 165888c e g h*j + 2322432c d*e f*g h*j - 2820096b*c e f*g h*j + 4727808a*c e f*g h*j + 3317760c d f g h*j - 6137856b*c d*e*f g h*j + 7713792b c e f g h*j - 11197440a*c d*e f g h*j - 2737152a*b*c*e f g h*j - 7464960a e f g h*j - 1161216b c d*f g h*j - 16920576a*c d f g h*j - 3317760b c*e*f g h*j + 20901888a*b*c*d*e*f g h*j - 2488320a*b e f g h*j + 8957952a d*e f g h*j - 2654208b f g h*j + 11943936a*b d*f g h*j + 11943936a d f g h*j - 1990656c e*f*g h*j - 4976640b*c f g h*j + 25380864a*c e*f g h*j + 25380864a*b*c f g h*j - 71663616a c*e*f g h*j - 17915904a b*f g h*j - 165888c d e h j + 165888b*c d*e h j + 13824b c*e h j - 193536a*c*d*e h j - 13824a*b*e h j + 110592c d e f*h j + 387072b*c d e f*h j - 774144b c*d*e f*h j + 940032a*c*d e f*h j - 13824b e f*h j + 691200a*b*d*e f*h j - 442368c d f h j - 221184b*c d e*f h j + 1078272b c*d e f h j - 1216512a*c*d e f h j + 566784b d*e f h j - 3373056a*b*d e f h j - 774144b c*d f h j + 2211840a*c*d f h j - 718848b d e*f h j + 3317760a*b*d e*f h j - 663552c d*e g*h j + 995328b*c e g*h j - 1161216a*c e g*h j - 3538944c d e*f*g*h j + 5750784b*c d*e f*g*h j - 3373056b c e f*g*h j - 1658880a*c d*e f*g*h j + 2156544a*b*c*e f*g*h j + 1119744a e f*g*h j + 3760128b*c d f g*h j - 7962624b c d*e*f g*h j + 19906560a*c d e*f g*h j + 3179520b c*e f g*h j - 9455616a*b*c*d*e f g*h j - 1119744a*b e f g*h j + 8460288a d*e f g*h j + 5031936b c*d*f g*h j - 17252352a*b*c*d f g*h j - 331776b e*f g*h j + 2156544a*b d*e*f g*h j - 15925248a d e*f g*h j + 663552c e g h j + 1327104c d*f*g h j + 2654208b*c e*f*g h j - 10948608a*c e f*g h j + 1658880b c f g h j - 16920576a*c d*f g h j - 11943936a*b*c e*f g h j + 34338816a c*e f g h j - 8460288a*b c*f g h j + 47775744a c*d*f g h j + 5971968a b*e*f g h j + 663552c d e h j - 663552b*c d*e h j - 165888b c e h j + 995328a*c d*e h j + 165888a*b*c*e h j + 13824a e h j + 1769472c d f*h j - 3760128b*c d e*f*h j + 2543616b c d*e f*h j - 1216512a*c d e f*h j + 608256b c*e f*h j - 2543616a*b*c*d*e f*h j - 470016a*b e f*h j - 1244160a d*e f*h j + 2211840b c d f h j - 8404992a*c d f h j - 3262464b c*d*e*f h j + 10838016a*b*c*d e*f h j - 414720b e f h j + 3179520a*b d*e f h j - 1658880a d e f h j + 497664b d*f h j - 2543616a*b d f h j + 1769472a d f h j + 884736c d*e*g*h j - 2211840b*c e g*h j + 2875392a*c e g*h j - 4423680b*c d*f*g*h j + 3317760b c e*f*g*h j + 3981312a*c d*e*f*g*h j + 2654208a*b*c e f*g*h j - 7464960a c*e f*g*h j - 2543616b c f g*h j + 17915904a*b*c d*f g*h j + 2156544a*b c*e*f g*h j - 35831808a c*d*e*f g*h j - 2488320a b*e f g*h j - 829440a*b f g*h j + 7962624a b*d*f g*h j - 884736c g h j + 7962624a*c f*g h j - 14929920a c f g h j - 11943936a f g h j - 884736c d h j + 884736b*c d*e*h j + 663552b c e h j - 2211840a*c d*e h j - 663552a*b*c e h j - 165888a c*e h j + 1327104b c d*f*h j + 2211840a*c d f*h j - 2211840b c e*f*h j - 884736a*b*c d*e*f*h j + 774144a*b c*e f*h j + 6967296a c*d*e f*h j + 1492992a b*e f*h j + 1990656b c*f h j - 9400320a*b c*d*f h j + 7962624a c*d f h j - 331776a*b e*f h j - 663552a b*d*e*f h j + 1769472b*c g*h j - 2654208a*c e*g*h j - 10616832a*b*c f*g*h j + 11943936a c e*f*g*h j + 11943936a b*c*f g*h j - 884736b c h j + 1769472a*c d*h j + 884736a*b*c e*h j + 663552a c e h j + 4423680a*b c f*h j - 7962624a c d*f*h j - 5971968a b*c*e*f*h j - 995328a e f*h j + 331776a b f h j - 884736a c h j + 3981312a c*f*h j - 13824c d e i*j + 13824b*c*d e i*j - 13824a*d e i*j + 110592c d e f*i*j - 110592b*c*d e f*i*j - 13824b d e f*i*j + 165888a*d e f*i*j - 221184c d e*f i*j + 221184b*c*d e f i*j + 110592b d e f i*j - 663552a*d e f i*j - 221184b d e*f i*j + 884736a*d e*f i*j - 470016c d e g*i*j + 691200b*c d*e g*i*j - 193536b c*e g*i*j - 539136a*c*d*e g*i*j + 207360a*b*e g*i*j - 55296c d e f*g*i*j - 27648b*c d e f*g*i*j - 552960b c*d*e f*g*i*j + 2156544a*c*d e f*g*i*j + 165888b e f*g*i*j - 663552a*b*d*e f*g*i*j + 2433024c d f g*i*j - 2985984b*c d e*f g*i*j + 663552b c*d e f g*i*j + 2654208a*c*d e f g*i*j + 276480b d*e f g*i*j - 1658880a*b*d e f g*i*j + 2654208b c*d f g*i*j - 10616832a*c*d f g*i*j - 1105920b d e*f g*i*j + 3981312a*b*d e*f g*i*j + 1492992c d*e g i*j - 1244160b*c e g i*j + 1119744a*c e g i*j + 2654208c d e*f*g i*j - 7299072b*c d*e f*g i*j + 6635520b c e f*g i*j - 2737152a*c d*e f*g i*j - 8460288a*b*c*e f*g i*j + 4105728a e f*g i*j - 11778048b*c d f g i*j + 19408896b c d*e*f g i*j - 11943936a*c d e*f g i*j - 12275712b c*e f g i*j + 16422912a*b*c*d*e f g i*j + 8460288a*b e f g i*j - 8957952a d*e f g i*j - 10616832b c*d*f g i*j + 47775744a*b*c*d f g i*j + 7962624b e*f g i*j - 35831808a*b d*e*f g i*j + 5971968a d e*f g i*j - 995328c e g i*j - 1990656c d*f*g i*j + 1990656b*c e*f*g i*j + 7464960a*c e f*g i*j + 4976640b c f g i*j + 25380864a*c d*f g i*j - 40310784a*b*c e*f g i*j + 4478976a c*e f g i*j - 71663616a c*d*f g i*j + 53747712a b*e*f g i*j + 608256c d e h*i*j - 774144b*c d e h*i*j + 138240b c*d*e h*i*j + 691200a*c*d e h*i*j - 152064a*b*d*e h*i*j + 221184c d e*f*h*i*j - 1105920b*c d e f*h*i*j + 1631232b c*d e f*h*i*j - 2543616a*c*d e f*h*i*j - 110592b d*e f*h*i*j - 552960a*b*d e f*h*i*j + 884736b*c d f h*i*j - 774144b c*d e*f h*i*j - 884736a*c*d e*f h*i*j - 1161216b d e f h*i*j + 5750784a*b*d e f h*i*j + 1105920b d f h*i*j - 4423680a*b*d f h*i*j + 774144c d e g*h*i*j - 2543616b*c d*e g*h*i*j + 940032b c e g*h*i*j + 2156544a*c d*e g*h*i*j - 663552a*b*c*e g*h*i*j - 622080a e g*h*i*j - 4423680c d f*g*h*i*j + 8736768b*c d e*f*g*h*i*j - 1990656b c d*e f*g*h*i*j - 9455616a*c d e f*g*h*i*j - 2543616b c*e f*g*h*i*j + 13934592a*b*c*d*e f*g*h*i*j + 2156544a*b e f*g*h*i*j - 8460288a d*e f*g*h*i*j - 7630848b c d f g*h*i*j + 17915904a*c d f g*h*i*j + 8736768b c*d*e*f g*h*i*j - 23887872a*b*c*d e*f g*h*i*j + 774144b e f g*h*i*j - 9455616a*b d*e f g*h*i*j + 5971968a d e f g*h*i*j - 4423680b d*f g*h*i*j + 17915904a*b d f g*h*i*j + 7962624a d f g*h*i*j - 5971968c d*e*g h*i*j + 6967296b*c e g h*i*j - 7464960a*c e g h*i*j + 13934592b*c d*f*g h*i*j - 21897216b c e*f*g h*i*j + 20901888a*c d*e*f*g h*i*j + 16422912a*b*c e f*g h*i*j - 746496a c*e f*g h*i*j + 8957952b c f g h*i*j - 43296768a*b*c d*f g h*i*j + 14929920a*b c*e*f g h*i*j + 20901888a c*d*e*f g h*i*j - 14929920a b*e f g h*i*j + 7962624a*b f g h*i*j - 65691648a b*d*f g h*i*j + 3981312c g h*i*j - 35831808a*c f*g h*i*j + 67184640a c f g h*i*j + 53747712a f g h*i*j - 2211840c d e*h i*j + 2543616b*c d e h i*j + 387072b c d*e h i*j - 3373056a*c d e h i*j - 138240b c*e h i*j - 552960a*b*c*d*e h i*j + 152064a*b e h i*j + 539136a d*e h i*j + 221184b*c d f*h i*j - 1658880b c d e*f*h i*j + 10838016a*c d e*f*h i*j - 1105920b c*d*e f*h i*j - 1990656a*b*c*d e f*h i*j + 110592b e f*h i*j - 27648a*b d*e f*h i*j + 6635520a d e f*h i*j + 1050624b c*d f h i*j - 2433024a*b*c*d f h i*j + 1714176b d*e*f h i*j - 7962624a*b d e*f h i*j + 663552a d e*f h i*j + 4423680c d g*h i*j - 884736b*c d*e*g*h i*j - 1216512b c e g*h i*j + 2654208a*c d*e g*h i*j - 1658880a*b*c e g*h i*j + 4727808a c*e g*h i*j - 2433024b c d*f*g*h i*j - 17252352a*c d f*g*h i*j + 10838016b c e*f*g*h i*j - 23887872a*b*c d*e*f*g*h i*j - 9455616a*b c*e f*g*h i*j + 16422912a c*d*e f*g*h i*j - 2737152a b*e f*g*h i*j - 9400320b c*f g*h i*j + 36329472a*b c*d*f g*h i*j - 11943936a c*d f g*h i*j + 2156544a*b e*f g*h i*j + 14929920a b*d*e*f g*h i*j - 7962624b*c g h i*j + 11943936a*c e*g h i*j + 47775744a*b*c f*g h i*j - 56733696a c e*f*g h i*j - 56733696a b*c*f g h i*j + 17915904a e*f g h i*j + 1327104b*c d h i*j - 3760128b c d*e*h i*j + 3317760a*c d e*h i*j + 110592b c e h i*j + 5750784a*b*c d*e h i*j + 276480a*b c*e h i*j - 2820096a c*d*e h i*j - 663552a b*e h i*j + 221184b c d*f*h i*j - 2433024a*b*c d f*h i*j + 221184b c*e*f*h i*j + 8736768a*b c*d*e*f*h i*j - 21897216a c*d e*f*h i*j - 55296a*b e f*h i*j - 7299072a b*d*e f*h i*j - 995328b f h i*j + 5031936a*b d*f h i*j - 3317760a b*d f h i*j + 2211840b c g*h i*j - 10616832a*c d*g*h i*j + 3981312a*b*c e*g*h i*j - 10948608a c e g*h i*j - 17252352a*b c f*g*h i*j + 47775744a c d*f*g*h i*j + 20901888a b*c*e*f*g*h i*j + 7464960a e f*g*h i*j - 8460288a b f g*h i*j + 1769472b c h i*j - 4423680a*b*c d*h i*j - 3538944a*b c e*h i*j + 2654208a c d*e*h i*j + 2322432a b*c*e h i*j + 497664a e h i*j - 4423680a*b c*f*h i*j + 13934592a b*c*d*f*h i*j + 2654208a b e*f*h i*j + 1990656a d*e*f*h i*j + 7962624a c g*h i*j - 35831808a c*f*g*h i*j + 1327104a b*c h i*j - 1990656a c*e*h i*j - 1990656a b*f*h i*j - 414720c d e i j + 566784b*c d e i j - 138240b c*d e i j - 470016a*c*d e i j + 152064a*b*d e i j - 995328c d f*i j + 1714176b*c d e*f*i j - 1161216b c*d e f*i j + 774144a*c*d e f*i j + 110592b d e f*i j + 276480a*b*d e f*i j - 1105920b c*d f i j + 4423680a*c*d f i j + 884736b d e*f i j - 3538944a*b*d e*f i j - 331776c d e*g*i j + 3179520b*c d e g*i j - 3373056b c d*e g*i j - 1119744a*c d e g*i j + 995328b c*e g*i j + 2156544a*b*c*d*e g*i j - 1161216a*b e g*i j + 1119744a d*e g*i j + 5031936b*c d f*g*i j - 7962624b c d e*f*g*i j + 2156544a*c d e*f*g*i j + 5750784b c*d*e f*g*i j - 9455616a*b*c*d e f*g*i j - 663552b e f*g*i j - 1658880a*b d*e f*g*i j + 8460288a d e f*g*i j + 3760128b c*d f g*i j - 17252352a*b*c*d f g*i j - 3538944b d*e*f g*i j + 19906560a*b d e*f g*i j - 15925248a d e*f g*i j + 331776c d g i j - 663552b*c d*e*g i j - 1658880b c e g i j - 2488320a*c d*e g i j + 8460288a*b*c e g i j - 7464960a c*e g i j - 3317760b c d*f*g i j - 8460288a*c d f*g i j + 663552b c e*f*g i j + 14929920a*b*c d*e*f*g i j + 5971968a*b c*e f*g i j - 14929920a c*d*e f*g i j - 8957952a b*e f*g i j + 2654208b c*f g i j - 11943936a*b c*d*f g i j + 29859840a c*d f g i j - 15925248a*b e*f g i j + 47775744a b*d*e*f g i j + 17915904a c e*f*g i j + 17915904a b*c*f g i j - 107495424a e*f g i j + 1990656c d h*i j - 3262464b*c d e*h*i j + 1078272b c d e h*i j + 3179520a*c d e h*i j - 442368b c*d*e h*i j - 27648a*b*c*d e h*i j + 552960a*b d*e h*i j - 1575936a d e h*i j + 1050624b c d f*h*i j - 9400320a*c d f*h*i j - 774144b c*d e*f*h*i j + 8736768a*b*c*d e*f*h*i j + 221184b d*e f*h*i j + 663552a*b d e f*h*i j - 12275712a d e f*h*i j - 1105920b d f h*i j + 3760128a*b d f h*i j + 2654208a d f h*i j - 9400320b*c d g*h*i j + 10838016b c d*e*g*h*i j + 2156544a*c d e*g*h*i j - 1216512b c e g*h*i j - 9455616a*b*c d*e g*h*i j - 1658880a*b c*e g*h*i j - 2737152a c*d*e g*h*i j + 4727808a b*e g*h*i j - 2433024b c d*f*g*h*i j + 36329472a*b*c d f*g*h*i j - 884736b c*e*f*g*h*i j - 23887872a*b c*d*e*f*g*h*i j + 14929920a c*d e*f*g*h*i j + 2654208a*b e f*g*h*i j + 16422912a b*d*e f*g*h*i j + 4423680b f g*h*i j - 17252352a*b d*f g*h*i j - 11943936a b*d f g*h*i j + 7962624b c g h*i j + 11943936a*c d*g h*i j - 35831808a*b*c e*g h*i j + 34338816a c e g h*i j - 11943936a*b c f*g h*i j - 56733696a c d*f*g h*i j + 20901888a b*c*e*f*g h*i j + 4478976a e f*g h*i j + 29859840a b f g h*i j + 17915904a d*f g h*i j + 2211840b c d h i j - 2543616a*c d h i j - 221184b c d*e*h i j - 7962624a*b*c d e*h i j + 442368b c*e h i j + 663552a*b c*d*e h i j + 7713792a c*d e h i j - 552960a*b e h i j - 870912a b*d*e h i j + 884736b c*d*f*h i j - 7630848a*b c*d f*h i j + 8957952a c*d f*h i j - 221184b e*f*h i j - 2985984a*b d*e*f*h i j + 19408896a b*d e*f*h i j - 8404992b c g*h i j + 17915904a*b*c d*g*h i j + 19906560a*b c e*g*h i j - 11943936a c d*e*g*h i j - 11197440a b*c*e g*h i j - 7091712a e g*h i j + 17915904a*b c*f*g*h i j - 43296768a b*c*d*f*g*h i j - 11943936a b e*f*g*h i j - 40310784a d*e*f*g*h i j - 14929920a c g h i j + 67184640a c*f*g h i j - 442368b c h i j + 3760128a*b c d*h i j + 1658880a c d h i j - 1105920a*b c*e*h i j - 6137856a b*c*d*e*h i j + 2239488a b e h i j + 3234816a d*e h i j + 2433024a*b f*h i j - 11778048a b d*f*h i j + 4976640a d f*h i j - 16920576a b*c g*h i j + 25380864a c*e*g*h i j + 25380864a b*f*g*h i j + 3317760a b c*h i j - 4976640a c*d*h i j - 4976640a b*e*h i j + 2985984a h i j + 497664b*c d i j - 718848b c d e*i j - 331776a*c d e*i j + 442368b c*d e i j - 55296a*b*c*d e i j - 552960a*b d e i j + 995328a d e i j + 1105920b c*d f*i j - 4423680a*b*c*d f*i j - 221184b d e*f*i j - 1105920a*b d e*f*i j + 7962624a d e*f*i j - 2543616b c d g*i j - 829440a*c d g*i j + 3317760b c d*e*g*i j + 2156544a*b*c d e*g*i j - 2211840b c*e g*i j + 2654208a*b c*d*e g*i j - 2488320a c*d e g*i j + 2875392a*b e g*i j - 7464960a b*d*e g*i j - 4423680b c*d*f*g*i j + 17915904a*b c*d f*g*i j + 7962624a c*d f*g*i j + 884736b e*f*g*i j + 3981312a*b d*e*f*g*i j - 35831808a b*d e*f*g*i j + 1769472b c g i j + 7962624a*b*c d*g i j - 15925248a*b c e*g i j + 5971968a c d*e*g i j + 8957952a b*c*e g i j + 7464960a e g i j + 7962624a*b c*f*g i j - 65691648a b*c*d*f*g i j + 5971968a b e*f*g i j + 53747712a d*e*f*g i j - 11943936a c g i j + 53747712a c*f*g i j - 774144b c d h*i j + 5031936a*b*c d h*i j + 442368b c*d*e*h*i j - 2985984a*b c*d e*h*i j - 3317760a c*d e*h*i j - 663552a*b d*e h*i j + 4810752a b*d e h*i j + 2654208a*b d f*h*i j - 10616832a b*d f*h*i j + 2211840b c g*h*i j - 17252352a*b c d*g*h*i j - 8460288a c d g*h*i j + 3981312a*b c*e*g*h*i j + 20901888a b*c*d*e*g*h*i j - 10948608a b e g*h*i j + 7464960a d*e g*h*i j - 10616832a*b f*g*h*i j + 47775744a b d*f*g*h*i j + 47775744a b*c g h*i j - 71663616a c*e*g h*i j - 71663616a b*f*g h*i j - 442368b c*h i j + 2654208a*b c*d*h i j - 1161216a b*c*d h i j + 663552a*b e*h i j - 1161216a b d*e*h i j - 10948608a d e*h i j - 16920576a b c*g*h i j + 25380864a c*d*g*h i j + 25380864a b*e*g*h i j - 1880064a b h i j + 8460288a b*d*h i j - 25380864a g*h i j - 442368b c*d i j + 2433024a*b c*d i j - 2654208a c*d i j + 663552a*b d e*i j - 2654208a b*d e*i j + 1769472b c*g*i j - 10616832a*b c*d*g*i j + 11943936a b*c*d g*i j - 2654208a*b e*g*i j + 11943936a b d*e*g*i j + 11943936a b c*g i j - 17915904a c*d*g i j - 17915904a b*e*g i j - 1990656a b d h*i j + 7962624a d h*i j + 7962624a b g*h*i j - 35831808a b*d*g*h*i j + 53747712a g h*i j + 13824c d e j  - 13824b*c*d e j  + 13824a*d e j  - 110592c d e f*j  + 110592b*c*d e f*j  + 13824b d e f*j  - 165888a*d e f*j  + 221184c d f j  - 221184b*c*d e*f j  - 110592b d e f j  + 663552a*d e f j  + 221184b d f j  - 884736a*d f j  + 995328c d e g*j  - 1575936b*c d e g*j  + 539136b c*d*e g*j  + 1119744a*c*d e g*j  + 13824b e g*j  - 622080a*b*d*e g*j  - 2654208c d e*f*g*j  + 4810752b*c d e f*g*j  - 870912b c*d e f*g*j  - 7464960a*c*d e f*g*j  - 663552b d*e f*g*j  + 4727808a*b*d e f*g*j  - 1990656b*c d f g*j  - 1161216b c*d e*f g*j  + 11943936a*c*d e*f g*j  + 2239488b d e f g*j  - 10948608a*b*d e f g*j  - 1880064b d f g*j  + 7962624a*b*d f g*j  - 6967296c d e g j  + 9455616b*c d*e g j  - 2861568b c e g j  - 7464960a*c d*e g j  + 4105728a*b*c*e g j  - 1119744a e g j  + 3981312c d f*g j  + 7962624b*c d e*f*g j  - 25380864b c d*e f*g j  + 34338816a*c d e f*g j  + 9455616b c*e f*g j  - 746496a*b*c*d*e f*g j  - 7464960a*b e f*g j  + 1119744a d*e f*g j  + 9704448b c d f g j  - 14929920a*c d f g j  + 7962624b c*d*e*f g j  - 56733696a*b*c*d e*f g j  - 6967296b e f g j  + 34338816a*b d*e f g j  + 8957952a d e f g j  + 3981312b d*f g j  - 14929920a*b d f g j  - 17915904a d f g j  + 11943936c d*e*g j  - 8957952b*c e g j  + 7464960a*c e g j  - 17915904b*c d*f*g j  + 23887872b c e*f*g j  - 71663616a*c d*e*f*g j  + 4478976a*b*c e f*g j  - 3359232a c*e f*g j  - 20901888b c f g j  + 67184640a*b*c d*f g j  + 17915904a*b c*e*f g j  + 67184640a c*d*e*f g j  - 60466176a b*e f g j  - 11943936a*b f g j  + 80621568a b*d*f g j  - 5971968c g j  + 53747712a*c f*g j  - 100776960a c f g j  - 80621568a f g j  - 1105920c d e h*j  + 1603584b*c d e h*j  - 456192b c*d e h*j  - 1244160a*c*d e h*j  - 13824b d*e h*j  + 539136a*b*d e h*j  + 1769472c d f*h*j  - 2433024b*c d e*f*h*j  - 691200b c*d e f*h*j  + 6967296a*c*d e f*h*j  + 566784b d e f*h*j  - 2820096a*b*d e f*h*j  + 2101248b c*d f h*j  - 7962624a*c*d f h*j  - 718848b d e*f h*j  + 2654208a*b*d e*f h*j  + 7962624c d e*g*h*j  - 12275712b*c d e g*h*j  + 6635520b c d*e g*h*j  + 8460288a*c d e g*h*j  - 1244160b c*e g*h*j  - 8460288a*b*c*d*e g*h*j  + 1119744a*b e g*h*j  + 4105728a d*e g*h*j  - 10616832b*c d f*g*h*j  + 19408896b c d e*f*g*h*j  - 35831808a*c d e*f*g*h*j  - 7299072b c*d*e f*g*h*j  + 16422912a*b*c*d e f*g*h*j  + 1492992b e f*g*h*j  - 2737152a*b d*e f*g*h*j  - 8957952a d e f*g*h*j  - 11778048b c*d f g*h*j  + 47775744a*b*c*d f g*h*j  + 2654208b d*e*f g*h*j  - 11943936a*b d e*f g*h*j  + 5971968a d e*f g*h*j  - 7962624c d g h*j  - 1990656b*c d*e*g h*j  + 3981312b c e g h*j  + 8957952a*c d*e g h*j  - 8957952a*b*c e g h*j  + 1119744a c*e g h*j  + 7962624b c d*f*g h*j  + 47775744a*c d f*g h*j  - 9953280b c e*f*g h*j  + 20901888a*b*c d*e*f*g h*j  - 14929920a*b c*e f*g h*j  - 38071296a c*d*e f*g h*j  + 41430528a b*e f*g h*j  + 13934592b c*f g h*j  - 56733696a*b c*d*f g h*j  - 44789760a c*d f g h*j  + 5971968a*b e*f g h*j  - 22394880a b*d*e*f g h*j  + 11943936b*c g h*j  - 17915904a*c e*g h*j  - 71663616a*b*c f*g h*j  + 67184640a c e*f*g h*j  + 67184640a b*c*f g h*j  + 80621568a e*f g h*j  - 1769472c d h j  + 5750784b*c d e*h j  - 6303744b c d e h j  - 1658880a*c d e h j  + 1603584b c*d*e h j  + 6635520a*b*c*d e h j  + 13824b e h j  - 1575936a*b d*e h j  - 2861568a d e h j  - 774144b c d f*h j  + 7962624a*c d f*h j  + 4368384b c*d e*f*h j  - 21897216a*b*c*d e*f*h j  - 1935360b d*e f*h j  + 7713792a*b d e f*h j  + 3981312a d e f*h j  - 27648b d f h j  + 1658880a*b d f h j  - 5971968a d f h j  + 2654208b*c d g*h j  + 663552b c d*e*g*h j  - 15925248a*c d e*g*h j  - 1658880b c e g*h j  + 5971968a*b*c d*e g*h j  + 8460288a*b c*e g*h j  - 8957952a c*d*e g*h j  - 7464960a b*e g*h j  - 3317760b c d*f*g*h j  - 11943936a*b*c d f*g*h j  - 663552b c*e*f*g*h j  + 14929920a*b c*d*e*f*g*h j  + 47775744a c*d e*f*g*h j  - 2488320a*b e f*g*h j  - 14929920a b*d*e f*g*h j  + 331776b f g*h j  - 8460288a*b d*f g*h j  + 29859840a b*d f g*h j  - 5971968b c g h j  + 11943936a*c d*g h j  + 5971968a*b*c e*g h j  + 8957952a c e g h j  + 29859840a*b c f*g h j  - 44789760a c d*f*g h j  - 22394880a b*c*e*f*g h j  - 60466176a e f*g h j  + 6718464a b f g h j  - 53747712a d*f g h j  - 3317760b c d h j  + 1769472a*c d h j  + 5750784b c d*e*h j  + 663552a*b*c d e*h j  - 1105920b c*e h j  - 12275712a*b c*d*e h j  + 3981312a c*d e h j  + 995328a*b e h j  + 9455616a b*d*e h j  - 2211840b c*d*f*h j  + 8957952a*b c*d f*h j  + 3981312a c*d f*h j  + 1327104b e*f*h j  - 3317760a*b d*e*f*h j  - 9953280a b*d e*f*h j  + 1769472b c g*h j  + 7962624a*b*c d*g*h j  - 15925248a*b c e*g*h j  + 5971968a c d*e*g*h j  + 8957952a b*c*e g*h j  + 7464960a e g*h j  + 7962624a*b c*f*g*h j  - 65691648a b*c*d*f*g*h j  + 5971968a b e*f*g*h j  + 53747712a d*e*f*g*h j  - 17915904a c g h j  + 80621568a c*f*g h j  - 1769472b c h j  + 2654208a*b c d*h j  - 5971968a c d h j  + 7962624a*b c*e*h j  - 1990656a b*c*d*e*h j  - 6967296a b e h j  - 8957952a d*e h j  - 2654208a*b f*h j  + 13934592a b d*f*h j  - 11943936a d f*h j  + 11943936a b*c g*h j  - 17915904a c*e*g*h j  - 17915904a b*f*g*h j  - 7962624a b c*h j  + 11943936a c*d*h j  + 11943936a b*e*h j  - 5971968a h j  + 1327104c d e*i*j  - 1935360b*c d e i*j  + 566784b c*d e i*j  + 1492992a*c*d e i*j  + 13824b d e i*j  - 663552a*b*d e i*j  - 221184b*c d f*i*j  + 1714176b c*d e*f*i*j  - 5971968a*c*d e*f*i*j  - 635904b d e f*i*j  + 2322432a*b*d e f*i*j  - 331776b d f i*j  + 1327104a*b*d f i*j  - 2654208c d g*i*j  - 3317760b*c d e*g*i*j  + 7713792b c d e g*i*j  - 2488320a*c d e g*i*j  - 2820096b c*d*e g*i*j  - 2737152a*b*c*d e g*i*j  - 165888b e g*i*j  + 4727808a*b d*e g*i*j  - 7464960a d e g*i*j  - 1161216b c d f*g*i*j  + 11943936a*c d f*g*i*j  - 6137856b c*d e*f*g*i*j  + 20901888a*b*c*d e*f*g*i*j  + 2322432b d*e f*g*i*j  - 11197440a*b d e f*g*i*j  + 8957952a d e f*g*i*j  + 3317760b d f g*i*j  - 16920576a*b d f g*i*j  + 11943936a d f g*i*j  + 13934592b*c d g i*j  - 9953280b c d*e*g i*j  + 5971968a*c d e*g i*j  + 3981312b c e g i*j  - 14929920a*b*c d*e g i*j  - 8957952a*b c*e g i*j  + 41430528a c*d*e g i*j  + 1119744a b*e g i*j  + 7962624b c d*f*g i*j  - 56733696a*b*c d f*g i*j  - 1990656b c*e*f*g i*j  + 20901888a*b c*d*e*f*g i*j  - 22394880a c*d e*f*g i*j  + 8957952a*b e f*g i*j  - 38071296a b*d*e f*g i*j  - 7962624b f g i*j  + 47775744a*b d*f g i*j  - 44789760a b*d f g i*j  - 11943936b c g i*j  - 17915904a*c d*g i*j  + 53747712a*b*c e*g i*j  - 60466176a c e g i*j  + 17915904a*b c f*g i*j  + 67184640a c d*f*g i*j  - 67184640a b*c*e*f*g i*j  + 100776960a e f*g i*j  - 53747712a b f g i*j  + 80621568a d*f g i*j  - 2211840b*c d h*i*j  + 4368384b c d e*h*i*j  - 663552a*c d e*h*i*j  - 691200b c*d e h*i*j  - 7299072a*b*c*d e h*i*j  + 110592b d*e h*i*j  - 870912a*b d e h*i*j  + 9455616a d e h*i*j  - 3594240b c*d f*h*i*j  + 13934592a*b*c*d f*h*i*j  + 1714176b d e*f*h*i*j  - 6137856a*b d e*f*h*i*j  - 1990656a d e*f*h*i*j  + 8957952b c d g*h*i*j  + 7962624a*c d g*h*i*j  - 21897216b c d*e*g*h*i*j  + 14929920a*b*c d e*g*h*i*j  + 6967296b c*e g*h*i*j  + 16422912a*b c*d*e g*h*i*j  - 14929920a c*d e g*h*i*j  - 7464960a*b e g*h*i*j  - 746496a b*d*e g*h*i*j  + 13934592b c*d*f*g*h*i*j  - 43296768a*b c*d f*g*h*i*j  - 65691648a c*d f*g*h*i*j  - 5971968b e*f*g*h*i*j  + 20901888a*b d*e*f*g*h*i*j  + 20901888a b*d e*f*g*h*i*j  + 3981312b c g h*i*j  - 65691648a*b*c d*g h*i*j  + 47775744a*b c e*g h*i*j  - 22394880a c d*e*g h*i*j  - 38071296a b*c*e g h*i*j  - 3359232a e g h*i*j  - 65691648a*b c*f*g h*i*j  + 362797056a b*c*d*f*g h*i*j  - 22394880a b e*f*g h*i*j  - 67184640a d*e*f*g h*i*j  + 80621568a c g h*i*j  - 362797056a c*f*g h*i*j  - 774144b c d h i*j  - 3317760a*b*c d h i*j  - 2433024b c*d*e*h i*j  + 19408896a*b c*d e*h i*j  - 9953280a c*d e*h i*j  - 110592b e h i*j  + 4810752a*b d*e h i*j  - 25380864a b*d e h i*j  - 221184b d*f*h i*j  - 1161216a*b d f*h i*j  + 7962624a b*d f*h i*j  + 7962624b c g*h i*j  - 11943936a*b c d*g*h i*j  + 29859840a c d g*h i*j  - 35831808a*b c*e*g*h i*j  + 20901888a b*c*d*e*g*h i*j  + 34338816a b e g*h i*j  + 4478976a d*e g*h i*j  + 11943936a*b f*g*h i*j  - 56733696a b d*f*g*h i*j  + 17915904a d f*g*h i*j  - 44789760a b*c g h i*j  + 67184640a c*e*g h i*j  + 67184640a b*f*g h i*j  + 1769472b c*h i*j  - 10616832a*b c*d*h i*j  + 7962624a b*c*d h i*j  - 2654208a*b e*h i*j  + 7962624a b d*e*h i*j  + 23887872a d e*h i*j  + 47775744a b c*g*h i*j  - 71663616a c*d*g*h i*j  - 71663616a b*e*g*h i*j  + 3981312a b h i*j  - 17915904a b*d*h i*j  + 53747712a g*h i*j  - 27648b c d i j  + 331776a*c d i j  - 718848b c*d e*i j  + 2654208a*b*c*d e*i j  - 110592b d e i j  + 2239488a*b d e i j  - 6967296a d e i j  - 331776b d f*i j  + 3317760a*b d f*i j  - 7962624a d f*i j  + 1658880b c d g*i j  - 8460288a*b*c d g*i j  + 2654208b c*d*e*g*i j  - 11943936a*b c*d e*g*i j  + 5971968a c*d e*g*i j  + 663552b e g*i j  - 10948608a*b d*e g*i j  + 34338816a b*d e g*i j  + 1327104b d*f*g*i j  - 16920576a*b d f*g*i j  + 47775744a b*d f*g*i j  - 5971968b c g i j  + 29859840a*b c d*g i j  + 6718464a c d g i j  + 5971968a*b c*e*g i j  - 22394880a b*c*d*e*g i j  + 8957952a b e g i j  - 60466176a d*e g i j  + 11943936a*b f*g i j  - 44789760a b d*f*g i j  - 53747712a d f*g i j  - 53747712a b*c g i j  + 80621568a c*e*g i j  + 80621568a b*f*g i j  + 2101248b c*d h*i j  - 11778048a*b c*d h*i j  + 13934592a c*d h*i j  - 221184b d*e*h*i j  - 1161216a*b d e*h*i j  + 7962624a b*d e*h*i j  - 7962624b c*g*h*i j  + 47775744a*b c*d*g*h*i j  - 56733696a b*c*d g*h*i j  + 11943936a*b e*g*h*i j  - 56733696a b d*e*g*h*i j  + 17915904a d e*g*h*i j  - 44789760a b c*g h*i j  + 67184640a c*d*g h*i j  + 67184640a b*e*g h*i j  + 221184b h i j  - 1990656a*b d*h i j  + 9704448a b d h i j  - 20901888a d h i j  - 14929920a b g*h i j  + 67184640a b*d*g*h i j  - 100776960a g h i j  + 221184b d i j  - 1880064a*b d i j  + 3981312a b*d i j  - 884736b g*i j  + 7962624a*b d*g*i j  - 14929920a b d g*i j  - 11943936a d g*i j  - 17915904a b g i j  + 80621568a b*d*g i j  - 80621568a g i j  - 884736c d j  + 1327104b*c d e*j  - 414720b c*d e j  - 995328a*c*d e j  - 13824b d e j  + 497664a*b*d e j  - 995328b c*d f*j  + 3981312a*c*d f*j  + 497664b d e*f*j  - 1990656a*b*d e*f*j  + 7962624b*c d g*j  - 10948608b c d e*g*j  + 3234816b c*d e g*j  + 7464960a*b*c*d e g*j  + 497664b d*e g*j  - 7091712a*b d e g*j  + 7464960a d e g*j  + 8460288b c*d f*g*j  - 35831808a*b*c*d f*g*j  - 4976640b d e*f*g*j  + 25380864a*b d e*f*g*j  - 17915904a d e*f*g*j  - 20901888b c d g j  - 11943936a*c d g j  + 23887872b c d*e*g j  + 17915904a*b*c d e*g j  - 8957952b c*e g j  + 4478976a*b c*d*e g j  - 60466176a c*d e g j  + 7464960a*b e g j  - 3359232a b*d*e g j  - 17915904b c*d*f*g j  + 67184640a*b c*d f*g j  + 80621568a c*d f*g j  + 11943936b e*f*g j  - 71663616a*b d*e*f*g j  + 67184640a b*d e*f*g j  + 11943936b c g j  + 53747712a*b*c d*g j  - 107495424a*b c e*g j  + 80621568a c d*e*g j  + 100776960a b*c*e g j  - 30233088a e g j  + 53747712a*b c*f*g j  - 362797056a b*c*d*f*g j  + 80621568a b e*f*g j  - 120932352a d*e*f*g j  - 80621568a c g j  + 362797056a c*f*g j  - 663552b c d h*j  + 165888b c*d e*h*j  + 1990656a*b*c*d e*h*j  - 414720b d e h*j  + 3234816a*b d e h*j  - 8957952a d e h*j  + 497664b d f*h*j  - 4976640a*b d f*h*j  + 11943936a d f*h*j  + 4976640b c d g*h*j  + 1990656b c*d*e*g*h*j  - 40310784a*b c*d e*g*h*j  + 53747712a c*d e*g*h*j  - 995328b e g*h*j  + 7464960a*b d*e g*h*j  + 4478976a b*d e g*h*j  - 1990656b d*f*g*h*j  + 25380864a*b d f*g*h*j  - 71663616a b*d f*g*h*j  - 11943936b c g h*j  + 17915904a*b c d*g h*j  - 53747712a c d g h*j  + 53747712a*b c*e*g h*j  - 67184640a b*c*d*e*g h*j  - 60466176a b e g h*j  + 100776960a d*e g h*j  - 17915904a*b f*g h*j  + 67184640a b d*f*g h*j  + 80621568a d f*g h*j  + 80621568a b*c g h*j  - 120932352a c*e*g h*j  - 120932352a b*f*g h*j  - 663552b c*d h j  + 4976640a*b c*d h j  - 11943936a c*d h j  + 1327104b d*e*h j  - 10948608a*b d e*h j  + 23887872a b*d e*h j  + 17915904a b*c*d g*h j  + 17915904a b d*e*g*h j  - 107495424a d e*g*h j  - 53747712a b c*g h j  + 80621568a c*d*g h j  + 80621568a b*e*g h j  - 884736b h j  + 7962624a*b d*h j  - 20901888a b d h j  + 11943936a d h j  - 11943936a b g*h j  + 53747712a b*d*g*h j  - 80621568a g h j  + 497664b c*d i*j  - 1990656a*b*c*d i*j  + 497664b d e*i*j  - 4976640a*b d e*i*j  + 11943936a d e*i*j  - 4976640b c*d g*i*j  + 25380864a*b c*d g*i*j  - 17915904a c*d g*i*j  - 1990656b d*e*g*i*j  + 25380864a*b d e*g*i*j  - 71663616a b*d e*g*i*j  + 11943936b c*g i*j  - 71663616a*b c*d*g i*j  + 67184640a b*c*d g i*j  - 17915904a*b e*g i*j  + 67184640a b d*e*g i*j  + 80621568a d e*g i*j  + 80621568a b c*g i*j  - 120932352a c*d*g i*j  - 120932352a b*e*g i*j  - 995328b d h*i*j  + 8460288a*b d h*i*j  - 17915904a b*d h*i*j  + 3981312b g*h*i*j  - 35831808a*b d*g*h*i*j  + 67184640a b d g*h*i*j  + 53747712a d g*h*i*j  + 80621568a b g h*i*j  - 362797056a b*d*g h*i*j  + 362797056a g h*i*j  - 373248b d j  + 2985984a*b d j  - 5971968a d j  + 2985984b d g*j  - 25380864a*b d g*j  + 53747712a b*d g*j  - 5971968b g j  + 53747712a*b d*g j  - 100776960a b d g j  - 80621568a d g j  - 80621568a b g j  + 362797056a b*d*g j  - 272097792a g j

o30 : S

i31 : numgens detDiscr

o31 = 1

i32 : # terms detDiscr_0

o32 = 2040

i33 : clearAll

i34 : S = QQ[a,b,x,y, MonomialOrder => Eliminate 2];

i35 : I1 = ideal(x-a, y-a, a^2-2);

o35 : Ideal of S

i36 : ideal selectInSubring(1, gens gb I1)

                     2
o36 = ideal (x - y, y  - 2)

o36 : Ideal of S

i37 : I2 = ideal(x-a, y-b, a^2-2, b^2-3);

o37 : Ideal of S

i38 : ideal selectInSubring(1, gens gb I2)

              2       2
o38 = ideal (y  - 3, x  - 2)

o38 : Ideal of S

i39 : I3 = ideal(x-a, y-a^4, a^4+a^3+a^2+a+1);

o39 : Ideal of S

i40 : ideal selectInSubring(1, gens gb I3)

                       2    2               3    2
o40 = ideal (x*y - 1, x  + y  + x + y + 1, y  + y  + x + y + 1)

o40 : Ideal of S

i41 : I4 = ideal(a*x+b*y, a^2-2, b^2-3);

o41 : Ideal of S

i42 : ideal selectInSubring(1, gens gb I4)

              2     2
o42 = ideal(2x  - 3y )

o42 : Ideal of S

i43 : I5 = ideal(a*x+b*y-1, a^2-2, b^2-3);

o43 : Ideal of S

i44 : ideal selectInSubring(1, gens gb I5)

              4      2 2     4     2     2
o44 = ideal(4x  - 12x y  + 9y  - 4x  - 6y  + 1)

o44 : Ideal of S

i45 : clearAll

i46 : S = QQ[x, y, z];

i47 : I = ideal(x^5+y^3+z^3, x^3+y^5+z^3, x^3+y^3+z^5);

o47 : Ideal of S

i48 : degree(I : saturate(I))

o48 = 27

i49 : clearAll

i50 : PP3 = QQ[t, x, y, z, w];

i51 : L = ideal(x, y);

o51 : Ideal of PP3

i52 : M = ideal(x-t*z, y+t^2*w);

o52 : Ideal of PP3

i53 : X = intersect(L, M);

o53 : Ideal of PP3

i54 : Xzero = trim substitute(saturate(X, t), {t => 0})

                   2        2
o54 = ideal (y*z, y , x*y, x )

o54 : Ideal of PP3

i55 : Xzero == intersect(ideal(x^2, y), ideal(x, y^2, z))

o55 = true

i56 : degree(ideal(x^2, y ) / ideal(x, y^2, z))

o56 = 1

i57 : clearAll

i58 : S = QQ[a, b, c, d, e];

i59 : IX = trim minors(2, matrix{{a, b^2, b*d, c},{b, a*c, c^2, d}})

                         3      2     2    2    3    2
o59 = ideal (b*c - a*d, c  - b*d , a*c  - b d, b  - a c)

o59 : Ideal of S

i60 : IY = ideal(a, d);

o60 : Ideal of S

i61 : codim IX + codim IY == codim (IX + IY)

o61 = true

i62 : (degree IX) * (degree IY)

o62 = 4

i63 : degree (IX + IY)

o63 = 5

i64 : J = ideal mingens (IX + ideal(a))

                      2    3      2   3
o64 = ideal (a, b*c, b d, c  - b*d , b )

o64 : Ideal of S

i65 : J == intersect(ideal(a, b*c, b^2, c^3-b*d^2), 
           ideal(a, d, b*c, c^3, b^3)) -- embedded point

o65 = true

i66 : clearAll

i67 : blowUpIdeal = (I) -> (
           r := numgens I;
           S := ring I;
           n := numgens S;
           K := coefficientRing S;
           tR := K[t, gens S, vars(0..r-1), 
                     MonomialOrder => Eliminate 1];
           f := map(tR, S, submatrix(vars tR, {1..n}));
           F := f(gens I);
           J := ideal apply(1..r, j -> (gens tR)_(n+j)-t*F_(0,(j-1)));
           L := ideal selectInSubring(1, gens gb J);
           R := K[gens S, vars(0..r-1)];
           g := map(R, tR, 0 | vars R);
           trim g(L));

i68 : S = QQ[x, y];

i69 : I = ideal(x^3, x*y, y^2);

o69 : Ideal of S

i70 : J = blowUpIdeal(I)

                           2         2
o70 = ideal (y*b - x*c, x*b  - a*c, x b - y*a)

o70 : Ideal of QQ[x, y, a, b, c]

i71 : saturate(J + minors(2, jacobian J)) == 1

o71 = true

i72 : clearAll

i73 : PP4 = QQ[a..e];

i74 : S = QQ[r..t, A..E, MonomialOrder => Eliminate 3];

i75 : I = ideal(A - r^2, B - s^2, C - r*s, D - r*t, E - s*t);

o75 : Ideal of S

i76 : phi = map(PP4, S, matrix{{0_PP4, 0_PP4, 0_PP4}} | vars PP4)

o76 = map(PP4,S,{0, 0, 0, a, b, c, d, e})

o76 : RingMap PP4 <--- S

i77 : surfaceA = phi ideal selectInSubring(1, gens gb I)

                                          2
o77 = ideal (c*d - a*e, b*d - c*e, a*b - c )

o77 : Ideal of PP4

i78 : R = QQ[t, x, y, z, u, v, MonomialOrder => Eliminate 1];

i79 : blowUpIdeal = ideal selectInSubring(1, gens gb ideal(u-t*x, 
           v-t*y))

o79 = ideal(y*u - x*v)

o79 : Ideal of R

i80 : PP2xPP1 = QQ[x, y, z, u, v];

i81 : embed = map(PP2xPP1, R, 0 | vars PP2xPP1);

o81 : RingMap PP2xPP1 <--- R

i82 : blowUp = PP2xPP1 / embed(blowUpIdeal);

i83 : PP5 = QQ[A .. F];

i84 : segre = map(blowUp, PP5, matrix{{x*u,y*u,z*u,x*v,y*v,z*v}});

o84 : RingMap blowUp <--- PP5

i85 : ker segre

                                2
o85 = ideal (B - D, C*E - D*F, D  - A*E, C*D - A*F)

o85 : Ideal of PP5

i86 : projection = map(PP4, PP5, matrix{{a, c, d, c, b, e}})

o86 = map(PP4,PP5,{a, c, d, c, b, e})

o86 : RingMap PP4 <--- PP5

i87 : surfaceB = trim projection ker segre

                                          2
o87 = ideal (c*d - a*e, b*d - c*e, a*b - c )

o87 : Ideal of PP4

i88 : determinantal = minors(2, matrix{{a, c, d}, {b, d, e}})

                                          2
o88 = ideal (- b*c + a*d, - b*d + a*e, - d  + c*e)

o88 : Ideal of PP4

i89 : sigma = map( PP4, PP4, matrix{{d, e, a, c, b}});

o89 : RingMap PP4 <--- PP4

i90 : surfaceC = sigma determinantal

                                          2
o90 = ideal (c*d - a*e, b*d - c*e, a*b - c )

o90 : Ideal of PP4

i91 : surfaceA == surfaceB

o91 = true

i92 : surfaceB == surfaceC

o92 = true

i93 : clearAll

i94 : PP3 = QQ[t, x, y, z, w];

i95 : Q = ideal( t*x^2+t*y^2+t*z^2+w^2 );

o95 : Ideal of PP3

i96 : R = QQ[t, u, v, A .. H];

i97 : phi = map(R, PP3, matrix{{t}} | 
              u*matrix{{A, B, C, D}} + v*matrix{{E, F, G, H}});

o97 : RingMap R <--- PP3

i98 : imageFamily = phi Q;

o98 : Ideal of R

i99 : coeffOfFamily = contract(matrix{{u^2,u*v,v^2}}, gens imageFamily)

o99 = | tA2+tB2+tC2+D2 2tAE+2tBF+2tCG+2DH tE2+tF2+tG2+H2 |

              1       3
o99 : Matrix R  <--- R

i100 : S = QQ[t, A..H];

i101 : coeffOfFamily = substitute(coeffOfFamily, S);

               1       3
o101 : Matrix S  <--- S

i102 : Sbar = S / (ideal coeffOfFamily);

i103 : psi = matrix{{t}} | exteriorPower(2, 
                   matrix{{A, B, C, D}, {E, F, G, H}})

o103 = | t -BE+AF -CE+AG -CF+BG -DE+AH -DF+BH -DG+CH |

                  1          7
o103 : Matrix Sbar  <--- Sbar

i104 : PP5 = QQ[t, a..f];

i105 : fanoOfFamily = trim ker map(Sbar, PP5, psi);

o105 : Ideal of PP5

i106 : zeroFibre = trim substitute(saturate(fanoOfFamily, t), {t=>0})

               2             2                   2                                          2    2    2
o106 = ideal (f , e*f, d*f, e , d*e, a*e + b*f, d , c*d - b*e + a*f, b*d + c*e, a*d - c*f, a  + b  + c )

o106 : Ideal of PP5

i107 : transpose gens zeroFibre

o107 = {-2} | f2       |
       {-2} | ef       |
       {-2} | df       |
       {-2} | e2       |
       {-2} | de       |
       {-2} | ae+bf    |
       {-2} | d2       |
       {-2} | cd-be+af |
       {-2} | bd+ce    |
       {-2} | ad-cf    |
       {-2} | a2+b2+c2 |

                 11         1
o107 : Matrix PP5   <--- PP5

i108 : oneFibre = trim substitute(saturate(fanoOfFamily, t), {t => 1})

                          2    2    2                                          2    2    2                         2    2              2    2
o108 = ideal (a*e + b*f, d  + e  + f , c*d - b*e + a*f, b*d + c*e, a*d - c*f, c  + e  + f , b*c + d*e, a*c - d*f, b  - e , a*b + e*f, a  - f )

o108 : Ideal of PP5

i109 : oneFibre == intersect(ideal(c-d, b+e, a-f, d^2+e^2+f^2), 
            ideal(c+d, b-e, a+f, d^2+e^2+f^2))

o109 = true

i110 : 
