-- -*- M2-comint -*-

i1 : s = "x"

o1 = x

i2 : class(s^0)

o2 = Net

o2 : Type

i3 : n = s^1|"ij"

     x
o3 =  ij

i4 : n^-3

o4 = 

     x
      ij

i5 : 
