-- -*- M2-comint -*-

i1 : R = QQ[x,y];

i2 : f = x^3 + 99*y;

i3 : f[1000,3]

o3 = 1000000297

i4 : 
