-- -*- M2-comint -*-

i1 : R = QQ[a..d,MonomialOrder=>{Weights => {-1,2,3,4}},Global=>false];

i2 : f = a^2 + b+ c^2 + b*d

      2              2
o2 = c  + b*d + b + a

o2 : R

i3 : leadTerm f

      2
o3 = c

o3 : R

i4 : leadTerm(1,ideal(f))

o4 = | c2+bd |

             1       1
o4 : Matrix R  <--- R

i5 : R = QQ[a..d,MonomialOrder=>{Weights => {1,2,3,4}, Weights => {2,4,2,1}}];

i6 : f = a^6 + b^3+ c^2

      6    3    2
o6 = a  + b  + c

o6 : R

i7 : leadTerm(f)

      6
o7 = a

o7 : R

i8 : leadTerm(1, ideal(f))

o8 = | a6+b3+c2 |

             1       1
o8 : Matrix R  <--- R

i9 : leadTerm(2, ideal(f))

o9 = | a6+b3 |

             1       1
o9 : Matrix R  <--- R

i10 : leadTerm(3, ideal(f))

o10 = | a6 |

              1       1
o10 : Matrix R  <--- R

i11 : R = QQ[a..d,MonomialOrder=>{Weights => {1,2}, Lex}];

i12 : f = a^2 + b+ c^2 + b*d

       2              2
o12 = a  + b*d + b + c

o12 : R

i13 : 
