
i1 : run "uname -a"
Linux rhodium 2.6.11 #3 SMP Tue Jun 28 07:39:29 CDT 2005 i686 unknown unknown GNU/Linux

o1 = 0

i2 : peek get "!uname -a"

o2 = "Linux rhodium 2.6.11 #3 SMP Tue Jun 28 07:39:29 CDT 2005 i686 unknown
     unknown GNU/Linux\n"

i3 : f = openInOut "!egrep '^in'"

o3 = !egrep '^in'

o3 : File

i4 : scan(keys Macaulay2Core.Dictionary, key -> f << key << endl)

i5 : f << closeOut

o5 = !egrep '^in'

o5 : File

i6 : get f

o6 = interpreterDepth
     infoHelp
     integrate
     inducedMap
     installPackage
     installMethod
     integralClosure
     infoTagConvert
     instance
     info
     intersect
     input
     index
     indexComponents
     installAssignmentMethod
     infinity
     inducesWellDefinedMap
     inverse
     indexHtml
     indices
     incomparable
     indeterminate
     in
     independentSets

i7 : f = openIn "!sleep 5; echo -n the answer is 4"

o7 = !sleep 5; echo -n the answer is 4

o7 : File

i8 : isReady f

o8 = false

o8 : Boolean

i9 : while not isReady f do (sleep 1; << "." << flush)
.....
i10 : read f

o10 = the answer is 4

i11 : isReady f

o11 = true

o11 : Boolean

i12 : atEndOfFile f

o12 = true

o12 : Boolean

i13 : close f

o13 = !sleep 5; echo -n the answer is 4

o13 : File

i14 : 
