-- -*- M2-comint -*-

i1 : R = (ZZ[x,y])^3;

i2 : v = vector {1,x,x*y};

i3 : entries v

o3 = {1, x, x*y}

o3 : List

i4 : 
