--package "Macaulay2Core" loaded
--package "PrimaryDecomposition" loaded
--loading the Macaulay2 documentation
--package "Macaulay2" loaded

i1 : R = ZZ/101[x,y,z,w]

o1 = R

o1 : PolynomialRing

i2 : I = ideal(x*y-z^2,y^2-w^2,w^4)

                   2   2    2   4
o2 = ideal (x*y - z , y  - w , w )

o2 : Ideal of R

i3 : gb(I,SyzygyLimit => 1, Syzygies => true)

o3 = GroebnerBasis[status: SyzygyLimit; all S-pairs handled up to degree 4]

o3 : GroebnerBasis

i4 : syz oo

o4 = {2} | -y2+w2 -xy2+xw2 |
     {2} | xy-z2  x2y-xz2  |
     {4} | 0      0        |

             3       2
o4 : Matrix R  <--- R

i5 : gb(I,SyzygyLimit => 2, Syzygies => true)

o5 = GroebnerBasis[status: SyzygyLimit; all S-pairs handled up to degree 5]

o5 : GroebnerBasis

i6 : syz oo

o6 = {2} | -y2+w2 -xy2+xw2 0     |
     {2} | xy-z2  x2y-xz2  -w4   |
     {4} | 0      0        y2-w2 |

             3       3
o6 : Matrix R  <--- R

i7 : gb(I,SyzygyLimit => infinity, Syzygies => true)

o7 = GroebnerBasis[status: done; S-pairs encountered up to degree 7]

o7 : GroebnerBasis

i8 : syz oo

o8 = {2} | -y2+w2 -xy2+xw2 0     -w4   yw4     xyw4+z2w4 |
     {2} | xy-z2  x2y-xz2  -w4   0     -xw4    -x2w4     |
     {4} | 0      0        y2-w2 xy-z2 yz2-xw2 z4-x2w2   |

             3       6
o8 : Matrix R  <--- R

i9 : 
