--package "Macaulay2Core" loaded
--package "PrimaryDecomposition" loaded
--loading the Macaulay2 documentation
--package "Macaulay2" loaded

i1 : R = QQ[x,y,z,w]

o1 = R

o1 : PolynomialRing

i2 : I = ideal(x*y-z,y^2-w-1,w^4-3)

                      2           4
o2 = ideal (x*y - z, y  - w - 1, w  - 3)

o2 : Ideal of R

i3 : gb(I, PairLimit => 1)

o3 = GroebnerBasis[status: done; S-pairs encountered up to degree 13]

o3 : GroebnerBasis

i4 : gb(I, PairLimit => 2)

o4 = GroebnerBasis[status: done; S-pairs encountered up to degree 13]

o4 : GroebnerBasis

i5 : gb(I, PairLimit => 3)

o5 = GroebnerBasis[status: done; S-pairs encountered up to degree 13]

o5 : GroebnerBasis

i6 : 
