-- -*- M2-comint -*-

i1 : isPolynomialRing CC

o1 = false

i2 : isPolynomialRing(ZZ/7[x,y])

o2 = true

i3 : isPolynomialRing(QQ[x,dx, WeylAlgebra => {x => dx}])

o3 = true

i4 : isPolynomialRing(GF(2)[x,y, SkewCommutative => true])

o4 = true

i5 : isPolynomialRing(ZZ/101[x,y,z]/(x^2-y*z))

o5 = false

i6 : 
