-- -*- M2-comint -*-

i1 : isCommutative(QQ[x,y])

o1 = true

i2 : isCommutative(QQ[x,y, SkewCommutative => true])

o2 = false

i3 : isCommutative(QQ[x,dx, WeylAlgebra => {x => dx}])

o3 = false

i4 : 
