-- -*- M2-comint -*-

i1 : isRing QQ

o1 = true

i2 : R = QQ[x,y];

i3 : isRing(R)

o3 = true

i4 : isRing(R^1)

o4 = false

i5 : isRing(GF(2,3)[x,dx, WeylAlgebra => {x => dx}])

o5 = true

i6 : 
