-- -*- M2-comint -*-

i1 : R = QQ[x_1..x_4];

i2 : f = matrix{{x_1..x_4}}

o2 = | x_1 x_2 x_3 x_4 |

             1       4
o2 : Matrix R  <--- R

i3 : koszul(2,f)

o3 = {1} | -x_2 -x_3 0    -x_4 0    0    |
     {1} | x_1  0    -x_3 0    -x_4 0    |
     {1} | 0    x_1  x_2  0    0    -x_4 |
     {1} | 0    0    0    x_1  x_2  x_3  |

             4       6
o3 : Matrix R  <--- R

i4 : 
