-- -*- M2-comint -*-

i1 : R = QQ[a..d];

i2 : I = ideal(a*b-c*d, a*c-b*d)

o2 = ideal (a*b - c*d, a*c - b*d)

o2 : Ideal of R

i3 : leadTerm I

o3 = | ac ab b2d |

             1       3
o3 : Matrix R  <--- R

i4 : R = ZZ[a..d][x,y,z];

i5 : I = ideal(a*x-b*y, x^3, y^3, z^3)

                        3   3   3
o5 = ideal (a*x - b*y, x , y , z )

o5 : Ideal of R

i6 : leadTerm I

o6 = | xa z3 y3 xy2b2 x2yb x3 |

             1       6
o6 : Matrix R  <--- R

i7 : 
