-- -*- M2-comint -*-

i1 : R = QQ[a..d];

i2 : leadTerm (3*b*c^2-d^3-1)

         2
o2 = 3b*c

o2 : R

i3 : S = QQ[a..d, MonomialOrder => Lex]

o3 = S

o3 : PolynomialRing

i4 : leadTerm (3*b*c^2-d^3-1)

         2
o4 = 3b*c

o4 : S

i5 : R = ZZ[a..d][x,y,z];

i6 : leadTerm((a+b)*y^2 + (b+c)*x*z)

             2
o6 = (a + b)y

o6 : R

i7 : 
