-- -*- M2-comint -*-

i1 : matrix{{1,2,3},{4,5,6}}

o1 = | 1 2 3 |
     | 4 5 6 |

              2        3
o1 : Matrix ZZ  <--- ZZ

i2 : R = QQ[x,y,z];

i3 : matrix{{x,0,2},{1,2,y}}

o3 = | x 0 2 |
     | 1 2 y |

             2       3
o3 : Matrix R  <--- R

i4 : 
