-- -*- M2-comint -*-

i1 : R = ZZ/32003[a..h];

i2 : C = res ideal(a*b, c*d, e*f)

      1      3      3      1
o2 = R  <-- R  <-- R  <-- R  <-- 0
                                  
     0      1      2      3      4

o2 : ChainComplex

i3 : C.dd

          1                    3
o3 = 0 : R  <---------------- R  : 1
               | ab cd ef |

          3                           3
     1 : R  <----------------------- R  : 2
               {2} | -cd -ef 0   |
               {2} | ab  0   -ef |
               {2} | 0   ab  cd  |

          3                   1
     2 : R  <--------------- R  : 3
               {4} | ef  |
               {4} | -cd |
               {4} | ab  |

          1
     3 : R  <----- 0 : 4
               0

o3 : ChainComplexMap

i4 : poincare C

           2     4    6
o4 = 1 - 3T  + 3T  - T

o4 : ZZ [T]

i5 : 
