-- -*- M2-comint -*-

i1 : x = (a,b,c,d,e)

o1 = (a, b, c, d, e)

o1 : Sequence

i2 : (a)

o2 = a

o2 : Symbol

i3 : append(x,f)

o3 = (a, b, c, d, e, f)

o3 : Sequence

i4 : -3 .. 3

o4 = (-3, -2, -1, 0, 1, 2, 3)

o4 : Sequence

i5 : y_1 .. y_10

o5 = (y , y , y , y , y , y , y , y , y , y  )
       1   2   3   4   5   6   7   8   9   10

o5 : Sequence

i6 : a .. p

o6 = (a, b, c, d, e, f, g, h, i, j, k, l, m, n, o, p)

o6 : Sequence

i7 : (1,1) .. (2,3)

o7 = ((1, 1), (1, 2), (1, 3), (2, 1), (2, 2), (2, 3))

o7 : Sequence

i8 : {a,1} .. {c,2}

o8 = ({a, 1}, {a, 2}, {b, 1}, {b, 2}, {c, 1}, {c, 2})

o8 : Sequence

i9 : 12:a

o9 = (a, a, a, a, a, a, a, a, a, a, a, a)

o9 : Sequence

i10 : 1:a

o10 = 1 : (a)

o10 : Sequence

i11 : z = {3 .. 6, 9, 3:12}

o11 = {(3, 4, 5, 6), 9, (12, 12, 12)}

o11 : List

i12 : splice z

o12 = {3, 4, 5, 6, 9, 12, 12, 12}

o12 : List

i13 : toList x

o13 = {a, b, c, d, e}

o13 : List

i14 : toSequence oo

o14 = (a, b, c, d, e)

o14 : Sequence

i15 : 
