-- -*- M2-comint -*-

i1 : sequence()

o1 = ()

o1 : Sequence

i2 : sequence(4)

o2 = 1 : (4)

o2 : Sequence

i3 : sequence(4,5)

o3 = (4, 5)

o3 : Sequence

i4 : identity()

o4 = ()

o4 : Sequence

i5 : identity(4)

o5 = 4

i6 : identity(4,5)

o6 = (4, 5)

o6 : Sequence

i7 : 
