-- -*- M2-comint -*-

i1 : sort {c,e,a,f,b,f}

o1 = {a, b, c, e, f, f}

o1 : List

i2 : sort {4,2,6,3,8,2}

o2 = {2, 2, 3, 4, 6, 8}

o2 : List

i3 : R = ZZ[a..d,MonomialOrder=>Lex];

i4 : sort{a*d, b^100, c^3*d}

       3    100
o4 = {c d, b   , a*d}

o4 : List

i5 : 
