-- -*- M2-comint -*-

i1 : "abcdefghij"

o1 = abcdefghij

i2 : "abcde
     fghij"

o2 = abcde
     fghij

i3 : w = "abcdefghij"

o3 = abcdefghij

i4 : u = "abc\101\102\n\tstu"

o4 = abcAB
             stu

i5 : peek u

o5 = "abcAB\n\tstu"

i6 : ///a \ n = "c"///

o6 = a \ n = "c"

i7 : ascii u

o7 = {97, 98, 99, 65, 66, 10, 9, 115, 116, 117}

o7 : List

i8 : ascii oo

o8 = abcAB
             stu

i9 : w|w|w

o9 = abcdefghijabcdefghijabcdefghij

i10 : #w

o10 = 10

i11 : w#5

o11 = f

i12 : substring(5,w)

o12 = fghij

i13 : substring(5,2,w)

o13 = fg

i14 : R = ZZ[x,y];

i15 : (x+y)^2

       2           2
o15 = x  + 2x*y + y

o15 : R

i16 : n = net oo

       2           2
o16 = x  + 2x*y + y

i17 : peek n

      +--------------+
      | 2           2|
o17 = |x  + 2x*y + y |
      +--------------+

i18 : x = "a" || "bb" || "ccc"

o18 = a
      bb
      ccc

i19 : x^2

      a
      bb
o19 = ccc

i20 : {x,x^1,x^2}

                 a
            a    bb
o20 = {a  , bb , ccc}
       bb   ccc
       ccc

o20 : List

i21 : x^2 | "-------" | x

      a
      bb
o21 = ccc-------a
                bb
                ccc

i22 : width x, height x, depth x

o22 = (3, 1, 2)

o22 : Sequence

i23 : v = unstack x

o23 = {a, bb, ccc}

o23 : List

i24 : peek oo

o24 = {"a", "bb", "ccc"}

i25 : stack v

o25 = a
      bb
      ccc

i26 : 
