-- -*- M2-comint -*-

i1 : y = tally {1,2,3,a,b,1,2,a,1,2,{a,b},{a,b},a}

o1 = Tally{{a, b} => 2}
           1 => 3
           2 => 3
           3 => 1
           a => 3
           b => 1

o1 : Tally

i2 : y_2

o2 = 3

i3 : y_5

o3 = 0

i4 : y_{a,b}

o4 = 2

i5 : 
