-- -*- M2-comint -*-

i1 : M = monoid[a..d, MonomialOrder => Eliminate 1]

o1 = M

o1 : GeneralOrderedMonoid

i2 : N = monoid[e,f,g, Degrees => {1,2,3}]

o2 = N

o2 : GeneralOrderedMonoid

i3 : P = tensor(M,N,MonomialOrder => GRevLex)

o3 = P

o3 : GeneralOrderedMonoid

i4 : describe P

o4 = P

i5 : tensor(M,M,Variables => {t_0 .. t_7}, MonomialOrder => ProductOrder{4,4})

o5 = [t , t , t , t , t , t , t , t , Degrees => {{1}, {1}, {1}, {1}, {0}, {0}, {0}, {0}}, MonomialOrder => ProductOrder{4, 4}, SkewCommutative => {}]
       0   1   2   3   4   5   6   7

o5 : GeneralOrderedMonoid

i6 : describe oo

o6 = [t , t , t , t , t , t , t , t , Degrees => {{1}, {1}, {1}, {1}, {0}, {0}, {0}, {0}}, MonomialOrder => ProductOrder{4, 4}, SkewCommutative => {}]
       0   1   2   3   4   5   6   7

i7 : tensor(ZZ/101[x,y], ZZ/101[r,s], MonomialOrder => Eliminate 2)

      ZZ
o7 = --- [x, y, r, s, Degrees => {{1}, {1}, {0}, {0}}, MonomialOrder => Eliminate{2}, SkewCommutative => {}]
     101

o7 : PolynomialRing

i8 : 
