-- -*- M2-comint -*-

i1 : x = s

o1 = s

o1 : Symbol

i2 : s = 11111111111

o2 = 11111111111

i3 : x

o3 = s

o3 : Symbol

i4 : value x

o4 = 11111111111

i5 : 
