-- -*- M2-comint -*- {* hash: -1375190031 *}
--warning: function parametersInIdeal redefined

i1 : sgr=matrix({{1,2,3},{4,5,6},{7,8,10}});

              3        3
o1 : Matrix ZZ  <--- ZZ

i2 : normaliz(sgr,0)

o2 = | 7 8 10 |
     | 1 2 3  |
     | 2 3 4  |
     | 3 4 5  |
     | 4 5 6  |

              5        3
o2 : Matrix ZZ  <--- ZZ

i3 : readNmzData("sup")

o3 = | -2 -2 3  |
     | -4 11 -6 |
     | 1  -2 1  |

              3        3
o3 : Matrix ZZ  <--- ZZ

i4 : 
