-- -*- M2-comint -*- {* hash: -882369187 *}
--warning: function parametersInIdeal redefined

i1 : R=QQ[x,y,z,w]; 

i2 : V=matrix({{0,1,2,3,4},{-1,1,2,1,3}});

              2        5
o2 : Matrix ZZ  <--- ZZ

i3 : valRingIdeal(V,R)

                                      2                   2   2   2    2  
o3 = {ideal (y, x*y, w, x*w, z, x*z, x z), ideal (z*w, x*z , z , y w, y z,
     ------------------------------------------------------------------------
        2    4     4     2   3
     x*y z, y , x*y , y*w , w )}

o3 : List

i4 : 
