
i1 : kk = ZZ/32749

o1 = kk

o1 : QuotientRing

i2 : ringP3 = kk[x_0..x_3]

o2 = ringP3

o2 : PolynomialRing

i3 : ringP1 = kk[s,t]

o3 = ringP1

o3 : PolynomialRing

i4 : cubicMap = map(ringP1,ringP3,{s^3, s^2*t, s*t^2, t^3})

                         3   2      2   3
o4 = map(ringP1,ringP3,{s , s t, s*t , t })

o4 : RingMap ringP1 <--- ringP3

i5 : idealCubic = kernel cubicMap

             2                       2
o5 = ideal (x  - x x , x x  - x x , x  - x x )
             2    1 3   1 2    0 3   1    0 2

o5 : Ideal of ringP3

i6 : idealCubic2 = monomialCurveIdeal(ringP3,{1,2,3})

             2                       2
o6 = ideal (x  - x x , x x  - x x , x  - x x )
             2    1 3   1 2    0 3   1    0 2

o6 : Ideal of ringP3

i7 : M = matrix{{x_0,x_1,x_2},{x_1,x_2,x_3}}

o7 = | x_0 x_1 x_2 |
     | x_1 x_2 x_3 |

                  2            3
o7 : Matrix ringP3  <--- ringP3

i8 : idealCubic3 = minors(2, M)

               2                           2
o8 = ideal (- x  + x x , - x x  + x x , - x  + x x )
               1    0 2     1 2    0 3     2    1 3

o8 : Ideal of ringP3

i9 : codim idealCubic

o9 = 2

i10 : degree idealCubic

o10 = 3

i11 : dim idealCubic

o11 = 2

i12 : gens idealCubic

o12 = | x_2^2-x_1x_3 x_1x_2-x_0x_3 x_1^2-x_0x_2 |

                   1            3
o12 : Matrix ringP3  <--- ringP3

i13 : 0 == (gens idealCubic)%(gens idealCubic3)

o13 = true

i14 : idealCubic == idealCubic3

o14 = true

i15 : f = vars ringP3

o15 = | x_0 x_1 x_2 x_3 |

                   1            4
o15 : Matrix ringP3  <--- ringP3

i16 : OmegaP3 = kernel f

o16 = image {1} | -x_1 0    -x_2 0    0    -x_3 |
            {1} | x_0  -x_2 0    0    -x_3 0    |
            {1} | 0    x_1  x_0  -x_3 0    0    |
            {1} | 0    0    0    x_2  x_1  x_0  |

                                        4
o16 : ringP3-module, submodule of ringP3

i17 : g=generators OmegaP3

o17 = {1} | -x_1 0    -x_2 0    0    -x_3 |
      {1} | x_0  -x_2 0    0    -x_3 0    |
      {1} | 0    x_1  x_0  -x_3 0    0    |
      {1} | 0    0    0    x_2  x_1  x_0  |

                   4            6
o17 : Matrix ringP3  <--- ringP3

i18 : OmegaP3=image g

o18 = image {1} | -x_1 0    -x_2 0    0    -x_3 |
            {1} | x_0  -x_2 0    0    -x_3 0    |
            {1} | 0    x_1  x_0  -x_3 0    0    |
            {1} | 0    0    0    x_2  x_1  x_0  |

                                        4
o18 : ringP3-module, submodule of ringP3

i19 : presentation OmegaP3

o19 = {2} | x_2  0    0    x_3  |
      {2} | x_0  x_3  0    0    |
      {2} | -x_1 0    x_3  0    |
      {2} | 0    x_1  x_0  0    |
      {2} | 0    -x_2 0    x_0  |
      {2} | 0    0    -x_2 -x_1 |

                   6            4
o19 : Matrix ringP3  <--- ringP3

i20 : G = res coker f

            1           4           6           4           1
o20 = ringP3  <-- ringP3  <-- ringP3  <-- ringP3  <-- ringP3  <-- 0
                                                                   
      0           1           2           3           4           5

o20 : ChainComplex

i21 : G.dd

                1                                4
o21 = 0 : ringP3  <----------------------- ringP3  : 1
                     | x_0 x_1 x_2 x_3 |

                4                                                  6
      1 : ringP3  <----------------------------------------- ringP3  : 2
                     {1} | -x_1 -x_2 0    -x_3 0    0    |
                     {1} | x_0  0    -x_2 0    -x_3 0    |
                     {1} | 0    x_0  x_1  0    0    -x_3 |
                     {1} | 0    0    0    x_0  x_1  x_2  |

                6                                        4
      2 : ringP3  <------------------------------- ringP3  : 3
                     {2} | x_2  x_3  0    0    |
                     {2} | -x_1 0    x_3  0    |
                     {2} | x_0  0    0    x_3  |
                     {2} | 0    -x_1 -x_2 0    |
                     {2} | 0    x_0  0    -x_2 |
                     {2} | 0    0    x_0  x_1  |

                4                         1
      3 : ringP3  <---------------- ringP3  : 4
                     {3} | -x_3 |
                     {3} | x_2  |
                     {3} | -x_1 |
                     {3} | x_0  |

                1
      4 : ringP3  <----- 0 : 5
                     0

o21 : ChainComplexMap

i22 : G.dd_2

o22 = {1} | -x_1 -x_2 0    -x_3 0    0    |
      {1} | x_0  0    -x_2 0    -x_3 0    |
      {1} | 0    x_0  x_1  0    0    -x_3 |
      {1} | 0    0    0    x_0  x_1  x_2  |

                   4            6
o22 : Matrix ringP3  <--- ringP3

i23 : degrees source G.dd_2

o23 = {{2}, {2}, {2}, {2}, {2}, {2}}

o23 : List

i24 : degrees target G.dd_2

o24 = {{1}, {1}, {1}, {1}}

o24 : List

i25 : betti G

             0 1 2 3 4
o25 = total: 1 4 6 4 1
          0: 1 4 6 4 1

o25 : BettiTally

i26 : m = matrix{{x_0^3, x_1^2, x_2,x_3},{x_1^3,x_2^2,x_3,0}}

o26 = | x_0^3 x_1^2 x_2 x_3 |
      | x_1^3 x_2^2 x_3 0   |

                   2            4
o26 : Matrix ringP3  <--- ringP3

i27 : I = minors(2,m)

                5    3 2     3      3       3    2      3      2      2
o27 = ideal (- x  + x x , - x x  + x x , - x  + x x , -x x , -x x , -x )
                1    0 2     1 2    0 3     2    1 3    1 3    2 3    3

o27 : Ideal of ringP3

i28 : F = res(ringP3^1/I)

            1           6           8           3
o28 = ringP3  <-- ringP3  <-- ringP3  <-- ringP3  <-- 0
                                                       
      0           1           2           3           4

o28 : ChainComplex

i29 : betti F

             0 1 2 3
o29 = total: 1 6 8 3
          0: 1 . . .
          1: . 1 . .
          2: . 2 2 .
          3: . 2 2 .
          4: . 1 4 3

o29 : BettiTally

i30 : betti G

             0 1 2 3 4
o30 = total: 1 4 6 4 1
          0: 1 4 6 4 1

o30 : BettiTally

i31 : OmegaP3res = kernel (f ** (ringP3^1/idealCubic))

o31 = subquotient ({1} | -x_3 -x_2 -x_1 0    -x_3 -x_2 0    0    -x_3 |, {1} | x_2^2-x_1x_3 x_1x_2-x_0x_3 x_1^2-x_0x_2 0            0             0            0            0             0            0            0             0            |)
                   {1} | x_2  x_1  x_0  -x_3 0    0    0    -x_3 0    |  {1} | 0            0             0            x_2^2-x_1x_3 x_1x_2-x_0x_3 x_1^2-x_0x_2 0            0             0            0            0             0            |
                   {1} | 0    0    0    x_2  x_1  x_0  -x_3 0    0    |  {1} | 0            0             0            0            0             0            x_2^2-x_1x_3 x_1x_2-x_0x_3 x_1^2-x_0x_2 0            0             0            |
                   {1} | 0    0    0    0    0    0    x_2  x_1  x_0  |  {1} | 0            0             0            0            0             0            0            0             0            x_2^2-x_1x_3 x_1x_2-x_0x_3 x_1^2-x_0x_2 |

                                          4
o31 : ringP3-module, subquotient of ringP3

i32 : delta1 = jacobian idealCubic

o32 = {1} | 0    -x_3 -x_2 |
      {1} | -x_3 x_2  2x_1 |
      {1} | 2x_2 x_1  -x_0 |
      {1} | -x_1 -x_0 0    |

                   4            3
o32 : Matrix ringP3  <--- ringP3

i33 : delta2 = delta1 // (gens OmegaP3res)

o33 = {2} | 0  1  0  |
      {2} | 0  0  2  |
      {2} | 0  0  0  |
      {2} | 2  0  0  |
      {2} | 0  1  0  |
      {2} | 0  0  -1 |
      {2} | 0  0  0  |
      {2} | -1 0  0  |
      {2} | 0  -1 0  |

                   9            3
o33 : Matrix ringP3  <--- ringP3

i34 : delta = map(OmegaP3res, module idealCubic, delta2)

o34 = {2} | 0  1  0  |
      {2} | 0  0  2  |
      {2} | 0  0  0  |
      {2} | 2  0  0  |
      {2} | 0  1  0  |
      {2} | 0  0  -1 |
      {2} | 0  0  0  |
      {2} | -1 0  0  |
      {2} | 0  -1 0  |

o34 : Matrix

i35 : OmegaCubic = prune coker delta

o35 = cokernel {2} | -2x_3 -2x_2 0    -2x_3 -2x_2 -2x_1 0        0        0        0    0    -2x_3 0        0        -3x_3 -3x_2 |
               {2} | x_1   x_0   x_2  0     0     0     16374x_3 0        0        -x_3 0    0     16373x_3 0        0     0     |
               {2} | 0     0     -x_3 x_2   x_1   x_0   0        16374x_3 0        0    -x_3 0     0        16373x_3 0     0     |
               {2} | 0     0     0    0     0     0     x_1      x_0      x_2      0    0    0     0        0        0     0     |
               {2} | 0     0     0    0     0     0     0        0        16374x_3 x_2  x_1  x_0   0        0        0     0     |
               {2} | 0     0     0    0     0     0     0        0        0        0    0    0     x_3      x_2      x_1   x_0   |

                                       6
o35 : ringP3-module, quotient of ringP3

i36 : prune HH^0((sheaf OmegaCubic)(>=0))

o36 = cokernel {1} | x_2      x_1      x_0      |
               {1} | 16374x_3 16374x_2 16374x_1 |

                                       2
o36 : ringP3-module, quotient of ringP3

i37 : Cubic = Proj(ringP3/idealCubic)

o37 = Cubic

o37 : ProjectiveVariety

i38 : cotangentSheaf Cubic

o38 = cokernel {1} | -x_3 -x_2 -x_1 |
               {1} | x_2  x_1  x_0  |

                                                  2
o38 : coherent sheaf on Cubic, quotient of OO      (-1)
                                             Cubic

i39 : ringP4 = kk[x_0..x_4]

o39 = ringP4

o39 : PolynomialRing

i40 : idealX = ideal(x_1+x_3, x_2+x_4)

o40 = ideal (x  + x , x  + x )
              1    3   2    4

o40 : Ideal of ringP4

i41 : idealL1 = ideal(x_1,x_2)

o41 = ideal (x , x )
              1   2

o41 : Ideal of ringP4

i42 : idealL2 = ideal(x_3,x_4)

o42 = ideal (x , x )
              3   4

o42 : Ideal of ringP4

i43 : idealY = intersect(idealL1,idealL2)

o43 = ideal (x x , x x , x x , x x )
              2 4   1 4   2 3   1 3

o43 : Ideal of ringP4

i44 : degree(idealX+idealY)

o44 = 3

i45 : degree Tor_0(ringP4^1/idealX, ringP4^1/idealY)

o45 = 3

i46 : degree Tor_1(ringP4^1/idealX, ringP4^1/idealY)

o46 = 1

i47 : degree Tor_2(ringP4^1/idealX, ringP4^1/idealY)

o47 = 0

i48 : res (ringP4^1/idealX)

            1           2           1
o48 = ringP4  <-- ringP4  <-- ringP4  <-- 0
                                           
      0           1           2           3

o48 : ChainComplex

i49 : ringP3 = kk[x_0..x_3];

i50 : load "mystery.m2"

i51 : idealX = mystery ringP3

              4       2      2        2 2   2 2           2           3           2               2             3     2 2         4          3            2 2             3          3 2             3             3     3           3 2        3             2                  2             3           2 3           4   5     2 3       4       3       3         2   2            2       2 2   2 4        4             3 2          2 3            4      5         3 2        3   2    2   3              3          2 3    6
o51 = ideal (x  - 2x x x  - x x x  + x x , x x  - 10915x x x  - 10917x x  + 10916x x x  - 10916x x x  - 10916x x , x x x  + 11909x x  + 5954x x x  + 2977x x x  + 11910x x x  - 2978x x  + 14887x x x  + 11910x x x , x x x  - 13099x x  - 6550x x x  - 13100x x x x  - 6550x x x x  + 13099x x x  + 13100x x  + 13099x x , x  + 5x x  + 5x x  - 3x x x  - 4x x x  + 4x x x  + 10x x x x  + 5x x x , x x  - 8932x x x  + 11909x x x  + 5954x x x  - 8934x x x  - x x  + 2x x x  - 5952x x x  - x x x  - 2979x x x x  - 8934x x x  + x )
              1     0 1 3    1 2 3    0 3   0 1         0 1 2         0 3         0 2 3         0 2 3         1 3   0 1 2         0 3        0 2 3        0 2 3         0 2 3        1 3         0 1 3         1 2 3   0 1 2         1 2        0 1 3         0 1 2 3        0 1 2 3         1 2 3         1 3         0 3   0     0 2     0 2     0 1 3     1 2 3     0 1 3      0 1 2 3     1 2 3   1 2        0 2 3         0 2 3        0 2 3        0 2 3    2 3     0 1 3        1 2 3    0 1 3        0 1 2 3        1 2 3    3

o51 : Ideal of ringP3

i52 : prettyPrint gens idealX
x_1^4-2*x_0*x_1^2*x_3-x_1^2*x_2*x_3+x_0^2*x_3^2,
x_0^2*x_1^2-10915*x_0*x_1^2*x_2-10917*x_0^3*x_3+10916*x_0^2*x_2*x_3-
   10916*x_0*x_2^2*x_3-10916*x_1*x_3^3,
x_0*x_1^2*x_2^2+11909*x_0^4*x_3+5954*x_0^3*x_2*x_3+2977*x_0^2*x_2^2*x_3+
   11910*x_0*x_2^3*x_3-2978*x_1^3*x_3^2+14887*x_0*x_1*x_3^3+
   11910*x_1*x_2*x_3^3,
x_0*x_1^3*x_2-13099*x_1^3*x_2^2-6550*x_0^3*x_1*x_3-
   13100*x_0^2*x_1*x_2*x_3-6550*x_0*x_1*x_2^2*x_3+13099*x_1*x_2^3*x_3+
   13100*x_1^2*x_3^3+13099*x_0*x_3^4,
x_0^5+5*x_0^2*x_2^3+5*x_0*x_2^4-3*x_0*x_1^3*x_3-4*x_1^3*x_2*x_3+
   4*x_0^2*x_1*x_3^2+10*x_0*x_1*x_2*x_3^2+5*x_1*x_2^2*x_3^2,
x_1^2*x_2^4-8932*x_0^4*x_2*x_3+11909*x_0^3*x_2^2*x_3+5954*x_0^2*x_2^3*x_3-
   8934*x_0*x_2^4*x_3-x_2^5*x_3+2*x_0*x_1^3*x_3^2-5952*x_1^3*x_2*x_3^2-
   x_0^2*x_1*x_3^3-2979*x_0*x_1*x_2*x_3^3-8934*x_1*x_2^2*x_3^3+x_3^6

i53 : X = variety idealX

o53 = X

o53 : ProjectiveVariety

i54 : idealX == saturate idealX

o54 = true

i55 : dim X

o55 = 1

i56 : idealXtop = topComponents idealX

              4       2      2        2 2   2 2           2           3           2               2             3     2 2         4          3            2 2             3          3 2             3             3     3           3 2        3             2                  2             3           2 3           4   5     2 3       4       3       3         2   2            2       2 2   2 4        4             3 2          2 3            4      5         3 2        3   2    2   3              3          2 3    6
o56 = ideal (x  - 2x x x  - x x x  + x x , x x  - 10915x x x  - 10917x x  + 10916x x x  - 10916x x x  - 10916x x , x x x  + 11909x x  + 5954x x x  + 2977x x x  + 11910x x x  - 2978x x  + 14887x x x  + 11910x x x , x x x  - 13099x x  - 6550x x x  - 13100x x x x  - 6550x x x x  + 13099x x x  + 13100x x  + 13099x x , x  + 5x x  + 5x x  - 3x x x  - 4x x x  + 4x x x  + 10x x x x  + 5x x x , x x  - 8932x x x  + 11909x x x  + 5954x x x  - 8934x x x  - x x  + 2x x x  - 5952x x x  - x x x  - 2979x x x x  - 8934x x x  + x )
              1     0 1 3    1 2 3    0 3   0 1         0 1 2         0 3         0 2 3         0 2 3         1 3   0 1 2         0 3        0 2 3        0 2 3         0 2 3        1 3         0 1 3         1 2 3   0 1 2         1 2        0 1 3         0 1 2 3        0 1 2 3         1 2 3         1 3         0 3   0     0 2     0 2     0 1 3     1 2 3     0 1 3      0 1 2 3     1 2 3   1 2        0 2 3         0 2 3        0 2 3        0 2 3    2 3     0 1 3        1 2 3    0 1 3        0 1 2 3        1 2 3    3

o56 : Ideal of ringP3

i57 : (gens idealXtop)%(gens idealX) == 0

o57 = true

i58 : codim singularLocus idealX

o58 = 4

i59 : # decompose idealX

o59 = 1

i60 : HH^0 OO_X

        1
o60 = kk

o60 : kk-module, free

i61 : rank oo

o61 = 1

i62 : HH^1 OO_X

        6
o62 = kk

o62 : kk-module, free

i63 : degree idealX

o63 = 10

i64 : P3 = Proj ringP3

o64 = P3

o64 : ProjectiveVariety

i65 : HH^1((OO_P3(1)/idealX)(>=0))

o65 = cokernel | x_3 x_2 x_1 x_0 |

                                       1
o65 : ringP3-module, quotient of ringP3

i66 : degrees oo

o66 = {{0}}

o66 : List

i67 : omegaX = Ext^(codim idealX)(ringP3^1/idealX, ringP3^{-4})

o67 = cokernel {-1} | x_1^2-1702x_2x_3 x_0x_3-2553x_2x_3 x_0x_1-8086x_1x_2 x_1x_2^2-11925x_3^3             x_0^2x_2-15006x_0x_2^2+8248x_2^3+3876x_1x_3^2 x_0^3+13548x_0x_2^2+4124x_2^3-6356x_1x_3^2 |
               {0}  | 2552x_1          12014x_1          2626x_0           13438x_0^2-8515x_0x_2-6719x_2^2 11524x_3^2                                    5762x_3^2                                  |
               {0}  | -4880x_3         -7320x_3          1234x_1           11498x_1x_2                     -3715x_0^2+7197x_0x_2+13840x_2^2              7197x_0^2+10213x_0x_2+6920x_2^2            |

                                       3
o67 : ringP3-module, quotient of ringP3

i68 : dualModule = Hom(omegaX, ringP3^1/idealX)

o68 = subquotient ({1} | -2626x_1^2+12125x_0x_3                -9334x_1x_3                        -1234x_1^2+1851x_0x_3                            8188x_3^3                                                                                             -13469x_0x_1^2-6054x_1^2x_2+14617x_0^2x_3+14475x_0x_2x_3-5394x_2^2x_3 3715x_0^2x_1-7197x_0x_1x_2-13840x_1x_2^2+11989x_3^3                                -2626x_0^3+6868x_0^2x_2-6878x_0x_2^2-6878x_1x_3^2                        -7197x_0^2x_1-10213x_0x_1x_2-6920x_1x_2^2-10380x_3^3                              -1234x_0^3-617x_0^2x_2+617x_0x_2^2+617x_1x_3^2                                 -13438x_0^4+1514x_0^3x_2-8548x_0^2x_2^2+10542x_0x_2^3+447x_2^4-11923x_1^3x_3-6949x_0x_1x_3^2+9432x_1x_2x_3^2                       |, {1} | 0                                         0                                                                                         0                                         0                                                                                         x_1^4-2x_0x_1^2x_3-x_1^2x_2x_3+x_0^2x_3^2 x_0^2x_1^2-10915x_0x_1^2x_2-10917x_0^3x_3+10916x_0^2x_2x_3-10916x_0x_2^2x_3-10916x_1x_3^3 0                                                                                                                               0                                                                                                                                 0                                                                                                    0                                                                                                                               0                                                                                                                                 0                                                                                                    x_0x_1^2x_2^2+11909x_0^4x_3+5954x_0^3x_2x_3+2977x_0^2x_2^2x_3+11910x_0x_2^3x_3-2978x_1^3x_3^2+14887x_0x_1x_3^3+11910x_1x_2x_3^3 x_0x_1^3x_2-13099x_1^3x_2^2-6550x_0^3x_1x_3-13100x_0^2x_1x_2x_3-6550x_0x_1x_2^2x_3+13099x_1x_2^3x_3+13100x_1^2x_3^3+13099x_0x_3^4 x_0^5+5x_0^2x_2^3+5x_0x_2^4-3x_0x_1^3x_3-4x_1^3x_2x_3+4x_0^2x_1x_3^2+10x_0x_1x_2x_3^2+5x_1x_2^2x_3^2 0                                                                                                                                                                                  0                                                                                                                                                                                  x_1^2x_2^4-8932x_0^4x_2x_3+11909x_0^3x_2^2x_3+5954x_0^2x_2^3x_3-8934x_0x_2^4x_3-x_2^5x_3+2x_0x_1^3x_3^2-5952x_1^3x_2x_3^2-x_0^2x_1x_3^3-2979x_0x_1x_2x_3^3-8934x_1x_2^2x_3^3+x_3^6 |)
                   {0} | x_1^3+9299x_0x_1x_3+9700x_1x_2x_3     4651x_1^2x_3-14017x_0x_3^2         6303x_0x_1x_3-5069x_1x_2x_3                      x_0x_1^2x_2-13099x_1^2x_2^2-6550x_0^3x_3-13100x_0^2x_2x_3-6550x_0x_2^2x_3+13099x_2^3x_3+16374x_1x_3^3 3856x_0^2x_1x_3-7009x_0x_1x_2x_3+638x_1x_2^2x_3+10865x_3^4            5536x_0^3x_3-15821x_0^2x_2x_3-4050x_0x_2^2x_3-16141x_2^3x_3+15326x_1x_3^3          x_0^3x_1+13748x_0^2x_1x_2-4856x_0x_1x_2^2-4848x_1^2x_3^2                 2768x_0^3x_3+13344x_0^2x_2x_3+903x_0x_2^2x_3+8304x_2^3x_3+10591x_1x_3^3           -1234x_0^2x_1x_2-13840x_0x_1x_2^2-13840x_1^2x_3^2                              x_0^2x_1x_2^2-10915x_0x_1x_2^3-13636x_1x_2^4+14316x_0x_1^2x_3^2+15412x_1^2x_2x_3^2+7507x_0^2x_3^3+11854x_0x_2x_3^3+12742x_2^2x_3^3 |  {0} | x_1^4-2x_0x_1^2x_3-x_1^2x_2x_3+x_0^2x_3^2 x_0^2x_1^2-10915x_0x_1^2x_2-10917x_0^3x_3+10916x_0^2x_2x_3-10916x_0x_2^2x_3-10916x_1x_3^3 0                                         0                                                                                         0                                         0                                                                                         x_0x_1^2x_2^2+11909x_0^4x_3+5954x_0^3x_2x_3+2977x_0^2x_2^2x_3+11910x_0x_2^3x_3-2978x_1^3x_3^2+14887x_0x_1x_3^3+11910x_1x_2x_3^3 x_0x_1^3x_2-13099x_1^3x_2^2-6550x_0^3x_1x_3-13100x_0^2x_1x_2x_3-6550x_0x_1x_2^2x_3+13099x_1x_2^3x_3+13100x_1^2x_3^3+13099x_0x_3^4 x_0^5+5x_0^2x_2^3+5x_0x_2^4-3x_0x_1^3x_3-4x_1^3x_2x_3+4x_0^2x_1x_3^2+10x_0x_1x_2x_3^2+5x_1x_2^2x_3^2 0                                                                                                                               0                                                                                                                                 0                                                                                                    0                                                                                                                               0                                                                                                                                 0                                                                                                    x_1^2x_2^4-8932x_0^4x_2x_3+11909x_0^3x_2^2x_3+5954x_0^2x_2^3x_3-8934x_0x_2^4x_3-x_2^5x_3+2x_0x_1^3x_3^2-5952x_1^3x_2x_3^2-x_0^2x_1x_3^3-2979x_0x_1x_2x_3^3-8934x_1x_2^2x_3^3+x_3^6 0                                                                                                                                                                                  0                                                                                                                                                                                  |
                   {0} | -16305x_1^2x_2+8147x_0^2x_3-x_0x_2x_3 x_1^3-8565x_0x_1x_3-11589x_1x_2x_3 x_0x_1^2-8086x_1^2x_2-9301x_0^2x_3+2428x_0x_2x_3 15914x_1^2x_3^2-2072x_0x_3^3+15022x_2x_3^3                                                            x_0^3x_3-6168x_0^2x_2x_3-152x_0x_2^2x_3+727x_2^3x_3+1116x_1x_3^3      x_0^2x_1x_2-15006x_0x_1x_2^2+8248x_1x_2^3+3876x_1^2x_3^2-7519x_0x_3^3+5093x_2x_3^3 -12924x_0^3x_2-2034x_0^2x_2^2+843x_0x_2^3-8308x_0x_1x_3^2+843x_1x_2x_3^2 x_0^3x_1+13548x_0x_1x_2^2+4124x_1x_2^3-6356x_1^2x_3^2+12615x_0x_3^3-13828x_2x_3^3 x_0^4+10915x_0^3x_2+807x_0^2x_2^2+4043x_0x_2^3+4850x_0x_1x_3^2+4043x_1x_2x_3^2 -13262x_0^2x_2^3-6973x_0x_2^4+169x_2^5-14463x_0x_1x_2x_3^2-12512x_1x_2^2x_3^2+12466x_3^5                                           |  {0} | 0                                         0                                                                                         x_1^4-2x_0x_1^2x_3-x_1^2x_2x_3+x_0^2x_3^2 x_0^2x_1^2-10915x_0x_1^2x_2-10917x_0^3x_3+10916x_0^2x_2x_3-10916x_0x_2^2x_3-10916x_1x_3^3 0                                         0                                                                                         0                                                                                                                               0                                                                                                                                 0                                                                                                    x_0x_1^2x_2^2+11909x_0^4x_3+5954x_0^3x_2x_3+2977x_0^2x_2^2x_3+11910x_0x_2^3x_3-2978x_1^3x_3^2+14887x_0x_1x_3^3+11910x_1x_2x_3^3 x_0x_1^3x_2-13099x_1^3x_2^2-6550x_0^3x_1x_3-13100x_0^2x_1x_2x_3-6550x_0x_1x_2^2x_3+13099x_1x_2^3x_3+13100x_1^2x_3^3+13099x_0x_3^4 x_0^5+5x_0^2x_2^3+5x_0x_2^4-3x_0x_1^3x_3-4x_1^3x_2x_3+4x_0^2x_1x_3^2+10x_0x_1x_2x_3^2+5x_1x_2^2x_3^2 0                                                                                                                               0                                                                                                                                 0                                                                                                    0                                                                                                                                                                                  x_1^2x_2^4-8932x_0^4x_2x_3+11909x_0^3x_2^2x_3+5954x_0^2x_2^3x_3-8934x_0x_2^4x_3-x_2^5x_3+2x_0x_1^3x_3^2-5952x_1^3x_2x_3^2-x_0^2x_1x_3^3-2979x_0x_1x_2x_3^3-8934x_1x_2^2x_3^3+x_3^6 0                                                                                                                                                                                  |

                                          3
o68 : ringP3-module, subquotient of ringP3

i69 : betti prune dualModule

              0  1
o69 = total: 10 26
          3:  3  2
          4:  6 14
          5:  1  9
          6:  .  1

o69 : BettiTally

i70 : f = homomorphism dualModule_{0}

o70 = | -2626x_1^2+12125x_0x_3 x_1^3+9299x_0x_1x_3+9700x_1x_2x_3 -16305x_1^2x_2+8147x_0^2x_3-x_0x_2x_3 |

o70 : Matrix

i71 : canGens = f*basis(0,omegaX)

o71 = | -2626x_0x_1^2+12125x_0^2x_3 -2626x_1^3+12125x_0x_1x_3 -2626x_1^2x_2+12125x_0x_2x_3 -2626x_1^2x_3+12125x_0x_3^2 x_1^3+9299x_0x_1x_3+9700x_1x_2x_3 -16305x_1^2x_2+8147x_0^2x_3-x_0x_2x_3 |

o71 : Matrix

i72 : ringX = ringP3/idealX

o72 = ringX

o72 : QuotientRing

i73 : ringP5 = kk[x_0..x_5]

o73 = ringP5

o73 : PolynomialRing

i74 : idealXcan = trim kernel map(ringX, ringP5, 
                                     substitute(matrix canGens,ringX),
                                     DegreeMap => i -> 5*i)

                                     2                                    2                                                                 2               2                                                                   2                     2                              2   3                     2                                       2         2   3           2        2                        2             2          2         3     2          2        2                       2            2          2        3
o74 = ideal (x x  + 16373x x  - 5733x  - 2813x x , x x  - 8190x x  + 2454x  + 15871x x , x x  - 5836x x  - 4040x x  - 2813x x  + 7504x x , x  - x x  + 1636x  - 11252x x , x x  + 4039x x  + 16062x x  + 15871x x  - 6553x x , x  - 14179x x  + 13145x  + 472x x  + 12845x x  - 9802x , x  + 4144x x x  + 6956x x  + 9223x x x  - 1704x x x  + 10100x x  - 549x x , x  + 13726x x  + 2361x x  + 4733x x x  - 13702x x  + 13978x x  + 6659x x  + 11450x , x x  + 7184x x  - 8490x x  - 9167x x x  + 1176x x  + 4091x x  - 1273x x  - 7651x )
              2 3         1 4        4        3 5   0 3        1 4        4         3 5   1 2        0 4        2 4        1 5        4 5   1    1 4        4         3 5   0 1        0 4         2 4         1 5        4 5   0         0 2         2       0 5         2 5        5   3        0 2 4        2 4        0 4 5        2 4 5         1 5       4 5   2         1 3        3 4        0 2 5         2 5         0 5        2 5         5   0 2        1 3        3 4        0 2 5        2 5        0 5        2 5        5

o74 : Ideal of ringP5

i75 : betti res idealXcan

             0 1  2 3 4
o75 = total: 1 9 16 9 1
          0: 1 .  . . .
          1: . 6  8 3 .
          2: . 3  8 6 .
          3: . .  . . 1

o75 : BettiTally

i76 : deg2places = positions(degrees idealXcan, i->i=={2})

o76 = {0, 1, 2, 3, 4, 5}

o76 : List

i77 : idealS= ideal (gens idealXcan)_deg2places

                                     2                                    2                                                                 2               2                                                                   2                     2                              2
o77 = ideal (x x  + 16373x x  - 5733x  - 2813x x , x x  - 8190x x  + 2454x  + 15871x x , x x  - 5836x x  - 4040x x  - 2813x x  + 7504x x , x  - x x  + 1636x  - 11252x x , x x  + 4039x x  + 16062x x  + 15871x x  - 6553x x , x  - 14179x x  + 13145x  + 472x x  + 12845x x  - 9802x )
              2 3         1 4        4        3 5   0 3        1 4        4         3 5   1 2        0 4        2 4        1 5        4 5   1    1 4        4         3 5   0 1        0 4         2 4         1 5        4 5   0         0 2         2       0 5         2 5        5

o77 : Ideal of ringP5

i78 : codim singularLocus idealS

o78 = 6

i79 : omegaS = Ext^(codim idealS)(ringP5^1/idealS, ringP5^{-6})

o79 = cokernel {2} | -5836x_4 0           x_0+15871x_5 x_2-2813x_5 x_1+4039x_4 0                     -11252x_5   0               |
               {2} | x_3      x_1+4039x_4 5287x_4      -8190x_4    0           x_0-14179x_2-15399x_5 16062x_4    13145x_2-110x_5 |
               {2} | 0        -5836x_4    -8190x_4     16373x_4    -x_3        -x_2+2813x_5          x_1-4040x_4 x_0+15871x_5    |

                                       3
o79 : ringP5-module, quotient of ringP5

i80 : OS = ringP5^1/idealS

o80 = cokernel | x_2x_3+16373x_1x_4-5733x_4^2-2813x_3x_5 x_0x_3-8190x_1x_4+2454x_4^2+15871x_3x_5 x_1x_2-5836x_0x_4-4040x_2x_4-2813x_1x_5+7504x_4x_5 x_1^2-x_1x_4+1636x_4^2-11252x_3x_5 x_0x_1+4039x_0x_4+16062x_2x_4+15871x_1x_5-6553x_4x_5 x_0^2-14179x_0x_2+13145x_2^2+472x_0x_5+12845x_2x_5-9802x_5^2 |

                                       1
o80 : ringP5-module, quotient of ringP5

i81 : omegaS**omegaS

o81 = cokernel {4} | -5836x_4 0           x_0+15871x_5 x_2-2813x_5 x_1+4039x_4 0                     -11252x_5   0               0        0           0            0           0           0                     0           0               0        0           0            0           0           0                     0           0               -5836x_4 0           x_0+15871x_5 x_2-2813x_5 x_1+4039x_4 0                     -11252x_5   0               0        0           0            0           0           0                     0           0               0        0           0            0           0           0                     0           0               |
               {4} | x_3      x_1+4039x_4 5287x_4      -8190x_4    0           x_0-14179x_2-15399x_5 16062x_4    13145x_2-110x_5 0        0           0            0           0           0                     0           0               0        0           0            0           0           0                     0           0               0        0           0            0           0           0                     0           0               -5836x_4 0           x_0+15871x_5 x_2-2813x_5 x_1+4039x_4 0                     -11252x_5   0               0        0           0            0           0           0                     0           0               |
               {4} | 0        -5836x_4    -8190x_4     16373x_4    -x_3        -x_2+2813x_5          x_1-4040x_4 x_0+15871x_5    0        0           0            0           0           0                     0           0               0        0           0            0           0           0                     0           0               0        0           0            0           0           0                     0           0               0        0           0            0           0           0                     0           0               -5836x_4 0           x_0+15871x_5 x_2-2813x_5 x_1+4039x_4 0                     -11252x_5   0               |
               {4} | 0        0           0            0           0           0                     0           0               -5836x_4 0           x_0+15871x_5 x_2-2813x_5 x_1+4039x_4 0                     -11252x_5   0               0        0           0            0           0           0                     0           0               x_3      x_1+4039x_4 5287x_4      -8190x_4    0           x_0-14179x_2-15399x_5 16062x_4    13145x_2-110x_5 0        0           0            0           0           0                     0           0               0        0           0            0           0           0                     0           0               |
               {4} | 0        0           0            0           0           0                     0           0               x_3      x_1+4039x_4 5287x_4      -8190x_4    0           x_0-14179x_2-15399x_5 16062x_4    13145x_2-110x_5 0        0           0            0           0           0                     0           0               0        0           0            0           0           0                     0           0               x_3      x_1+4039x_4 5287x_4      -8190x_4    0           x_0-14179x_2-15399x_5 16062x_4    13145x_2-110x_5 0        0           0            0           0           0                     0           0               |
               {4} | 0        0           0            0           0           0                     0           0               0        -5836x_4    -8190x_4     16373x_4    -x_3        -x_2+2813x_5          x_1-4040x_4 x_0+15871x_5    0        0           0            0           0           0                     0           0               0        0           0            0           0           0                     0           0               0        0           0            0           0           0                     0           0               x_3      x_1+4039x_4 5287x_4      -8190x_4    0           x_0-14179x_2-15399x_5 16062x_4    13145x_2-110x_5 |
               {4} | 0        0           0            0           0           0                     0           0               0        0           0            0           0           0                     0           0               -5836x_4 0           x_0+15871x_5 x_2-2813x_5 x_1+4039x_4 0                     -11252x_5   0               0        -5836x_4    -8190x_4     16373x_4    -x_3        -x_2+2813x_5          x_1-4040x_4 x_0+15871x_5    0        0           0            0           0           0                     0           0               0        0           0            0           0           0                     0           0               |
               {4} | 0        0           0            0           0           0                     0           0               0        0           0            0           0           0                     0           0               x_3      x_1+4039x_4 5287x_4      -8190x_4    0           x_0-14179x_2-15399x_5 16062x_4    13145x_2-110x_5 0        0           0            0           0           0                     0           0               0        -5836x_4    -8190x_4     16373x_4    -x_3        -x_2+2813x_5          x_1-4040x_4 x_0+15871x_5    0        0           0            0           0           0                     0           0               |
               {4} | 0        0           0            0           0           0                     0           0               0        0           0            0           0           0                     0           0               0        -5836x_4    -8190x_4     16373x_4    -x_3        -x_2+2813x_5          x_1-4040x_4 x_0+15871x_5    0        0           0            0           0           0                     0           0               0        0           0            0           0           0                     0           0               0        -5836x_4    -8190x_4     16373x_4    -x_3        -x_2+2813x_5          x_1-4040x_4 x_0+15871x_5    |

                                       9
o81 : ringP5-module, quotient of ringP5

i82 : omega2S = Hom(Hom(omegaS**omegaS, OS),OS)

o82 = cokernel {3} | x_2x_3+16373x_1x_4-5733x_4^2-2813x_3x_5 x_0x_3-8190x_1x_4+2454x_4^2+15871x_3x_5 x_1x_2-5836x_0x_4-4040x_2x_4-2813x_1x_5+7504x_4x_5 x_1^2-x_1x_4+1636x_4^2-11252x_3x_5 x_0x_1+4039x_0x_4+16062x_2x_4+15871x_1x_5-6553x_4x_5 x_0^2-14179x_0x_2+13145x_2^2+472x_0x_5+12845x_2x_5-9802x_5^2 |

                                       1
o82 : ringP5-module, quotient of ringP5

i83 : L = Hom(omegaS, OS**(ringP5^{-1}))

o83 = subquotient ({-1} | 10495x_1+6812x_4 x_3         -3207x_1-9028x_4      |, {-1} | x_2x_3+16373x_1x_4-5733x_4^2-2813x_3x_5 x_0x_3-8190x_1x_4+2454x_4^2+15871x_3x_5 x_1x_2-5836x_0x_4-4040x_2x_4-2813x_1x_5+7504x_4x_5 x_1^2-x_1x_4+1636x_4^2-11252x_3x_5 x_0x_1+4039x_0x_4+16062x_2x_4+15871x_1x_5-6553x_4x_5 x_0^2-14179x_0x_2+13145x_2^2+472x_0x_5+12845x_2x_5-9802x_5^2 0                                       0                                       0                                                  0                                  0                                                    0                                                            0                                       0                                       0                                                  0                                  0                                                    0                                                            |)
                   {-1} | x_0+15871x_5     5836x_4     x_2-2813x_5           |  {-1} | 0                                       0                                       0                                                  0                                  0                                                    0                                                            x_2x_3+16373x_1x_4-5733x_4^2-2813x_3x_5 x_0x_3-8190x_1x_4+2454x_4^2+15871x_3x_5 x_1x_2-5836x_0x_4-4040x_2x_4-2813x_1x_5+7504x_4x_5 x_1^2-x_1x_4+1636x_4^2-11252x_3x_5 x_0x_1+4039x_0x_4+16062x_2x_4+15871x_1x_5-6553x_4x_5 x_0^2-14179x_0x_2+13145x_2^2+472x_0x_5+12845x_2x_5-9802x_5^2 0                                       0                                       0                                                  0                                  0                                                    0                                                            |
                   {-1} | -13145x_2+110x_5 x_1+4039x_4 x_0-14179x_2-15399x_5 |  {-1} | 0                                       0                                       0                                                  0                                  0                                                    0                                                            0                                       0                                       0                                                  0                                  0                                                    0                                                            x_2x_3+16373x_1x_4-5733x_4^2-2813x_3x_5 x_0x_3-8190x_1x_4+2454x_4^2+15871x_3x_5 x_1x_2-5836x_0x_4-4040x_2x_4-2813x_1x_5+7504x_4x_5 x_1^2-x_1x_4+1636x_4^2-11252x_3x_5 x_0x_1+4039x_0x_4+16062x_2x_4+15871x_1x_5-6553x_4x_5 x_0^2-14179x_0x_2+13145x_2^2+472x_0x_5+12845x_2x_5-9802x_5^2 |

                                          3
o83 : ringP5-module, subquotient of ringP5

i84 : dualModule = Hom(L, OS)

o84 = subquotient (| x_0+15871x_5 5460x_1-1636x_4 -13145x_2+110x_5      |, | x_2x_3+16373x_1x_4-5733x_4^2-2813x_3x_5 x_0x_3-8190x_1x_4+2454x_4^2+15871x_3x_5 x_1x_2-5836x_0x_4-4040x_2x_4-2813x_1x_5+7504x_4x_5 x_1^2-x_1x_4+1636x_4^2-11252x_3x_5 x_0x_1+4039x_0x_4+16062x_2x_4+15871x_1x_5-6553x_4x_5 x_0^2-14179x_0x_2+13145x_2^2+472x_0x_5+12845x_2x_5-9802x_5^2 0                                       0                                       0                                                  0                                  0                                                    0                                                            0                                       0                                       0                                                  0                                  0                                                    0                                                            |)
                   | 5836x_4      14807x_3        x_1+4039x_4           |  | 0                                       0                                       0                                                  0                                  0                                                    0                                                            x_2x_3+16373x_1x_4-5733x_4^2-2813x_3x_5 x_0x_3-8190x_1x_4+2454x_4^2+15871x_3x_5 x_1x_2-5836x_0x_4-4040x_2x_4-2813x_1x_5+7504x_4x_5 x_1^2-x_1x_4+1636x_4^2-11252x_3x_5 x_0x_1+4039x_0x_4+16062x_2x_4+15871x_1x_5-6553x_4x_5 x_0^2-14179x_0x_2+13145x_2^2+472x_0x_5+12845x_2x_5-9802x_5^2 0                                       0                                       0                                                  0                                  0                                                    0                                                            |
                   | x_2-2813x_5  x_1+3822x_4     x_0-14179x_2-15399x_5 |  | 0                                       0                                       0                                                  0                                  0                                                    0                                                            0                                       0                                       0                                                  0                                  0                                                    0                                                            x_2x_3+16373x_1x_4-5733x_4^2-2813x_3x_5 x_0x_3-8190x_1x_4+2454x_4^2+15871x_3x_5 x_1x_2-5836x_0x_4-4040x_2x_4-2813x_1x_5+7504x_4x_5 x_1^2-x_1x_4+1636x_4^2-11252x_3x_5 x_0x_1+4039x_0x_4+16062x_2x_4+15871x_1x_5-6553x_4x_5 x_0^2-14179x_0x_2+13145x_2^2+472x_0x_5+12845x_2x_5-9802x_5^2 |

                                          3
o84 : ringP5-module, subquotient of ringP5

i85 : betti generators dualModule

             0 1
o85 = total: 3 3
          0: 3 3

o85 : BettiTally

i86 : g = homomorphism dualModule_{0}

o86 = | x_0+15871x_5 5836x_4 x_2-2813x_5 |

o86 : Matrix

i87 : toP2 = g*basis(0,L)

o87 = | x_0+15871x_5 5836x_4 x_2-2813x_5 |

o87 : Matrix

i88 : ringXcan = ringP5/idealXcan

o88 = ringXcan

o88 : QuotientRing

i89 : ringP2 = kk[x_0..x_2]

o89 = ringP2

o89 : PolynomialRing

i90 : idealXplane = trim kernel map(ringXcan, ringP2, 
                                        substitute(matrix toP2,ringXcan))

             5        5         4         3 2        2 3          4         5
o90 = ideal(x  + 9034x  + 11794x x  + 775x x  - 5707x x  + 6069x x  + 15158x )
             0        1         0 2       0 2        0 2        0 2         2

o90 : Ideal of ringP2

i91 : ringP2 = kk[x_0..x_2]

o91 = ringP2

o91 : PolynomialRing

i92 : idealC2 = ideal(x_0^5+x_1^5+x_2^5)

             5    5    5
o92 = ideal(x  + x  + x )
             0    1    2

o92 : Ideal of ringP2

i93 : ringC2 = ringP2/idealC2

o93 = ringC2

o93 : QuotientRing

i94 : ringP5 = kk[x_0..x_5]

o94 = ringP5

o94 : PolynomialRing

i95 : idealC5 = trim kernel map(ringC2, ringP5, 
              gens (ideal vars ringC2)^2)

              2                                    2                       2          2      2      3   2      3      2   3      2      2
o95 = ideal (x  - x x , x x  - x x , x x  - x x , x  - x x , x x  - x x , x  - x x , x x  + x x  + x , x x  + x  + x x , x  + x x  + x x )
              4    3 5   2 4    1 5   2 3    1 4   2    0 5   1 2    0 4   1    0 3   0 2    3 4    5   0 1    3    4 5   0    1 3    2 5

o95 : Ideal of ringP5

i96 : ringC5 = ringP5/idealC5

o96 = ringC5

o96 : QuotientRing

i97 : use ringC5

o97 = ringC5

o97 : QuotientRing

i98 : idealC = trim kernel map(ringC5, ringP3,
              matrix{{x_0+x_1,x_2,x_3,x_5}})

              4       2      2        2 2   2 2           2           3           2               2             3     2 2         4          3            2 2             3          3 2             3             3     3           3 2        3             2                  2             3           2 3           4   5     2 3       4       3       3         2   2            2       2 2   2 4        4             3 2          2 3            4      5         3 2        3   2    2   3              3          2 3    6
o98 = ideal (x  - 2x x x  - x x x  + x x , x x  - 10915x x x  - 10917x x  + 10916x x x  - 10916x x x  - 10916x x , x x x  + 11909x x  + 5954x x x  + 2977x x x  + 11910x x x  - 2978x x  + 14887x x x  + 11910x x x , x x x  - 13099x x  - 6550x x x  - 13100x x x x  - 6550x x x x  + 13099x x x  + 13100x x  + 13099x x , x  + 5x x  + 5x x  - 3x x x  - 4x x x  + 4x x x  + 10x x x x  + 5x x x , x x  - 8932x x x  + 11909x x x  + 5954x x x  - 8934x x x  - x x  + 2x x x  - 5952x x x  - x x x  - 2979x x x x  - 8934x x x  + x )
              1     0 1 3    1 2 3    0 3   0 1         0 1 2         0 3         0 2 3         0 2 3         1 3   0 1 2         0 3        0 2 3        0 2 3         0 2 3        1 3         0 1 3         1 2 3   0 1 2         1 2        0 1 3         0 1 2 3        0 1 2 3         1 2 3         1 3         0 3   0     0 2     0 2     0 1 3     1 2 3     0 1 3      0 1 2 3     1 2 3   1 2        0 2 3         0 2 3        0 2 3        0 2 3    2 3     0 1 3        1 2 3    0 1 3        0 1 2 3        1 2 3    3

o98 : Ideal of ringP3

i99 : idealC == idealX

o99 = true

i100 : code mystery

o100 = -- ../../../../../../Macaulay2/packages/ComputationsBook/geometry/mystery.m2:1-13
       mystery = ringP3 -> (
          kk := coefficientRing ringP3;
          x := local x;
          ringP2 := kk[x_0..x_2];
          idealC2 := ideal(x_0^5+x_1^5+x_2^5);
          ringC2 := ringP2/idealC2;
          ringP5 := kk[x_0..x_5];
          idealC5 := trim kernel map(ringC2, ringP5, 
               gens (ideal vars ringC2)^2);
          ringC5 := ringP5/idealC5;
          use ringC5;
          trim kernel map(ringC5, ringP3,
             matrix{{x_0+x_1,x_2,x_3,x_5}}))

i101 : code prettyPrint

o101 = -- ../../../../../../Macaulay2/packages/ComputationsBook/geometry/mystery.m2:15-51
       prettyPrint = f -> (
          -- accept a matrix f and print its entries prettily,
          -- separated by commas
          wid := 74;
          -- page width
          post := (c,s) -> (
             -- This function concatenates string c to end of each
             -- string in list s except the last one
             concatenate \ pack_2 between_c s);
          strings := post_"," (toString \ flatten entries f);
          -- list of strings, one for each polynomial, with commas
          istate := ("",0);
          -- initial state = (out : output string, col : column number)
          strings = apply(
             strings,
             poly -> first fold(
                -- break each poly into lines
                (state,term) -> (
                   (out,col) -> (
                      if col + #term > wid -- too wide?
                      then (
                         out = out | "\n   "; 
                         col = 3;
                         -- insert line break
                         );
                      (out | term, col + #term) -- new state
                      )
                   ) state,
                istate,
                fold( -- separate poly into terms 
                   {"+","-"},
                   {poly},
                   (delimiter,poly) -> (
                        delimiterEscaped := if delimiter === "+" then "\\+" else delimiter;
                        flatten(post_delimiter \ separate_delimiterEscaped \ poly)
                      ))));
          print stack strings;  -- stack them vertically, then print
          )

i102 : 
