-- -*- M2-comint -*- hash: 257917645
--loading configuration for package "FourTiTwo" from file /home/lily/.Macaulay2/init-FourTiTwo.m2
--loading configuration for package "Topcom" from file /home/lily/.Macaulay2/init-Topcom.m2
--loading configuration for package "MonomialIntegerPrograms" from file /home/lily/.Macaulay2/init-MonomialIntegerPrograms.m2
Using default executable name "scip".
To change this, load package using CustomPath option.
Current value of ScipPrintLevel is 1.
To set a custom default value, load package using CustomScipPrintLevel option.

i1 : R = QQ[a,b,c];

i2 : ScipPrintLevel = 1;

i3 : loadBuiltinCodimAndDegree();

i4 : codim(monomialIdeal(a^2, b*a, c*b))

o4 = 2

i5 : degree(monomialIdeal(a^2, b*a, c*b))

o5 = 3

i6 : loadSCIPCodimAndDegree();

i7 : codim(monomialIdeal(a^2, b*a, c*b))
Codim files saved in directory: /tmp/M2-8610-0/0

o7 = 2

i8 : degree(monomialIdeal(a^2, b*a, c*b))
Codim files saved in directory: /tmp/M2-8610-0/1
Degree files saved in directory: /tmp/M2-8610-0/2

o8 = 3

i9 : 
