-- -*- M2-comint -*- hash: 1371438490

i1 : X = coincidentRootLocus {5,3,2,2,1,1}

o1 = CRL(5,3,2,2,1,1)

o1 : CoincidentRootLocus

i2 : dual X

o2 = CRL(11,1,1,1) * CRL(13,1) * CRL(14) * CRL(14) (dual of CRL(5,3,2,2,1,1))

o2 : JoinOfCoincidentRootLoci

i3 : Y = dual coincidentRootLocus {4,2}

o3 = CRL(4,1,1) * CRL(6) (dual of CRL(4,2))

o3 : JoinOfCoincidentRootLoci

i4 : ring Y

o4 = QQ[t , t , t , t , t , t , t ]
         0   1   2   3   4   5   6

o4 : PolynomialRing

i5 : coefficientRing Y

o5 = QQ

o5 : Ring

i6 : dim Y

o6 = 5

i7 : codim Y

o7 = 1

i8 : degree Y

o8 = 18

i9 : dual Y

o9 = CRL(4,2)

o9 : CoincidentRootLocus

i10 : G = random Y

        6      5        4 2      3 3          2 4             5           6
o10 = 3t  + 12t t  + 15t t  + 80t t  - 209655t t  + 2582604t t  - 8474625t
        0      0 1      0 1      0 1          0 1           0 1           1

o10 : QQ[t , t ]
          0   1

i11 : member(G,Y)

o11 = true

i12 : ideal Y;

o12 : Ideal of QQ[t , t , t , t , t , t , t ]
                   0   1   2   3   4   5   6

i13 : describe Y

o13 = Dual of the coincident root locus associated with the partition {4, 2} defined over QQ
      which coincides with the join of the coincident root loci associated with the partitions: ({4, 1, 1},{6})
      ambient: P^6 = Proj(QQ[t_0, t_1, t_2, t_3, t_4, t_5, t_6])
      dim    = 5
      codim  = 1
      degree = 18
      The defining polynomial has 3140 terms of degree 18

i14 : 
