-- -*- M2-comint -*- hash: -343518489

i1 : X = coincidentRootLocus {3,1,1}

o1 = CRL(3,1,1)

o1 : CoincidentRootLocus

i2 : F = generic X

       3       5      3           3            2           4        3        
o2 = t0 t1 t2 x  + (t0 t1 t2  + t0 t1 t2  + 3t0 t0 t1 t2 )x x  + (t0 t1 t2  +
       0  0  0 0      0  0  1     0  1  0      0  1  0  0  0 1      0  1  1  
     ------------------------------------------------------------------------
        2               2                  2        3 2       2           
     3t0 t0 t1 t2  + 3t0 t0 t1 t2  + 3t0 t0 t1 t2 )x x  + (3t0 t0 t1 t2  +
        0  1  0  1      0  1  1  0      0  1  0  0  0 1       0  1  1  1  
     ------------------------------------------------------------------------
           2               2           3        2 3          2        
     3t0 t0 t1 t2  + 3t0 t0 t1 t2  + t0 t1 t2 )x x  + (3t0 t0 t1 t2  +
        0  1  0  1      0  1  1  0     1  0  0  0 1       0  1  1  1  
     ------------------------------------------------------------------------
       3           3          4     3       5
     t0 t1 t2  + t0 t1 t2 )x x  + t0 t1 t2 x
       1  0  1     1  1  0  0 1     1  1  1 1

o2 : QQ[t0 , t0 , t1 , t1 , t2 , t2 ][x , x ]
          0    1    0    1    0    1   0   1

i3 : member(F,X)

o3 = true

i4 : factor F

                                                  3
o4 = (t2 x  + t2 x )(t1 x  + t1 x )(t0 x  + t0 x )
        0 0     1 1    0 0     1 1    0 0     1 1

o4 : Expression of class Product

i5 : G = generic(X,Reduce=>true)

      5 5      4      4      4    4        3 2     3         3      
o5 = t x  + (3t t  + t t  + t t )x x  + (3t t  + 3t t t  + 3t t t  +
      0 0      0 1    0 2    0 3  0 1      0 1     0 1 2     0 1 3  
     ------------------------------------------------------------------------
      3      3 2     2 3     2 2       2 2       2        2 3       3    
     t t t )x x  + (t t  + 3t t t  + 3t t t  + 3t t t t )x x  + (t t t  +
      0 2 3  0 1     0 1     0 1 2     0 1 3     0 1 2 3  0 1     0 1 2  
     ------------------------------------------------------------------------
        3         2        4    3     5
     t t t  + 3t t t t )x x  + t t t x
      0 1 3     0 1 2 3  0 1    1 2 3 1

o5 : QQ[t , t , t , t ][x , x ]
         0   1   2   3   0   1

i6 : member(G,X)

o6 = true

i7 : factor G

                                            3
o7 = (t x  + t x )(t x  + t x )(t x  + t x )
       0 0    3 1   0 0    2 1   0 0    1 1

o7 : Expression of class Product

i8 : 
