-- -*- M2-comint -*- hash: 2051741543

i1 : R := QQ[x,y];

i2 : F = 2*x^7+7*x^6*y+168*x^5*y^2+140*x^4*y^3+70*x^3*y^4+21*x^2*y^5+56*x*y^6+4*y^7

       7     6        5 2       4 3      3 4      2 5        6     7
o2 = 2x  + 7x y + 168x y  + 140x y  + 70x y  + 21x y  + 56x*y  + 4y

o2 : QQ[x, y]

i3 : realrank F

o3 = 5

i4 : Ru := QQ[u][x,y];

i5 : F = u*x^4*y+2*x^2*y^3

        4      2 3
o5 = u*x y + 2x y

o5 : QQ[u][x, y]

i6 : realrank(F,Range=>(0,infinity))

o6 = 3

i7 : realrank(F,Range=>[-1,0])

o7 = 3

i8 : realrank(F,Range=>(-infinity,-1))

o8 = 3

i9 : 
