-- -*- M2-comint -*- {* hash: -969469125 *}

i1 : z = 3-4*ii

o1 = 3-4*ii

o1 : CC (of precision 53)

i2 : z^5

o2 = -237.000000000002+3116*ii

o2 : CC (of precision 53)

i3 : 1/z

o3 = .12+.16*ii

o3 : CC (of precision 53)

i4 : +ii

o4 = ii

o4 : CC (of precision 53)

i5 : numeric_200 ii

o5 = ii

o5 : CC (of precision 200)

i6 : sort {1+ii,2+ii,1-ii,2-ii,1/2,2.1,7/5}

      1              7
o6 = {-, 1-ii, 1+ii, -, 2-ii, 2+ii, 2.1}
      2              5

o6 : List

i7 : precision z

o7 = 53

i8 : class z

o8 = CC

o8 : InexactFieldFamily

i9 : ring z

o9 = CC
       53

o9 : ComplexField

i10 : 3p100+2p90e3*ii

o10 = 3+2000*ii

o10 : CC (of precision 90)

i11 : printingPrecision

o11 = 6

i12 : x = {1/3.*ii,1/3p100*ii}

o12 = {.333333*ii, .333333*ii}

o12 : List

i13 : y = toExternalString x

o13 = {toCC(.0p53,.33333333333333331p53),
      toCC(.0p100,.33333333333333333333333333333346p100)}

i14 : value y === x

o14 = true

i15 : 
0.76user 0.06system 0:00.82elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10842minor)pagefaults 0swaps
