-- -*- M2-comint -*-

i1 : A = GF(3,2,Variable=>b);

i2 : ambient A

       ZZ
       -- [b]
        3
o2 = ----------
      2
     b  + b - 1

o2 : QuotientRing

i3 : b^8

o3 = 1

o3 : A

i4 : b^4

o4 = -1

o4 : A

i5 : K = GF 8

o5 = K

o5 : GaloisField

i6 : x = K_0

o6 = a

o6 : K

i7 : x^3+x

o7 = 1

o7 : K

i8 : 
