-- -*- M2-comint -*- {* hash: 610329196 *}

i1 : Quintic = Proj(QQ[x_0..x_4]/ideal(x_0^5+x_1^5+x_2^5+x_3^5+x_4^5-101*x_0*x_1*x_2*x_3*x_4))

o1 = Quintic

o1 : ProjectiveVariety

i2 : singularLocus(Quintic)

         /QQ [x , x , x , x , x ]\
         |     0   1   2   3   4 |
o2 = Proj|-----------------------|
         \           1           /

o2 : ProjectiveVariety

i3 : omegaQuintic = cotangentSheaf(Quintic);

i4 : h11 = rank HH^1(omegaQuintic)

o4 = 1

i5 : h12 = rank HH^2(omegaQuintic)

o5 = 101

i6 : h21 = rank HH^1(cotangentSheaf(2,Quintic))

o6 = 101

i7 : hh^(2,1)(Quintic)

o7 = 101

i8 : hh^(1,1)(Quintic)

o8 = 1

i9 : euler(Quintic)

o9 = -200

i10 : SchoensQuintic = Proj(QQ[x_0..x_4]/ideal(x_0^5+x_1^5+x_2^5+x_3^5+x_4^5-5*x_0*x_1*x_2*x_3*x_4))

o10 = SchoensQuintic

o10 : ProjectiveVariety

i11 : Z = singularLocus(SchoensQuintic)

o11 = Z

o11 : ProjectiveVariety

i12 : degree Z

o12 = 125

i13 : II'Z = sheaf module ideal Z

o13 = image | x_3^4-x_0x_1x_2x_4 x_0x_1x_2x_3-x_4^4 x_2^4-x_0x_1x_3x_4 x_1^4-x_0x_2x_3x_4 x_0^4-x_1x_2x_3x_4 x_2^3x_3^3-x_0^2x_1^2x_4^2 x_1^3x_3^3-x_0^2x_2^2x_4^2 x_0^3x_3^3-x_1^2x_2^2x_4^2 x_1^2x_2^2x_3^2-x_0^3x_4^3 x_0^2x_2^2x_3^2-x_1^3x_4^3 x_0^2x_1^2x_3^2-x_2^3x_4^3 x_1^3x_2^3-x_0^2x_3^2x_4^2 x_0^3x_2^3-x_1^2x_3^2x_4^2 x_0^2x_1^2x_2^2-x_3^3x_4^3 x_0^3x_1^3-x_2^2x_3^2x_4^2 |

                                                                                                  1
o13 : coherent sheaf on Proj(QQ [x , x , x , x , x ]), subsheaf of OO
                                  0   1   2   3   4                  Proj(QQ [x , x , x , x , x ])
                                                                               0   1   2   3   4

i14 : defect = rank HH^1(II'Z(5))

o14 = 24

i15 : h11 = defect + 1

o15 = 25

i16 : quinticsJac = numgens source basis(5,ideal Z)

o16 = 25

i17 : h21 = rank HH^0(II'Z(5)) - quinticsJac

o17 = 0

i18 : chiW = euler(Quintic)+2*degree(Z)

o18 = 50

i19 : 
2.04user 0.04system 0:02.10elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+15776minor)pagefaults 0swaps
