-- -*- M2-comint -*- {* hash: 391017027 *}

i1 : R = QQ[a,b,c,x,y,z];

i2 : f = matrix{{x},{y},{z}}

o2 = | x |
     | y |
     | z |

             3       1
o2 : Matrix R  <--- R

i3 : g = matrix{{a,b,c}}

o3 = | a b c |

             1       3
o3 : Matrix R  <--- R

i4 : f*g

o4 = | ax bx cx |
     | ay by cy |
     | az bz cz |

             3       3
o4 : Matrix R  <--- R

i5 : target (f*g) == target f

o5 = true

i6 : source (f*g) == source g

o6 = true

i7 : isHomogeneous (f*g)

o7 = true

i8 : degree(f*g)

o8 = {1}

o8 : List

i9 : h = map(f*g,Degree=>0)

o9 = | ax bx cx |
     | ay by cy |
     | az bz cz |

             3       3
o9 : Matrix R  <--- R

i10 : degree h

o10 = {0}

o10 : List

i11 : degrees source h

o11 = {{2}, {2}, {2}}

o11 : List

i12 : 
0.76user 0.04system 0:00.80elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10841minor)pagefaults 0swaps
