-- -*- M2-comint -*-

i1 : R = ZZ[a..d];

i2 : f = matrix {{a,b}}

o2 = | a b |

             1       2
o2 : Matrix R  <--- R

i3 : g = transpose matrix {{c,d}}

o3 = {-1} | c |
     {-1} | d |

             2       1
o3 : Matrix R  <--- R

i4 : f ** g

o4 = {-1} | ac bc |
     {-1} | ad bd |

             2       2
o4 : Matrix R  <--- R

i5 : 
