-- -*- M2-comint -*-

i1 : A = QQ[x,y,z];

i2 : I1 = ideal(x^5*z^3, x*y*z, y*z^4);

o2 : Ideal of A

i3 : saturate(I1,z)

                5
o3 = ideal (y, x )

o3 : Ideal of A

i4 : J = I1:z

                    3   5 2
o4 = ideal (x*y, y*z , x z )

o4 : Ideal of A

i5 : k = 0;

i6 : while not isSubset(J,I1) do (
        k = k+1;
        I1 = J;
        J = I1 : z;
        );

i7 : J

                5
o7 = ideal (y, x )

o7 : Ideal of A

i8 : k

o8 = 4

i9 : 
