-- -*- M2-comint -*- {* hash: 1278223088 *}

i1 : (n,m) = (2,3);

i2 : A1 = QQ[x_1..x_n,y_1..y_m,MonomialOrder=>{n, RevLex=>m},Global=>false];

i3 : f = x_1*x_2^2 + 1 + y_1^10 + x_1*y_2^5 + y_3

        2      5             10
o3 = x x  + x y  + 1 + y  + y
      1 2    1 2        3    1

o3 : A1

i4 : 1_A1 > y_1^10

o4 = true

i5 : A2 = QQ[x_1..x_n,y_1..y_m,MonomialOrder=>{RevLex=>n, m},Global=>false];

i6 : substitute(f,A2)

      10               5      2
o6 = y   + y  + 1 + x y  + x x
      1     3        1 2    1 2

o6 : A2

i7 : x_1*y_2^5 < 1_A2

o7 = true

i8 : A3 = QQ[x_1..x_n,y_1..y_m,MonomialOrder=>{n, RevLex=>2, m-2},Global=>false];

i9 : substitute(f,A3)

        2      5             10
o9 = x x  + x y  + y  + 1 + y
      1 2    1 2    3        1

o9 : A3

i10 : 
0.77user 0.07system 0:00.86elapsed 98%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10844minor)pagefaults 0swaps
