-- -*- M2-comint -*-

i1 : R = QQ[a,b,c];

i2 : ideal(a^2-b,a^3) == ideal(b^2, a*b, a^2-b)

o2 = true

i3 : L = ideal(a^2-a-1,a^3+a+3)

             2           3
o3 = ideal (a  - a - 1, a  + a + 3)

o3 : Ideal of R

i4 : L == 1

o4 = true

i5 : L == 0

o5 = false

i6 : m = matrix{{a,b},{c,a}}

o6 = | a b |
     | c a |

             2       2
o6 : Matrix R  <--- R

i7 : n = map(R^2,R^2,m)

o7 = | a b |
     | c a |

             2       2
o7 : Matrix R  <--- R

i8 : m == n

o8 = false

i9 : source m == source n

o9 = false

i10 : m-n == 0

o10 = true

i11 : A = QQ[x,y,z]; B = QQ[x,y,z];

i13 : A == B

o13 = false

i14 : image matrix {{2,a},{1,5}} == R^2

o14 = false

i15 : image matrix {{2,a},{0,5}} == R^2

o15 = true

i16 : 
