-- -*- M2-comint -*- {* hash: 1827305393 *}

i1 : set{hi,you,there} * set{hi,us,here,you}

o1 = set {hi, you}

o1 : Set

i2 : R = QQ[a..d];

i3 : a * {b,c,d}

o3 = {a*b, a*c, a*d}

o3 : List

i4 : f = map(R,R,{b,c,a,d})

o4 = map(R,R,{b, c, a, d})

o4 : RingMap R <--- R

i5 : g = map(R,R,{(a+b)^2,b^2,c^2,d^2})

               2           2   2   2   2
o5 = map(R,R,{a  + 2a*b + b , b , c , d })

o5 : RingMap R <--- R

i6 : f*g

               2           2   2   2   2
o6 = map(R,R,{b  + 2b*c + c , c , a , d })

o6 : RingMap R <--- R

i7 : (f*g)(a) == f(g(a))

o7 = true

i8 : M = R^2; I = ideal(a+b,c);

o9 : Ideal of R

i10 : N = I*M + a*R^2

o10 = image | a+b 0   c 0 a 0 |
            | 0   a+b 0 c 0 a |

                              2
o10 : R-module, submodule of R

i11 : isHomogeneous N

o11 = true

i12 : 
0.75user 0.05system 0:00.80elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10844minor)pagefaults 0swaps
