-- -*- M2-comint -*-

i1 : R = QQ[a..l, MonomialOrder => {3,3,3,3}];

i2 : a*e^3 + a^2*c*i + a*b^2*i + b^2*e*i

        2     2       2         3
o2 = a*b i + a c*i + b e*i + a*e

o2 : R

i3 : R = QQ[a..i, MonomialOrder => {Lex =>3,3:1,3}];

i4 : a*e^3 + a^2*c*i + a*b^2*i + b^2*e*i + d^2*f*h + d*e^2*h

      2         2       3    2       2         2
o4 = a c*i + a*b i + a*e  + b e*i + d f*h + d*e h

o4 : R

i5 : 
