-- -*- M2-comint -*- {* hash: 790504000 *}

i1 : R = QQ[a..d];

i2 : degree (a^3-b-1)^2

o2 = {6}

o2 : List

i3 : first degree (a^3-b-1)^2

o3 = 6

i4 : S = QQ[a..d,Degrees=>{1,2,3,4}];

i5 : first degree (a+b+c^3)

o5 = 9

i6 : T = QQ[a..d,Degrees=>{{0,1},{1,0},{-1,1},{3,4}}];

i7 : degree c

o7 = {-1, 1}

o7 : List

i8 : degree c^5

o8 = {-5, 5}

o8 : List

i9 : degree d

o9 = {3, 4}

o9 : List

i10 : degree (c^5+d)

o10 = {3, 5}

o10 : List

i11 : 
0.79user 0.04system 0:00.83elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10845minor)pagefaults 0swaps
