-- -*- M2-comint -*-

i1 : R = ZZ[x,y,z];

i2 : M = matrix{{x,z,x*y},{x^2+z,y*z,1}}

o2 = | x    z  xy |
     | x2+z yz 1  |

             2       3
o2 : Matrix R  <--- R

i3 : entries M

                     2
o3 = {{x, z, x*y}, {x  + z, y*z, 1}}

o3 : List

i4 : N = mutableMatrix{{x,z,x*y},{x^2+z,y*z,1}}

o4 = | x    z  xy |
     | x2+z yz 1  |

o4 : MutableMatrix

i5 : entries N

                     2
o5 = {{x, z, x*y}, {x  + z, y*z, 1}}

o5 : List

i6 : 
