-- -*- M2-comint -*-

i1 : S = ZZ/101[a,b,c];

i2 : I = ideal(a^3+b^3+c^3)

            3    3    3
o2 = ideal(a  + b  + c )

o2 : Ideal of S

i3 : R = S/I

o3 = R

o3 : QuotientRing

i4 : eulers(R)

o4 = {0, 3}

o4 : List

i5 : J = substitute(ideal(b,a+c),R)

o5 = ideal (b, a + c)

o5 : Ideal of R

i6 : eulers(R/J)

o6 = {1}

o6 : List

i7 : 
