-- -*- M2-comint -*-

i1 : R = QQ[x,y,z];

i2 : f = matrix{{2,x,y,x^2},{z,32,2,x}}

o2 = | 2 x  y x2 |
     | z 32 2 x  |

             2       4
o2 : Matrix R  <--- R

i3 : target f

      2
o3 = R

o3 : R-module, free

i4 : source f

      4
o4 = R

o4 : R-module, free, degrees {1, 1, 1, 2}

i5 : numgens target f

o5 = 2

i6 : numgens source f

o6 = 4

i7 : f_(1,3)

o7 = x

o7 : R

i8 : entries f

                 2
o8 = {{2, x, y, x }, {z, 32, 2, x}}

o8 : List

i9 : ring f

o9 = R

o9 : PolynomialRing

i10 : describe ring f

o10 = QQ [x, y, z, Heft => {1}]

i11 : 
