-- -*- M2-comint -*- {* hash: -973654847 *}

i1 : F = GF(81,Variable=>a)

o1 = F

o1 : GaloisField

i2 : a^80

o2 = 1

o2 : F

i3 : a^40

o3 = 1

o3 : F

i4 : ambient F

            ZZ
            -- [a]
             3
o4 = --------------------
      4    3    2
     a  - a  + a  - a + 1

o4 : QuotientRing

i5 : a^4 + a - 1

      3    2
o5 = a  - a  - a + 1

o5 : F

i6 : lift(a^20, ambient F)

o6 = 1

            ZZ
            -- [a]
             3
o6 : --------------------
      4    3    2
     a  - a  + a  - a + 1

i7 : apply({20,40,80}, i -> lift(a^i, ambient F))

o7 = {1, 1, 1}

o7 : List

i8 : R = F[x,y,z]

o8 = R

o8 : PolynomialRing

i9 : f = random(2,R)

        3 2              2       3    2                2       2
o9 = - a x  + a*x*y - a*y  + (- a  + a  - a + 1)x*z - a y*z + z

o9 : R

i10 : f = (leadCoefficient f)^(-1) * f

       2    3       3 2               3    2                2 2
o10 = x  + a x*y - a y  + a*x*z + (- a  + a  - a + 1)y*z + a z

o10 : R

i11 : ZZ/101

       ZZ
o11 = ---
      101

o11 : QuotientRing

i12 : k = GF 81

o12 = k

o12 : GaloisField

i13 : k_0

o13 = a

o13 : k

i14 : a = k_0

o14 = a

o14 : k

i15 : a^20+1

         2
o15 = - a  - 1

o15 : k

i16 : ambient k

         ZZ
         -- [a]
          3
o16 = -----------
       4    2
      a  + a  - 1

o16 : QuotientRing

i17 : ideal oo

             4    2
o17 = ideal(a  + a  - 1)

               ZZ
o17 : Ideal of -- [a]
                3

i18 : oo_0

       4    2
o18 = a  + a  - 1

      ZZ
o18 : -- [a]
       3

i19 : F = GF(16, Variable => b)

o19 = F

o19 : GaloisField

i20 : b^20 + 1

       2
o20 = b  + b + 1

o20 : F

i21 : random F

       2
o21 = b  + b

o21 : F

i22 : R = F[x,y,z]

o22 = R

o22 : PolynomialRing

i23 : random(2,R)

        3      2     2      2           2                2 2
o23 = (b  + b)x  + (b  + 1)y  + x*z + (b  + b + 1)y*z + b z

o23 : R

i24 : GF (ZZ/2[T]/(T^9+T+1), Variable => T)

o24 = GF 512

o24 : GaloisField

i25 : A = ZZ/2[T]/(T^9+T+1)

o25 = A

o25 : QuotientRing

i26 : k = GF (A, PrimitiveElement => T^3+1)

o26 = k

o26 : GaloisField

i27 : T

o27 = T

o27 : k

i28 : substitute(T,k)

o28 = T

o28 : k

i29 : lift(k_0, ring T)

o29 = T

o29 : k

i30 : lift(k_0, ambient ring T)

o30 = T

o30 : A

i31 : 
0.82user 0.03system 0:00.85elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+11370minor)pagefaults 0swaps
