-- -*- M2-comint -*- {* hash: 13497865 *}

i1 : gbTrace = 3

o1 = 3

i2 : R = ZZ[x,y,z];

i3 : f = matrix{{x^2-3, y^3-1, z^4-2}};

             1       3
o3 : Matrix R  <--- R

i4 : g = forceGB(f, ChangeMatrix=>id_(source f));

i5 : x^2*y^3 // g

o5 = {2} | y3 |
     {3} | 3  |
     {4} | 0  |

             3       1
o5 : Matrix R  <--- R

i6 : 
0.80user 0.04system 0:00.85elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10844minor)pagefaults 0swaps
