-- -*- M2-comint -*- {* hash: 1495798656 *}

i1 : R = ZZ[a..z];

i2 : M = genericSkewMatrix(R,a,3)

o2 = | 0  a  b |
     | -a 0  c |
     | -b -c 0 |

             3       3
o2 : Matrix R  <--- R

i3 : transpose(M) + M == 0

o3 = true

i4 : genericSkewMatrix(R,d,5)

o4 = | 0  d  e  f  g |
     | -d 0  h  i  j |
     | -e -h 0  k  l |
     | -f -i -k 0  m |
     | -g -j -l -m 0 |

             5       5
o4 : Matrix R  <--- R

i5 : genericSkewMatrix(R,3)

o5 = | 0  a  b |
     | -a 0  c |
     | -b -c 0 |

             3       3
o5 : Matrix R  <--- R

i6 : genericSkewMatrix(R,5)

o6 = | 0  a  b  c  d |
     | -a 0  e  f  g |
     | -b -e 0  h  i |
     | -c -f -h 0  j |
     | -d -g -i -j 0 |

             5       5
o6 : Matrix R  <--- R

i7 : 
0.80user 0.08system 0:00.88elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10844minor)pagefaults 0swaps
