-- -*- M2-comint -*-

i1 : gradedModule ZZ^2

           2
o1 = 0 : ZZ

o1 : GradedModule

i2 : gradedModule(ZZ^2,ZZ^3,ZZ^400)

           2
o2 = 0 : ZZ

           3
     1 : ZZ

           400
     2 : ZZ

o2 : GradedModule

i3 : R = QQ[x,y]

o3 = R

o3 : PolynomialRing

i4 : C = res coker vars R

      1      2      1
o4 = R  <-- R  <-- R  <-- 0
                           
     0      1      2      3

o4 : ChainComplex

i5 : gradedModule C

          1
o5 = 0 : R

          2
     1 : R

          1
     2 : R

     3 : 0

o5 : GradedModule

i6 : 
