-- -*- M2-comint -*-

i1 : R = QQ[a..f, Degrees=>{6:{1,1}}];

i2 : I = ideal (a*b, c*d, e*f);

o2 : Ideal of R

i3 : hilbertFunction({2,2}, I)

o3 = 18

i4 : S = R/I;

i5 : basis({2,2},S)

o5 = | a2 ac ad ae af b2 bc bd be bf c2 ce cf d2 de df e2 f2 |

             1       18
o5 : Matrix S  <--- S

i6 : R = QQ[a..f];

i7 : I = ideal (a*b, c*d, e*f);

o7 : Ideal of R

i8 : hilbertFunction(2, I)

o8 = 18

i9 : S = R/I;

i10 : basis(2,S)

o10 = | a2 ac ad ae af b2 bc bd be bf c2 ce cf d2 de df e2 f2 |

              1       18
o10 : Matrix S  <--- S

i11 : 
