-- -*- M2-comint -*- {* hash: 1550534427 *}

i1 : R = ZZ/101[x, Degrees => {2}]/ideal(x^2);

i2 : s = hilbertSeries R

           4
      1 - T
o2 = --------
           2
     (1 - T )

o2 : Expression of class Divide

i3 : numerator s

          4
o3 = 1 - T

o3 : ZZ [T]

i4 : poincare R

          4
o4 = 1 - T

o4 : ZZ [T]

i5 : R=ZZ/101[x, Degrees => {{1,1}}]/ideal(x^2);

i6 : s = hilbertSeries R

           2 2
      1 - T T
           0 1
o6 = ----------
     (1 - T T )
           0 1

o6 : Expression of class Divide

i7 : numerator s

          2 2
o7 = 1 - T T
          0 1

o7 : ZZ [T , T ]
          0   1

i8 : poincare R

          2 2
o8 = 1 - T T
          0 1

o8 : ZZ [T , T ]
          0   1

i9 : 
0.76user 0.08system 0:00.86elapsed 98%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10844minor)pagefaults 0swaps
