-- -*- M2-comint -*- {* hash: 862594106 *}

i1 : S = ZZ/2[x,y,z];

i2 : ideal S

o2 = 0

o2 : Ideal of S

i3 : R = S/(y^2-x*z,x^2*y-z^2)

o3 = R

o3 : QuotientRing

i4 : ideal R

             2         2     2
o4 = ideal (y  + x*z, x y + z )

o4 : Ideal of S

i5 : T = R/(x^3-y*z)

o5 = T

o5 : QuotientRing

i6 : ideal T

            3
o6 = ideal(x  + y*z)

o6 : Ideal of R

i7 : ambient T

o7 = R

o7 : QuotientRing

i8 : sing = singularLocus T

o8 = sing

o8 : QuotientRing

i9 : ideal sing

             3         2         2     2   2   3              4   2    2  
o9 = ideal (x  + y*z, y  + x*z, x y + z , z , x  + y*z, x*z, x , x y, x z,
     ------------------------------------------------------------------------
      3
     x )

o9 : Ideal of S

i10 : ambient sing

o10 = S

o10 : PolynomialRing

i11 : 
0.80user 0.01system 0:00.82elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10840minor)pagefaults 0swaps
