-- -*- M2-comint -*- {* hash: 1586844281 *}

i1 : R = ZZ/7[w,x,y,z];

i2 : f = vars R

o2 = | w x y z |

             1       4
o2 : Matrix R  <--- R

i3 : ideal f

o3 = ideal (w, x, y, z)

o3 : Ideal of R

i4 : g = matrix{{x^2-w*y, x*y-w*z, x*z-y^2},{y^2-x*z,x^2*y-z^2,x^3-y*z}}

o4 = | x2-wy xy-wz  -y2+xz |
     | y2-xz x2y-z2 x3-yz  |

             2       3
o4 : Matrix R  <--- R

i5 : ideal g

             2         2                    2     2     2         3
o5 = ideal (x  - w*y, y  - x*z, x*y - w*z, x y - z , - y  + x*z, x  - y*z)

o5 : Ideal of R

i6 : 
0.81user 0.06system 0:00.88elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10843minor)pagefaults 0swaps
