-- -*- M2-comint -*-

i1 : R = ZZ/101

o1 = R

o1 : QuotientRing

i2 : 9_R

o2 = 9

o2 : R

i3 : 103_R

o3 = 2

o3 : R

i4 : 9_R * 11_R

o4 = -2

o4 : R

i5 : 9_R ^ 11

o5 = 49

o5 : R

i6 : 9_R * 11_R == -2_R

o6 = true

i7 : 17_R^-1

o7 = 6

o7 : R

i8 : lift (17_R^-1, ZZ)

o8 = 6

i9 : ZZ^1 / ideal(101)

o9 = cokernel | 101 |

                              1
o9 : ZZ-module, quotient of ZZ

i10 : 
