-- -*- M2-comint -*- {* hash: -1846060948 *}

i1 : isHomogeneous(ZZ)

o1 = true

i2 : isHomogeneous(ZZ[x])

o2 = true

i3 : isHomogeneous(ZZ[x]/(x^3-x-3))

o3 = false

i4 : A = QQ[a,b,c];

i5 : B = A[x,y];

i6 : isHomogeneous B

o6 = true

i7 : isHomogeneous ideal(a*x+y,y^3-b*x^2*y)

o7 = true

i8 : R = QQ[a,b,c,Degrees=>{{1,1},{1,0},{0,1}}];

i9 : I = ideal(a-b*c);

o9 : Ideal of R

i10 : isHomogeneous I

o10 = true

i11 : isHomogeneous(R/I)

o11 = true

i12 : isHomogeneous(R/(a-b))

o12 = false

i13 : S = QQ[a,b];

i14 : F = S^{-1,2}

       2
o14 = S

o14 : S-module, free, degrees {1, -2}

i15 : isHomogeneous F

o15 = true

i16 : G = S^{1,2}

       2
o16 = S

o16 : S-module, free, degrees {-1, -2}

i17 : phi = random(G,F)

o17 = {-1} | 4a2+3ab+8b2      0 |
      {-2} | a3+3a2b+9ab2+6b3 5 |

              2       2
o17 : Matrix S  <--- S

i18 : isHomogeneous phi

o18 = true

i19 : degree phi

o19 = {0}

o19 : List

i20 : M = coker phi

o20 = cokernel {-1} | 4a2+3ab+8b2      0 |
               {-2} | a3+3a2b+9ab2+6b3 5 |

                             2
o20 : S-module, quotient of S

i21 : isHomogeneous(a*M)

o21 = true

i22 : isHomogeneous((a+1)*M)

o22 = false

i23 : 
0.78user 0.04system 0:00.82elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10845minor)pagefaults 0swaps
