-- -*- M2-comint -*- {* hash: 2070202021 *}

i1 : R = QQ[x,y,z];

i2 : d1 = matrix {{x,y}};

             1       2
o2 : Matrix R  <--- R

i3 : d2 = map(source d1, ,{{y*z},{-x*z}});

             2       1
o3 : Matrix R  <--- R

i4 : d1 * d2 == 0

o4 = true

i5 : C = new ChainComplex; C.ring = R;

i7 : C#0 = target d1; C#1 = source d1; C#2 = source d2;

i10 : C.dd#1 = d1; C.dd#2 = d2;

              1       2
o10 : Matrix R  <--- R

              2       1
o11 : Matrix R  <--- R

i12 : C

       1      2      1
o12 = R  <-- R  <-- R
                     
      0      1      2

o12 : ChainComplex

i13 : HH_0 C

o13 = cokernel | x y |

                             1
o13 : R-module, quotient of R

i14 : prune HH_1 C

o14 = cokernel {2} | z |

                             1
o14 : R-module, quotient of R

i15 : D = chainComplex(matrix{{x,y}}, matrix {{y*z},{-x*z}})

       1      2      1
o15 = R  <-- R  <-- R
                     
      0      1      2

o15 : ChainComplex

i16 : degrees source D.dd_2

o16 = {{3}}

o16 : List

i17 : 
0.79user 0.04system 0:00.84elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10844minor)pagefaults 0swaps
