-- -*- M2-comint -*- {* hash: -1659865352 *}

i1 : R = ZZ[x,y];

i2 : S = ZZ[a,b,c];

i3 : f = map(R,S,matrix {{x^2,x*y,y^2}})

               2        2
o3 = map(R,S,{x , x*y, y })

o3 : RingMap R <--- S

i4 : f(a+b+c^2)

      4    2
o4 = y  + x  + x*y

o4 : R

i5 : g = map(R,S,matrix {{1,2,3},{4,5,6}})

o5 = map(R,S,{x + 4y, 2x + 5y, 3x + 6y})

o5 : RingMap R <--- S

i6 : g(a+b)

o6 = 3x + 9y

o6 : R

i7 : S = ZZ[a][b,c];

i8 : h = map(S,S,matrix {{b,c,2*a}})

o8 = map(S,S,{b, c, 2a})

o8 : RingMap S <--- S

i9 : h(a^7 + b^3 + c)

      3           7
o9 = b  + c + 128a

o9 : S

i10 : k = map(S,S,matrix {{c,b}})

o10 = map(S,S,{c, b, a})

o10 : RingMap S <--- S

i11 : k(a^7 + b^3 + c)

       3        7
o11 = c  + b + a

o11 : S

i12 : 
0.77user 0.04system 0:00.81elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10848minor)pagefaults 0swaps
