-- -*- M2-comint -*- {* hash: 1006583017 *}

i1 : R = ZZ[a..c];

i2 : f = map(R^3,R^{0,-1,-2,-3},(i,j) -> R_i^j)

o2 = | 1 a a2 a3 |
     | 1 b b2 b3 |
     | 1 c c2 c3 |

             3       4
o2 : Matrix R  <--- R

i3 : isHomogeneous f

o3 = true

i4 : g = map(R^3,4,(i,j) -> R_i^j)

o4 = | 1 a a2 a3 |
     | 1 b b2 b3 |
     | 1 c c2 c3 |

             3       4
o4 : Matrix R  <--- R

i5 : degrees g

o5 = {{{0}, {0}, {0}}, {{0}, {1}, {2}, {3}}}

o5 : List

i6 : isHomogeneous g

o6 = true

i7 : h = matrix table(3,4,(i,j) -> R_i^j)

o7 = | 1 a a2 a3 |
     | 1 b b2 b3 |
     | 1 c c2 c3 |

             3       4
o7 : Matrix R  <--- R

i8 : degrees h

o8 = {{{0}, {0}, {0}}, {{0}, {1}, {2}, {3}}}

o8 : List

i9 : isHomogeneous h

o9 = true

i10 : 
0.77user 0.03system 0:00.80elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10842minor)pagefaults 0swaps
