-- -*- M2-comint -*-

i1 : R = ZZ/101[x,y];

i2 : p = matrix{{x,y}}

o2 = | x y |

             1       2
o2 : Matrix R  <--- R

i3 : q = map(R^{3},,p)

o3 = {-3} | x y |

             1       2
o3 : Matrix R  <--- R

i4 : degrees target q

o4 = {{-3}}

o4 : List

i5 : degrees source q

o5 = {{-2}, {-2}}

o5 : List

i6 : 
