-- -*- M2-comint -*-

i1 : f = map ZZ^3

o1 = | 1 0 0 |
     | 0 1 0 |
     | 0 0 1 |

              3        3
o1 : Matrix ZZ  <--- ZZ

i2 : g = id_(ZZ^3)

o2 = | 1 0 0 |
     | 0 1 0 |
     | 0 0 1 |

              3        3
o2 : Matrix ZZ  <--- ZZ

i3 : f === g

o3 = true

i4 : 
