-- -*- M2-comint -*-

i1 : R = ZZ[x,y];

i2 : S = ZZ[a,b,c];

i3 : f = map(R,S,{x^2,x*y,y^2})

               2        2
o3 = map(R,S,{x , x*y, y })

o3 : RingMap R <--- S

i4 : f(a+b+c^2)

      4    2
o4 = y  + x  + x*y

o4 : R

i5 : g = map(R,S,{a=>x^2,b=>x*y,c=>y^2})

               2        2
o5 = map(R,S,{x , x*y, y })

o5 : RingMap R <--- S

i6 : g(a+b+c^2)

      4    2
o6 = y  + x  + x*y

o6 : R

i7 : 
