-- -*- M2-comint -*- {* hash: -1562635521 *}

i1 : R = ZZ/32003[a..d];

i2 : M = coker matrix {{a,1,b},{c,3,b+d}}

o2 = cokernel | a 1 b   |
              | c 3 b+d |

                            2
o2 : R-module, quotient of R

i3 : N = minimalPresentation M

o3 = cokernel | b+16001d a-10668c |

                            1
o3 : R-module, quotient of R

i4 : peek N.cache

o4 = CacheTable{pruningMap => | -10668 |}
                              | 0      |

i5 : g = N.cache.pruningMap

o5 = | -10668 |
     | 0      |

o5 : Matrix

i6 : g^-1

o6 = | -3 1 |

o6 : Matrix

i7 : I = ideal(a^2,b^3,c^4,d^7)

             2   3   4   7
o7 = ideal (a , b , c , d )

o7 : Ideal of R

i8 : X = Proj R

o8 = X

o8 : ProjectiveVariety

i9 : J = (module I)~

o9 = image | a2 b3 c4 d7 |

                                         1
o9 : coherent sheaf on X, subsheaf of OO
                                        X

i10 : minimalPresentation J

         1
o10 = OO
        X

o10 : coherent sheaf on X, free

i11 : 
0.85user 0.07system 0:00.94elapsed 98%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+11015minor)pagefaults 0swaps
