-- -*- M2-comint -*-

i1 : C = new ChainComplex;

i2 : C.ring = ZZ;

i3 : C#2 = ZZ^1;

i4 : C#3 = ZZ^2;

i5 : C.dd#3 = matrix {{3,-11}};

              1        2
o5 : Matrix ZZ  <--- ZZ

i6 : C

       1       2
o6 = ZZ  <-- ZZ
              
     2       3

o6 : ChainComplex

i7 : C.dd

           1                  2
o7 = 2 : ZZ  <------------- ZZ  : 3
                | 3 -11 |

o7 : ChainComplexMap

i8 : 
