-- -*- M2-comint -*- {* hash: -1117331315 *}

i1 : A = ZZ/101[x,y];

i2 : M = cokernel random(A^3, A^{-2,-2})

o2 = cokernel | 42x2-50xy+39y2 -39x2+30xy+19y2 |
              | 9x2-15xy-22y2  -38x2+2xy-4y2   |
              | 50x2+45xy-29y2 -36x2-16xy-6y2  |

                            3
o2 : A-module, quotient of A

i3 : R = cokernel matrix {{x^3,y^4}}

o3 = cokernel | x3 y4 |

                            1
o3 : A-module, quotient of A

i4 : N = prune (M**R)

o4 = cokernel | -16x2+43xy-27y2 32x2-35xy+42y2 x3 x2y-19xy2+5y3 42xy2+42y3 y4 0  0  |
              | x2-11xy-45y2    34xy+42y2      0  20xy2-13y3    49xy2-39y3 0  y4 0  |
              | -30xy+27y2      x2-24xy+39y2   0  -y3           xy2+10y3   0  0  y4 |

                            3
o4 : A-module, quotient of A

i5 : C = resolution N

      3      8      5
o5 = A  <-- A  <-- A  <-- 0
                           
     0      1      2      3

o5 : ChainComplex

i6 : d = C.dd

          3                                                                               8
o6 = 0 : A  <--------------------------------------------------------------------------- A  : 1
               | -16x2+43xy-27y2 32x2-35xy+42y2 x3 x2y-19xy2+5y3 42xy2+42y3 y4 0  0  |
               | x2-11xy-45y2    34xy+42y2      0  20xy2-13y3    49xy2-39y3 0  y4 0  |
               | -30xy+27y2      x2-24xy+39y2   0  -y3           xy2+10y3   0  0  y4 |

          8                                                                              5
     1 : A  <-------------------------------------------------------------------------- A  : 2
               {2} | -29xy2-y3       -24xy2+4y3      29y3      43y3       8y3       |
               {2} | 34xy2-21y3      -10y3           -34y3     23y3       -2y3      |
               {3} | -9xy+11y2       19xy+50y2       9y2       -34y2      -25y2     |
               {3} | 9x2+36xy-32y2   -19x2+13xy-45y2 -9xy-47y2 34xy+49y2  25xy-23y2 |
               {3} | -34x2+13xy+41y2 -22xy-47y2      34xy+8y2  -23xy-15y2 2xy-6y2   |
               {4} | 0               0               x-11y     -26y       -40y      |
               {4} | 0               0               10y       x+11y      12y       |
               {4} | 0               0               12y       -41y       x         |

          5
     2 : A  <----- 0 : 3
               0

o6 : ChainComplexMap

i7 : s = nullhomotopy (x^3 * id_C)

          8                             3
o7 = 1 : A  <------------------------- A  : 0
               {2} | 0 x+11y -34y  |
               {2} | 0 30y   x+24y |
               {3} | 1 16    -32   |
               {3} | 0 -19   36    |
               {3} | 0 13    22    |
               {4} | 0 0     0     |
               {4} | 0 0     0     |
               {4} | 0 0     0     |

          5                                                                                8
     2 : A  <---------------------------------------------------------------------------- A  : 1
               {5} | 39  -35 0 46y      -3x+14y  xy-15y2      32xy+47y2    6xy-25y2   |
               {5} | -41 -20 0 -16x-37y -28x+19y -20y2        xy+39y2      -49xy+36y2 |
               {5} | 0   0   0 0        0        x2+11xy-13y2 26xy+24y2    40xy+27y2  |
               {5} | 0   0   0 0        0        -10xy+43y2   x2-11xy-25y2 -12xy+35y2 |
               {5} | 0   0   0 0        0        -12xy-37y2   41xy+45y2    x2+38y2    |

                   5
     3 : 0 <----- A  : 2
              0

o7 : ChainComplexMap

i8 : s*d + d*s

          3                    3
o8 = 0 : A  <---------------- A  : 0
               | x3 0  0  |
               | 0  x3 0  |
               | 0  0  x3 |

          8                                       8
     1 : A  <----------------------------------- A  : 1
               {2} | x3 0  0  0  0  0  0  0  |
               {2} | 0  x3 0  0  0  0  0  0  |
               {3} | 0  0  x3 0  0  0  0  0  |
               {3} | 0  0  0  x3 0  0  0  0  |
               {3} | 0  0  0  0  x3 0  0  0  |
               {4} | 0  0  0  0  0  x3 0  0  |
               {4} | 0  0  0  0  0  0  x3 0  |
               {4} | 0  0  0  0  0  0  0  x3 |

          5                              5
     2 : A  <-------------------------- A  : 2
               {5} | x3 0  0  0  0  |
               {5} | 0  x3 0  0  0  |
               {5} | 0  0  x3 0  0  |
               {5} | 0  0  0  x3 0  |
               {5} | 0  0  0  0  x3 |

     3 : 0 <----- 0 : 3
              0

o8 : ChainComplexMap

i9 : s^2

          5         3
o9 = 2 : A  <----- A  : 0
               0

                   8
     3 : 0 <----- A  : 1
              0

o9 : ChainComplexMap

i10 : 
0.80user 0.04system 0:00.85elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10845minor)pagefaults 0swaps
