-- -*- M2-comint -*-

i1 : A = QQ[a..d];

i2 : B = A/(a^2,b^3);

i3 : C = B/(a*b*c,b*c*d, b^2);

i4 : presentation A

o4 = 0

             1
o4 : Matrix A  <--- 0

i5 : presentation B

o5 = | a2 b3 |

             1       2
o5 : Matrix A  <--- A

i6 : presentation C

o6 = | abc bcd b2 a2 b3 |

             1       5
o6 : Matrix A  <--- A

i7 : presentation(B,C)

o7 = | abc bcd b2 |

             1       3
o7 : Matrix B  <--- B

i8 : presentation(A,C)

o8 = | abc bcd b2 a2 b3 |

             1       5
o8 : Matrix A  <--- A

i9 : minimalPresentation C

         QQ [a, b, c, d]
o9 = ----------------------
       2   2
     (b , a , b*c*d, a*b*c)

o9 : QuotientRing

i10 : 
