-- -*- M2-comint -*- {* hash: -91270580 *}

i1 : R = ZZ/11

o1 = R

o1 : QuotientRing

i2 : 6_R + 7_R

o2 = 2

o2 : R

i3 : S = QQ[x,y,z]/(x^2-y, y^3-z)

o3 = S

o3 : QuotientRing

i4 : {1,x,x^2,x^3,x^4,x^5,x^6,x^7,x^8}

                     2     2
o4 = {1, x, y, x*y, y , x*y , z, x*z, y*z}

o4 : List

i5 : T = ZZ/101[r,s,t]

o5 = T

o5 : PolynomialRing

i6 : T/(r^3+s^3+t^3)

           T
o6 = ------------
      3    3    3
     r  + s  + t

o6 : QuotientRing

i7 : r^3+s^3+t^3

      3    3    3
o7 = r  + s  + t

o7 : T

i8 : U = ooo

o8 = U

o8 : QuotientRing

i9 : r^3+s^3+t^3

o9 = 0

o9 : U

i10 : lift(U_"r",T)

o10 = r

o10 : T

i11 : substitute(T_"r",U)

o11 = r

o11 : U

i12 : random(2,S)

      5       2  2   9       7       7  2
o12 = -*x*y + -*y  + -*x*z + -*y*z + -*z
      4       5      2       6       6

o12 : S

i13 : isQuotientRing ZZ

o13 = false

i14 : isQuotientRing S

o14 = true

i15 : ambient S

o15 = QQ [x, y, z]

o15 : PolynomialRing

i16 : coefficientRing S

o16 = QQ

o16 : Ring

i17 : isHomogeneous S

o17 = false

i18 : isHomogeneous U

o18 = true

i19 : char (ZZ/11)

o19 = 11

i20 : char S

o20 = 0

i21 : char U

o21 = 101

i22 : presentation S

o22 = | x2-y y3-z |

                           1                    2
o22 : Matrix (QQ [x, y, z])  <--- (QQ [x, y, z])

i23 : R = ZZ/101[x,y,z]/(x-y,y-z,z-x)

o23 = R

o23 : QuotientRing

i24 : trim R

        ZZ
       --- [x, y, z]
       101
o24 = --------------
      (y - z, x - z)

o24 : QuotientRing

i25 : 
0.79user 0.06system 0:00.87elapsed 98%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10844minor)pagefaults 0swaps
