-- -*- M2-comint -*- {* hash: 803905377 *}

i1 : R = ZZ/101[x,y,z];

i2 : ring x

o2 = R

o2 : PolynomialRing

i3 : M = matrix {{2*x, x+y},{y^3, z*y}};

             2       2
o3 : Matrix R  <--- R

i4 : ring M

o4 = R

o4 : PolynomialRing

i5 : S = QQ[x,y,z];

i6 : ring x

o6 = S

o6 : PolynomialRing

i7 : I = ideal (x*y, y*z);

o7 : Ideal of S

i8 : ring I

o8 = S

o8 : PolynomialRing

i9 : 
0.78user 0.02system 0:00.81elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10845minor)pagefaults 0swaps
