-- -*- M2-comint -*- {* hash: 1983074994 *}

i1 : R = QQ[x,y,z];

i2 : I = ideal(x*y,x*z,y*z)

o2 = ideal (x*y, x*z, y*z)

o2 : Ideal of R

i3 : M = I/I^2

o3 = subquotient (| xy xz yz |, | x2y2 x2yz xy2z x2z2 xyz2 y2z2 |)

                               1
o3 : R-module, subquotient of R

i4 : f = matrix{{x,y}}

o4 = | x y |

             1       2
o4 : Matrix R  <--- R

i5 : g = matrix{{x^2,x*y,y^2,z^4}}

o5 = | x2 xy y2 z4 |

             1       4
o5 : Matrix R  <--- R

i6 : M = subquotient(f,g)

o6 = subquotient (| x y |, | x2 xy y2 z4 |)

                               1
o6 : R-module, subquotient of R

i7 : N = (image f)/(image g)

o7 = subquotient (| x y |, | x2 xy y2 z4 |)

                               1
o7 : R-module, subquotient of R

i8 : N1 = (image f + image g)/(image g)

o8 = subquotient (| x y x2 xy y2 z4 |, | x2 xy y2 z4 |)

                               1
o8 : R-module, subquotient of R

i9 : M === N

o9 = true

i10 : generators M

o10 = | x y |

              1       2
o10 : Matrix R  <--- R

i11 : relations M

o11 = | x2 xy y2 z4 |

              1       4
o11 : Matrix R  <--- R

i12 : N2 = R*M_0 + I*M

o12 = subquotient (| x x2y xy2 x2z xyz xyz y2z |, | x2 xy y2 z4 |)

                                1
o12 : R-module, subquotient of R

i13 : M/N2

o13 = subquotient (| x y |, | x x2y xy2 x2z xyz xyz y2z x2 xy y2 z4 |)

                                1
o13 : R-module, subquotient of R

i14 : prune(M/N2)

o14 = cokernel {1} | y x z4 |

                             1
o14 : R-module, quotient of R

i15 : ambient M

       1
o15 = R

o15 : R-module, free

i16 : ambient M === target relations M

o16 = true

i17 : ambient M === target generators M

o17 = true

i18 : super M

o18 = cokernel | x2 xy y2 z4 |

                             1
o18 : R-module, quotient of R

i19 : super M === cokernel relations M

o19 = true

i20 : M + M

o20 = subquotient (| x y x y |, | x2 xy y2 z4 |)

                                1
o20 : R-module, subquotient of R

i21 : trim (M+M)

o21 = subquotient (| y x |, | y2 xy x2 z4 |)

                                1
o21 : R-module, subquotient of R

i22 : minimalPresentation M

o22 = cokernel {1} | y x 0 0 z4 0  |
               {1} | 0 0 y x 0  z4 |

                             2
o22 : R-module, quotient of R

i23 : prune M

o23 = cokernel {1} | y x 0 0 z4 0  |
               {1} | 0 0 y x 0  z4 |

                             2
o23 : R-module, quotient of R

i24 : 
0.80user 0.04system 0:00.85elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10843minor)pagefaults 0swaps
