-- -*- M2-comint -*-

i1 : R = QQ[a..d]

o1 = R

o1 : PolynomialRing

i2 : S = QQ[b,c,d,e]

o2 = S

o2 : PolynomialRing

i3 : b

o3 = b

o3 : S

i4 : use R

o4 = R

o4 : PolynomialRing

i5 : b

o5 = b

o5 : R

i6 : a+b

o6 = a + b

o6 : R

i7 : T

o7 = T

o7 : Symbol

i8 : hf = poincare ideal vars S

                2     3    4
o8 = 1 - 4T + 6T  - 4T  + T

o8 : ZZ [T]

i9 : T

o9 = T

o9 : Symbol

i10 : use ring hf

o10 = ZZ [T]

o10 : PolynomialRing

i11 : T

o11 = T

o11 : ZZ [T]

i12 : 
