-- -*- M2-comint -*- {* hash: -2008579183 *}

i1 : R = QQ[a..g]

o1 = R

o1 : PolynomialRing

i2 : f = a^3+b^2*c+3*f^10*d-1+e-e

         10    3    2
o2 = 3d*f   + a  + b c - 1

o2 : R

i3 : weightRange({1,1,0,0,0,0,0},f)

o3 = (0, 3)

o3 : Sequence

i4 : f = a^2*b+3*a^2*c+b*c+1

      2      2
o4 = a b + 3a c + b*c + 1

o4 : R

i5 : sum select(terms f, t -> (weightRange({1,0},t))#0 == 2)

      2      2
o5 = a b + 3a c

o5 : R

i6 : S = R[x,y];

i7 : weightRange({0,0,3,7},a*x^2+b*x*y)

o7 = (3, 7)

o7 : Sequence

i8 : R = QQ[x,y];

i9 : weightRange (x^3+y^2)^5

o9 = (10, 15)

o9 : Sequence

i10 : 
0.78user 0.02system 0:00.81elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10844minor)pagefaults 0swaps
