-- -*- M2-comint -*- {* hash: 1976609865 *}

i1 : R1 = ZZ/101;

i2 : R2 = ZZ/101[s,t];

i3 : describe R2

o3 = R1 [s, t]

i4 : I = ideal (s^4+t^2+1);

o4 : Ideal of R2

i5 : R3 = R2/I;

i6 : describe R3

          R2
o6 = -----------
      4    2
     s  + t  + 1

i7 : f = s^4+1

       2
o7 = -t

o7 : R3

i8 : g = s^4+t^2+1

o8 = 0

o8 : R3

i9 : use R2;

i10 : substitute(g,R2)

o10 = 0

o10 : R2

i11 : f = s^4+1

       4
o11 = s  + 1

o11 : R2

i12 : g = s^4+t^2+1

       4    2
o12 = s  + t  + 1

o12 : R2

i13 : substitute(f,R3)

        2
o13 = -t

o13 : R3

i14 : describe R3

           R2
o14 = -----------
       4    2
      s  + t  + 1

i15 : R4 = frac R3;

i16 : describe R4

                R2
o16 = frac -----------
            4    2
           s  + t  + 1

i17 : use R2;

i18 : f = s^4+1;

i19 : substitute(f,R4)

        2
o19 = -t

o19 : R4

i20 : use R3;

i21 : g = substitute(f,R3);

i22 : substitute(g,R4)

        2
o22 = -t

o22 : R4

i23 : F = map(R4,R3)

o23 = map(R4,R3,{s, t})

o23 : RingMap R4 <--- R3

i24 : F(f)

        2
o24 = -t

o24 : R4

i25 : R5 = R4[u,v,w];

i26 : describe R5

o26 = R4 [u, v, w]

i27 : J = ideal(u^3-v^2*w+w^3,v^2+w^2,u*v-v*w+u*w)

              3    2     3   2    2
o27 = ideal (u  - v w + w , v  + w , u*v + u*w - v*w)

o27 : Ideal of R5

i28 : R6 = R5/J;

i29 : describe R6

                          R5
o29 = -----------------------------------------
        3    2     3   2    2
      (u  - v w + w , v  + w , u*v + u*w - v*w)

i30 : map(R6,R2)

o30 = map(R6,R2,{s, t})

o30 : RingMap R6 <--- R2

i31 : substitute(f,R6)

        2
o31 = -t

o31 : R6

i32 : use R2;

i33 : f = s^4+1;

i34 : F = map(R4,R2);

o34 : RingMap R4 <--- R2

i35 : G = map(R5,R4);

o35 : RingMap R5 <--- R4

i36 : H = map(R6,R5);

o36 : RingMap R6 <--- R5

i37 : H(G(F(f)))

        2
o37 = -t

o37 : R6

i38 : f1 = substitute(f,R4)

        2
o38 = -t

o38 : R4

i39 : f2 = substitute(f1,R5)

        2
o39 = -t

o39 : R5

i40 : substitute(f2,R6)

        2
o40 = -t

o40 : R6

i41 : substitute(f,vars R3)

        2
o41 = -t

o41 : R3

i42 : try substitute(f,vars R5) else "found error"

o42 = found error

i43 : 
0.77user 0.06system 0:00.85elapsed 98%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+11562minor)pagefaults 0swaps
