-- -*- M2-comint -*-

i1 : R = ZZ/101[x,y,z]

o1 = R

o1 : PolynomialRing

i2 : degree (x^2+y^2)^5

o2 = {10}

o2 : List

i3 : F = R^{2,3,4}

      3
o3 = R

o3 : R-module, free, degrees {-2, -3, -4}

i4 : v = F_2

o4 = {-2} | 0 |
     {-3} | 0 |
     {-4} | 1 |

      3
o4 : R

i5 : degree v

o5 = {-4}

o5 : List

i6 : degree cokernel symmetricPower ( 2, vars R )

o6 = 4

i7 : 
