-- -*- M2-comint -*- {* hash: -1112215020 *}

i1 : A = matrix "1,1,1,1; 1,2,3,4"

o1 = | 1 1 1 1 |
     | 1 2 3 4 |

              2        4
o1 : Matrix ZZ  <--- ZZ

i2 : C = toricCircuits A
-------------------------------------------------
4ti2 version 1.3.1, Copyright (C) 2006 4ti2 team.
4ti2 comes with ABSOLUTELY NO WARRANTY.
This is free software, and you are welcome
to redistribute it under certain conditions.
For details, see the file COPYING.
-------------------------------------------------
Using 64 bit integers.
4ti2 Total Time:  0.00 secs.
using temporary file name /tmp/M2-27846-1

o2 = | 0 1  -2 1 |
     | 1 -2 1  0 |
     | 1 0  -3 2 |
     | 2 -3 0  1 |

              4        4
o2 : Matrix ZZ  <--- ZZ

i3 : R = QQ[a..d]

o3 = R

o3 : PolynomialRing

i4 : Icircuit = toBinomial(toricCircuits(A), R) -- this is the circuit ideal of A
-------------------------------------------------
4ti2 version 1.3.1, Copyright (C) 2006 4ti2 team.
4ti2 comes with ABSOLUTELY NO WARRANTY.
This is free software, and you are welcome
to redistribute it under certain conditions.
For details, see the file COPYING.
-------------------------------------------------
Using 64 bit integers.
4ti2 Total Time:  0.00 secs.
using temporary file name /tmp/M2-27846-2

               2           2           3      2     3    2
o4 = ideal (- c  + b*d, - b  + a*c, - c  + a*d , - b  + a d)

o4 : Ideal of R

i5 : I = toBinomial(toricMarkov(A), R)
-------------------------------------------------
4ti2 version 1.3.1, Copyright (C) 2006 4ti2 team.
4ti2 comes with ABSOLUTELY NO WARRANTY.
This is free software, and you are welcome
to redistribute it under certain conditions.
For details, see the file COPYING.
-------------------------------------------------
Using 64 bit integers.
4ti2 Total Time:  0.00 secs.
using temporary file name /tmp/M2-27846-3

               2           2
o5 = ideal (- c  + b*d, - b  + a*c, - b*c + a*d)

o5 : Ideal of R

i6 : I==Icircuit

o6 = false

i7 : a*d-b*c % I -- this binomial is in I:

o7 = 0

o7 : R

i8 : a*d-b*c % Icircuit -- but not in Icircuit:

o8 = - b*c + a*d

o8 : R

i9 : 
0.62user 0.12system 0:00.75elapsed 98%CPU (0avgtext+0avgdata 0maxresident)k
8inputs+48outputs (0major+17182minor)pagefaults 0swaps
