-- -*- M2-comint -*- {* hash: -482441196 *}
--warning: function parametersInIdeal redefined

i1 : A = matrix "1,1,1,1; 1,2,3,4"

o1 = | 1 1 1 1 |
     | 1 2 3 4 |

              2        4
o1 : Matrix ZZ  <--- ZZ

i2 : toricGroebner(A)
-------------------------------------------------
4ti2 version 1.3.1, Copyright (C) 2006 4ti2 team.
4ti2 comes with ABSOLUTELY NO WARRANTY.
This is free software, and you are welcome
to redistribute it under certain conditions.
For details, see the file COPYING.
-------------------------------------------------
Using 64 bit integers.
4ti2 Total Time:  0.00 secs.
using temporary file name /tmp/M2-25840-1

o2 = | -1 1  1  -1 |
     | -1 2  -1 0  |
     | 0  -1 2  -1 |

              3        4
o2 : Matrix ZZ  <--- ZZ

i3 : R = QQ[a..d]

o3 = R

o3 : PolynomialRing

i4 : toricGroebner(A,R)
-------------------------------------------------
4ti2 version 1.3.1, Copyright (C) 2006 4ti2 team.
4ti2 comes with ABSOLUTELY NO WARRANTY.
This is free software, and you are welcome
to redistribute it under certain conditions.
For details, see the file COPYING.
-------------------------------------------------
Using 64 bit integers.
4ti2 Total Time:  0.00 secs.
using temporary file name /tmp/M2-25840-2

                        2         2
o4 = ideal (b*c - a*d, b  - a*c, c  - b*d)

o4 : Ideal of R

i5 : toricGroebner(A,Weights=>{1,2,3,4})
-------------------------------------------------
4ti2 version 1.3.1, Copyright (C) 2006 4ti2 team.
4ti2 comes with ABSOLUTELY NO WARRANTY.
This is free software, and you are welcome
to redistribute it under certain conditions.
For details, see the file COPYING.
-------------------------------------------------
Using 64 bit integers.
4ti2 Total Time:  0.00 secs.
using temporary file name /tmp/M2-25840-3

o5 = | -1 1  1  -1 |
     | -1 2  -1 0  |
     | 0  -1 2  -1 |

              3        4
o5 : Matrix ZZ  <--- ZZ

i6 : 
