-- -*- M2-comint -*- {* hash: -1730681488 *}

i1 : K=QQ

o1 = QQ

o1 : Ring

i2 : R=K[v,u,z]

o2 = R

o2 : PolynomialRing

i3 : I=ideal(v^4-2*u^3*z+3*u^2*z^2-2*v^2*z^2)

            4     3      2 2     2 2
o3 = ideal(v  - 2u z - 2v z  + 3u z )

o3 : Ideal of R

i4 : geometricGenus(I)

o4 = 0

i5 : K=QQ

o5 = QQ

o5 : Ring

i6 : R=K[v,u,z]

o6 = R

o6 : PolynomialRing

i7 : I=ideal(v^4-2*u^3*z+3*u^2*z^2-2*v^2*z^2)

            4     3      2 2     2 2
o7 = ideal(v  - 2u z - 2v z  + 3u z )

o7 : Ideal of R

i8 : Rvu=K[v,u];

i9 : QR=frac(Rvu);

i10 : ib=matrix {{1, v, (-1+v^2)/(-1+u), 1/(-1+u)/u*v^3+(-2+u)/(-1+u)/u*v}};

               1        4
o10 : Matrix QR  <--- QR

i11 : geometricGenus(I,ib)

o11 = 0

i12 : K=QQ;

i13 : R=K[v,u,z];

i14 : I=ideal(v^3-u^2*z)

             3    2
o14 = ideal(v  - u z)

o14 : Ideal of R

i15 : geometricGenus(I)

o15 = 0

i16 : K=QQ;

i17 : R=K[v,u,z];

i18 : I=ideal(v^3-u^2*z)

             3    2
o18 = ideal(v  - u z)

o18 : Ideal of R

i19 : Rvu=K[v,u];

i20 : QR=frac(Rvu);

i21 : ib=matrix({{1,v,v^2/u}});

               1        3
o21 : Matrix QR  <--- QR

i22 : geometricGenus(I,ib)

o22 = 0

i23 : K=QQ;

i24 : R=K[v,u,z];

i25 : I=ideal(v^6+(7/5)*v^2*u^4+(6/5)*u^6+(21/5)*v^2*u^3*z+(12/5)*u^5*z+(21/5)*v^2*u^2*z^2+(6/5)*u^4*z^2+(7/5)*v^2*u*z^3);

o25 : Ideal of R

i26 : geometricGenus(I)

o26 = 4

i27 : K=QQ;

i28 : R=K[v,u,z];

i29 : I=ideal(v^6+(7/5)*v^2*u^4+(6/5)*u^6+(21/5)*v^2*u^3*z+(12/5)*u^5*z+(21/5)*v^2*u^2*z^2+(6/5)*u^4*z^2+(7/5)*v^2*u*z^3);

o29 : Ideal of R

i30 : Rvu=K[v,u];

i31 : QR=frac(Rvu);

i32 : ib=matrix({{1,v,v^2,v^3/(u+1),1/u/(u+1)*v^4,1/u^2/(u+1)*v^5-7/5*(u-1)/u*v}});

               1        6
o32 : Matrix QR  <--- QR

i33 : geometricGenus(I,ib)

o33 = 4

i34 : 
