-- -*- M2-comint -*- hash: -1229619679

i1 : R = CC[x,y];

i2 : f = { x^3*y^5 + y^2 + x^2*y, x*y + x^2 - 1};

i3 : I=ideal f;

o3 : Ideal of R

i4 : dim I
-- warning: experimental computation over inexact field begun
--          results not reliable (one warning given per session)

o4 = 0

i5 : degree I

o5 = 10

i6 : m = mixedVolume(f) -- counts the number of complex roots in the torus (without zero components)

o6 = 8

i7 : (mv,sv) = mixedVolume(f,StableMixedVolume=>true)

o7 = (8, 10)

o7 : Sequence

i8 : (mv,q,qsols) = mixedVolume(f,StartSystem=>true);

i9 : q --let's take a look at the start system:

                               3 5                          2             
o9 = {(- .205377 - .978683*ii)x y  + (.943327 - .331864*ii)x y, (.673112 +
     ------------------------------------------------------------------------
                 2
     .739541*ii)x  - .911067 - .412259*ii}

o9 : List

i10 : qsols --and its solutions:

o10 = {{.979319-.202321*ii, .930645-.365923*ii}, {-.979319+.202321*ii,
      -----------------------------------------------------------------------
      .916812+.399319*ii}, {.979319-.202321*ii, .365923+.930645*ii},
      -----------------------------------------------------------------------
      {-.979319+.202321*ii, -.399319+.916812*ii}, {.979319-.202321*ii,
      -----------------------------------------------------------------------
      -.930645+.365923*ii}, {-.979319+.202321*ii, -.916812-.399319*ii},
      -----------------------------------------------------------------------
      {.979319-.202321*ii, -.365923-.930645*ii}, {-.979319+.202321*ii,
      -----------------------------------------------------------------------
      .399319-.916812*ii}}

o10 : List

i11 : 
