-- -*- M2-comint -*- {* hash: -1229619679 *}

i1 : R = CC[x,y];

i2 : f = { x^3*y^5 + y^2 + x^2*y, x*y + x^2 - 1};

i3 : I=ideal f;

o3 : Ideal of R

i4 : dim I
-- warning: experimental computation over inexact field begun
--          results not reliable (one warning given per session)

o4 = 0

i5 : degree I

o5 = 10

i6 : m = mixedVolume(f) -- counts the number of complex roots in the torus (without zero components)

o6 = 8

i7 : (mv,sv) = mixedVolume(f,StableMixedVolume=>true)

o7 = (8, 10)

o7 : Sequence

i8 : (mv,q,qsols) = mixedVolume(f,StartSystem=>true);

i9 : q --let's take a look at the start system:

                               3 5                          2              
o9 = {(- .225396 - .974267*ii)x y  + (.770228 + .637768*ii)x y + (.976316 -
     ------------------------------------------------------------------------
                 2                           2
     .216348*ii)y , (- .461591 - .887093*ii)x  + (.626651 - .7793*ii)x*y +
     ------------------------------------------------------------------------
     .489458 - .872027*ii}

o9 : List

i10 : qsols --and its solutions:

o10 = {{.650049-.581846*ii, -.697136+.21608*ii}, {-.248821+.724745*ii,
      -----------------------------------------------------------------------
      .058095+.628244*ii}, {.351771-1.39383*ii, .855585+.245335*ii},
      -----------------------------------------------------------------------
      {-.704556+1.40927*ii, -.633473-.698632*ii}, {-1.0105+.581291*ii,
      -----------------------------------------------------------------------
      .677986-.85977*ii}, {.972394-.950446*ii, -.124266+.852248*ii},
      -----------------------------------------------------------------------
      {-.128081-.739157*ii, .736006-1.1531*ii}, {.11774+.949972*ii,
      -----------------------------------------------------------------------
      -.872795+.769591*ii}}

o10 : List

i11 : 
