-- -*- M2-comint -*- {* hash: -1001377042 *}

i1 : R = CC[x,y];

i2 : f = { x^3*y^5 + y^2 + x^2*y, x*y + x^2 - 1};

i3 : fSols = solveSystem(f);

i4 : fSols/print
{-1, 0}
{1, 0}
{.742585+.425943*ii, .270685-1.00715*ii}
{-.764107, -.544612}
{-.894935-.624334*ii, .143333+1.14868*ii}
{1.33076-.335184*ii, -.62414+.513163*ii}
{.742585-.425943*ii, .270685+1.00715*ii}
{1.33076+.335184*ii, -.62414-.513163*ii}
{-.894935+.624334*ii, .143333-1.14868*ii}
{-1.59272, .964857}

o4 = {, , , , , , , , , }

o4 : List

i5 : nonZeroSols = nonZeroFilter(fSols,1,1.0e-10);

i6 : nonZeroSols / print
{.742585+.425943*ii, .270685-1.00715*ii}
{-.764107, -.544612}
{-.894935-.624334*ii, .143333+1.14868*ii}
{1.33076-.335184*ii, -.62414+.513163*ii}
{.742585-.425943*ii, .270685+1.00715*ii}
{1.33076+.335184*ii, -.62414-.513163*ii}
{-.894935+.624334*ii, .143333-1.14868*ii}
{-1.59272, .964857}

o6 = {, , , , , , , }

o6 : List

i7 : f = {x^2+y^2,y*x+x};

i8 : fSols = solveSystem(f);

i9 : fSols/print
(0, 0)
{-ii, -1}
{ii, -1}

o9 = {, , }

o9 : List

i10 : zeroSols = zeroFilter(fSols,0,1.0e-10);

i11 : zeroSols/print
(0, 0)

o11 = {}

o11 : List

i12 : 
