-- -*- M2-comint -*- hash: 522064869

i1 : R=CC[x11,x22,x21,x12,x23,x13,x14,x24];

i2 : system={x11*x22-x21*x12,x12*x23-x22*x13,x13*x24-x23*x14};

i3 : V=numericalIrreducibleDecomposition(system)
found 6 irreducible factors 

o3 = V

o3 : NumericalVariety

i4 : WitSets=V#5; --witness sets are accessed by dimension

i5 : w=first WitSets;

i6 : w#IsIrreducible

o6 = true

i7 : R=QQ[x11,x22,x21,x12,x23,x13,x14,x24];

i8 : system={x11*x22-x21*x12,x12*x23-x22*x13,x13*x24-x23*x14};

i9 : PD=primaryDecomposition(ideal(system))

o9 = {ideal (x23*x14 - x13*x24, x21*x14 - x11*x24, x22*x14 - x12*x24, x12*x23
     ------------------------------------------------------------------------
     - x22*x13, x11*x23 - x21*x13, x11*x22 - x21*x12), ideal (x12, x22,
     ------------------------------------------------------------------------
     x23*x14 - x13*x24), ideal (x13, x23, x11*x22 - x21*x12)}

o9 : List

i10 : for i from 0 to 2 do print ("dim =" | dim PD_i | "  " | "degree=" | degree PD_i)
dim =5  degree=4
dim =5  degree=2
dim =5  degree=2

i11 : 
