-- -*- M2-comint -*- hash: 15610208045328487784

i1 : R = CC[x,y,z];

i2 : f = { x^2 - y, x^3 - z };

i3 : (w,ns) = topWitnessSet(f,1)

o3 = (w, {})

o3 : Sequence

i4 : dim(w)

o4 = 1

i5 : degree(w)

o5 = 3

i6 : toString equations(w)

o6 = {x^2-y+(.380139-.924929*ii)*zz1, x^3-z+(-.45571+.890128*ii)*zz1, zz1}

i7 : toString slice(w)

o7 = {(-.205377-.978683*ii)*x+(.943327-.331864*ii)*y+(.673112+.739541*ii)*z
     +(-.911067-.412259*ii)*zz1-.883724+.468009*ii}

i8 : toString points(w)

o8 = VerticalList{new Point from {Coordinates => {-.064406+1.00899*ii,
     -1.0139-.129969*ii, .196438-1.01464*ii, 5.3111e-34-2.32871e-33*ii},
     cache => CacheTable{...3...}}, new Point from {Coordinates =>
     {-1.16558-.143085*ii, 1.3381+.333554*ii, -1.51194-.580247*ii,
     -2.36625e-32+2.72991e-32*ii}, cache => CacheTable{...3...}}, new Point
     from {Coordinates => {.840447+.055110*ii, .703315+.092635*ii,
     .585994+.116614*ii, -1.00052e-32-9.34768e-33*ii}, cache =>
     CacheTable{...3...}}}

i9 : R = CC[x,y,z]; f = { (x^2-y)*(x-2), (x^3 - z)*(y-2), (x*y - z)*(z-2) }

        3     2              3      3                             2
o10 = {x  - 2x  - x*y + 2y, x y - 2x  - y*z + 2z, x*y*z - 2x*y - z  + 2z}

o10 : List

i11 : (w,ns) = topWitnessSet(f,1);

i12 : dim(w)

o12 = 1

i13 : degree(w)

o13 = 3

i14 : #ns

o14 = 10

i15 : 
