-- -*- M2-comint -*- {* hash: -1010838168 *}

i1 : R = CC[x,y,z];

i2 : f = { x^2 - y, x^3 - z };

i3 : (w,ns) = topWitnessSet(f,1)

o3 = (w, {})

o3 : Sequence

i4 : dim(w)

o4 = 1

i5 : degree(w)

o5 = 3

i6 : toString equations(w)

o6 = {x^2-y+(-.0662175+.997805*ii)*zz1, x^3-z+(.999313+.037049*ii)*zz1, zz1}

i7 : toString slice(w)

o7 = {(-.85562+.517604*ii)*x+(.210993+.977488*ii)*y+(.854758+.519028*ii)*z
     +(-.0833801-.996518*ii)*zz1-.982156+.18807*ii}

i8 : toString points(w)

o8 = VerticalList{{.862371-.658566*ii, .309974-1.13586*ii,
     -.480724-1.18367*ii, -5.40943e-33-3.88148e-33*ii}, {-.886571-.609347*ii,
     .414704+1.08046*ii, .290709-1.2106*ii, 6.10642e-33-4.05647e-33*ii},
     {-.663491+.541909*ii, .146554-.719104*ii, .292452+.556537*ii,
     9.70975e-33+1.32845e-32*ii}}

i9 : R = CC[x,y,z]; f = { (x^2-y)*(x-2), (x^3 - z)*(y-2), (x*y - z)*(z-2) }

        3     2              3      3                             2
o10 = {x  - 2x  - x*y + 2y, x y - 2x  - y*z + 2z, x*y*z - 2x*y - z  + 2z}

o10 : List

i11 : (w,ns) = topWitnessSet(f,1);

i12 : dim(w)

o12 = 1

i13 : degree(w)

o13 = 3

i14 : #ns

o14 = 10

i15 : 
