-- -*- M2-comint -*- {* hash: 1528738943 *}

i1 : R = CC[x,y];

i2 : f = { x^3*y^5 + y^2 + x^2*y, x*y + x^2 - 1};

i3 : fSols = solveSystem(f);

i4 : fSols/print
{-1, 5.5696e-214}
{1, -9.28267e-214}
{-.894935+.624334*ii, .143333-1.14868*ii}
{-1.59272, .964857}
{1.33076-.335184*ii, -.62414+.513163*ii}
{-.894935-.624334*ii, .143333+1.14868*ii}
{1.33076+.335184*ii, -.62414-.513163*ii}
{.742585-.425943*ii, .270685+1.00715*ii}
{.742585+.425943*ii, .270685-1.00715*ii}
{-.764107, -.544612}

o4 = {, , , , , , , , , }

o4 : List

i5 : zeroSols = zeroFilter(fSols,1,1.0e-10);

i6 : zeroSols / print
{-1, 5.5696e-214}
{1, -9.28267e-214}

o6 = {, }

o6 : List

i7 : f = {x^2+y^2,y*x+x};

i8 : fSols = solveSystem(f);

i9 : fSols/print
(1.54074e-32*ii, 3.99107e-32+8.91603e-33*ii)
{-ii, -1}
{ii, -1}

o9 = {, , }

o9 : List

i10 : zeroSols = zeroFilter(fSols,0,1.0e-10);

i11 : zeroSols/print
(1.54074e-32*ii, 3.99107e-32+8.91603e-33*ii)

o11 = {}

o11 : List

i12 : 
