
i1 : R = QQ[x,y,z]

o1 = R

o1 : PolynomialRing

i2 : curve = ideal( x^4-y^5, x^3-y^7 )

               5    4     7    3
o2 = ideal (- y  + x , - y  + x )

o2 : Ideal of R

i3 : gb curve

o3 = GroebnerBasis[status: done; S-pairs encountered up to degree 11]

o3 : GroebnerBasis

i4 : dim curve

o4 = 1

i5 : codim curve

o5 = 2

i6 : degree curve

o6 = 28

i7 : curve1 = saturate(curve,ideal(x))

               2       5    4   5    3
o7 = ideal (x*y  - 1, y  - x , x  - y )

o7 : Ideal of R

i8 : curve2 = saturate(curve,curve1)

             3   5
o8 = ideal (x , y )

o8 : Ideal of R

i9 : curve == radical curve

o9 = false

i10 : curve = curve1

                2       5    4   5    3
o10 = ideal (x*y  - 1, y  - x , x  - y )

o10 : Ideal of R

i11 : degree curve

o11 = 13

i12 : curve == radical curve

o12 = true

i13 : surface = ideal( x^5 + y^5 + z^5 - 1)

             5    5    5
o13 = ideal(x  + y  + z  - 1)

o13 : Ideal of R

i14 : theirunion = intersect(curve,surface)

              6 2      7      2 5    5    5    5      2       5 5    10    5 5    9    4 5    4 5    5    4   10    10    5 5    5 5    9    4 5    4 5    5 3    8    3 5    5    5    4    3
o14 = ideal (x y  + x*y  + x*y z  - x  - y  - z  - x*y  + 1, x y  + y   + y z  - x  - x y  - x z  - y  + x , x   - y   + x z  - y z  + x  + x y  + x z  - x y  - y  - y z  - x  + y  - x  + y )

o14 : Ideal of R

i15 : curve*surface == theirunion

o15 = true

i16 : ourpoints = curve + surface

                2       5    4   5    3   5    5    5
o16 = ideal (x*y  - 1, y  - x , x  - y , x  + y  + z  - 1)

o16 : Ideal of R

i17 : dim ourpoints

o17 = 0

i18 : degree ourpoints

o18 = 65

i19 : degree radical ourpoints

o19 = 65

i20 : staircase = ideal leadTerm ourpoints

                2   5   5   5
o20 = ideal (x*y , z , y , x )

o20 : Ideal of R

i21 : T = R/staircase;

i22 : basis T

o22 = | 1 x x2 x3 x4 x4y x4yz x4yz2 x4yz3 x4yz4 x4z x4z2 x4z3 x4z4 x3y x3yz x3yz2 x3yz3 x3yz4 x3z x3z2 x3z3 x3z4 x2y x2yz x2yz2 x2yz3 x2yz4 x2z x2z2 x2z3 x2z4 xy xyz xyz2 xyz3 xyz4 xz xz2 xz3 xz4 y y2 y3 y4 y4z y4z2 y4z3 y4z4 y3z y3z2 y3z3 y3z4 y2z y2z2 y2z3 y2z4 yz yz2 yz3 yz4 z z2 z3 z4 |

              1       65
o22 : Matrix T  <--- T

i23 : use R;

i24 : anyOldPolynomial = y^5*x^5-x^9-y^8+y^3*x^5

       5 5    9    5 3    8
o24 = x y  - x  + x y  - y

o24 : R

i25 : anyOldPolynomial % ourpoints

       4     3
o25 = x y - x y

o25 : R

i26 : anotherPolynomial = y^5*x^5-x^9-y^8+y^3*x^4

       5 5    9    8    4 3
o26 = x y  - x  - y  + x y

o26 : R

i27 : anotherPolynomial % ourpoints

o27 = 0

o27 : R

i28 : R' = ZZ/101[x,y,z];

i29 : ourpoints' = substitute(ourpoints,R')

                2       5    4   5    3   5    5    5
o29 = ideal (x*y  - 1, y  - x , x  - y , x  + y  + z  - 1)

o29 : Ideal of R'

i30 : decompose ourpoints'

                                                                                                                                                                                   2                          2             2                                         2                          2              2                                                2                          2              2                                       2                          2             2                                                 2                          2              2                                        2                          2              2                                                 2                         2              2                                         2                          2              2                                                2                          2              2                                       2                          2              2                                 3      2              2                    2       2       2              2                  3      2              2                  5      2             2
o30 = {ideal (z - 6, y - 1, x - 1), ideal (z - 14, y - 1, x - 1), ideal (z - 17, y - 1, x - 1), ideal (z + 36, y - 1, x - 1), ideal (z + 1, y - 1, x - 1), ideal (x*z - 44y*z - 22z  - 22x - 23y + 32z - 44, y  + 2y*z - 38z  + 13x + 14y - 47z - 4, x*y + 36y*z + 31z  + 18x - 31y - 13z + 11, x  - 24y*z + 32z  + 39x - 2y - 8z - 30), ideal (x*z - 44y*z - 30z  + 31x + 37y + 32z - 39, y  - 34y*z + 27z  + 13x + 14y - 9z - 4, x*y - 6y*z - 30z  + 18x - 31y + 19z + 11, x  + 4y*z - 44z  + 39x - 2y + 35z - 30), ideal (x*z - 44y*z + 31z  - 30x - 13y + 32z + 41, y  - 12y*z + 46z  + 13x + 14y - 21z - 4, x*y - 14y*z + 5z  + 18x - 31y - 23z + 11, x  + 43y*z + 41z  + 39x - 2y + 48z - 30), ideal (x*z - 44y*z + 16z  + 5x + 19y + 32z + 10, y  - 29y*z + 40z  + 13x + 14y + 25z - 4, x*y - 17y*z - 22z  + 18x - 31y + 37z + 11, x  + 45y*z - 39z  + 39x - 2y + 15z - 30), ideal (x*z - 44y*z + 5z  + 16x - 20y + 32z + 32, y  - 28y*z + 26z  + 13x + 14y - 49z - 4, x*y + y*z + 16z  + 18x - 31y - 20z + 11, x  + 33y*z + 10z  + 39x - 2y + 11z - 30), ideal (y  + 28x  - 27x*y + 46y  - 27x + y - 28, x*y  - 1, x y - 28x  + 29x*y - 28y  + 45x + y + 45, x  - 46x  + 28x*y - 27y  + 46x + y + 27, z  + 46x  - 46x*y + 8y  - 48x - 19y - 29)}

o30 : List

i31 : oo / (x -> <<endl) @@ print;
ideal (z - 6, y - 1, x - 1)

ideal (z - 14, y - 1, x - 1)

ideal (z - 17, y - 1, x - 1)

ideal (z + 36, y - 1, x - 1)

ideal (z + 1, y - 1, x - 1)

                        2                          2             2                                         2                          2              2
ideal (x*z - 44y*z - 22z  - 22x - 23y + 32z - 44, y  + 2y*z - 38z  + 13x + 14y - 47z - 4, x*y + 36y*z + 31z  + 18x - 31y - 13z + 11, x  - 24y*z + 32z  + 39x - 2y - 8z - 30)

                        2                          2              2                                       2                          2             2
ideal (x*z - 44y*z - 30z  + 31x + 37y + 32z - 39, y  - 34y*z + 27z  + 13x + 14y - 9z - 4, x*y - 6y*z - 30z  + 18x - 31y + 19z + 11, x  + 4y*z - 44z  + 39x - 2y + 35z - 30)

                        2                          2              2                                        2                          2              2
ideal (x*z - 44y*z + 31z  - 30x - 13y + 32z + 41, y  - 12y*z + 46z  + 13x + 14y - 21z - 4, x*y - 14y*z + 5z  + 18x - 31y - 23z + 11, x  + 43y*z + 41z  + 39x - 2y + 48z - 30)

                        2                         2              2                                         2                          2              2
ideal (x*z - 44y*z + 16z  + 5x + 19y + 32z + 10, y  - 29y*z + 40z  + 13x + 14y + 25z - 4, x*y - 17y*z - 22z  + 18x - 31y + 37z + 11, x  + 45y*z - 39z  + 39x - 2y + 15z - 30)

                       2                          2              2                                       2                          2              2
ideal (x*z - 44y*z + 5z  + 16x - 20y + 32z + 32, y  - 28y*z + 26z  + 13x + 14y - 49z - 4, x*y + y*z + 16z  + 18x - 31y - 20z + 11, x  + 33y*z + 10z  + 39x - 2y + 11z - 30)

        3      2              2                    2       2       2              2                  3      2              2                  5      2             2
ideal (y  + 28x  - 27x*y + 46y  - 27x + y - 28, x*y  - 1, x y - 28x  + 29x*y - 28y  + 45x + y + 45, x  - 46x  + 28x*y - 27y  + 46x + y + 27, z  + 46x  - 46x*y + 8y  - 48x - 19y - 29)


i32 : ooo / degree

o32 = {1, 1, 1, 1, 1, 6, 6, 6, 6, 6, 30}

o32 : List

i33 : S = QQ[z,y,x, MonomialOrder => Eliminate 2]

o33 = S

o33 : PolynomialRing

i34 : ourpoints'' = substitute(ourpoints,S)

              2        5    4     3    5   5    5    5
o34 = ideal (y x - 1, y  - x , - y  + x , z  + y  + x  - 1)

o34 : Ideal of S

i35 : G = gens gb ourpoints''

o35 = | x13-1 y-x6 z5+x5+x4-1 |

              1       3
o35 : Matrix S  <--- S

i36 : ideal selectInSubring(1,G)

             13
o36 = ideal(x   - 1)

o36 : Ideal of S

i37 : M = staircase^3

              3 6   2 4 5   2 9   7 4     2 10     7 5   6 2 5     12   6 7   11 2   15   5 10   5 10   10 5   5 5 5   10 5   15   5 10   10 5   15
o37 = ideal (x y , x y z , x y , x y , x*y z  , x*y z , x y z , x*y  , x y , x  y , z  , y z  , x z  , y  z , x y z , x  z , y  , x y  , x  y , x  )

o37 : Ideal of R

i38 : numgens M

o38 = 20

i39 : transpose gens M

o39 = {-9}  | x3y6   |
      {-11} | x2y4z5 |
      {-11} | x2y9   |
      {-11} | x7y4   |
      {-13} | xy2z10 |
      {-13} | xy7z5  |
      {-13} | x6y2z5 |
      {-13} | xy12   |
      {-13} | x6y7   |
      {-13} | x11y2  |
      {-15} | z15    |
      {-15} | y5z10  |
      {-15} | x5z10  |
      {-15} | y10z5  |
      {-15} | x5y5z5 |
      {-15} | x10z5  |
      {-15} | y15    |
      {-15} | x5y10  |
      {-15} | x10y5  |
      {-15} | x15    |

              20       1
o39 : Matrix R   <--- R

i40 : degree M

o40 = 690

i41 : S = R/M

o41 = S

o41 : QuotientRing

i42 : basis S

o42 = | 1 x x2 x3 x4 x5 x6 x7 x8 x9 x10 x11 x12 x13 x14 x14y x14yz x14yz2 x14yz3 x14yz4 x14z x14z2 x14z3 x14z4 x13y x13yz x13yz2 x13yz3 x13yz4 x13z x13z2 x13z3 x13z4 x12y x12yz x12yz2 x12yz3 x12yz4 x12z x12z2 x12z3 x12z4 x11y x11yz x11yz2 x11yz3 x11yz4 x11z x11z2 x11z3 x11z4 x10y x10y2 x10y3 x10y3z x10y3z2 x10y3z3 x10y3z4 x10y2z x10y2z2 x10y2z3 x10y2z4 x10yz x10yz2 x10yz3 x10yz4 x10z x10z2 x10z3 x10z4 x9y x9y2 x9y3 x9y3z x9y3z2 x9y3z3 x9y3z4 x9y2z x9y2z2 x9y2z3 x9y2z4 x9yz x9yz2 x9yz3 x9yz4 x9yz5 x9yz6 x9yz7 x9yz8 x9yz9 x9z x9z2 x9z3 x9z4 x9z5 x9z6 x9z7 x9z8 x9z9 x8y x8y2 x8y3 x8y3z x8y3z2 x8y3z3 x8y3z4 x8y2z x8y2z2 x8y2z3 x8y2z4 x8yz x8yz2 x8yz3 x8yz4 x8yz5 x8yz6 x8yz7 x8yz8 x8yz9 x8z x8z2 x8z3 x8z4 x8z5 x8z6 x8z7 x8z8 x8z9 x7y x7y2 x7y3 x7y3z x7y3z2 x7y3z3 x7y3z4 x7y2z x7y2z2 x7y2z3 x7y2z4 x7yz x7yz2 x7yz3 x7yz4 x7yz5 x7yz6 x7yz7 x7yz8 x7yz9 x7z x7z2 x7z3 x7z4 x7z5 x7z6 x7z7 x7z8 x7z9 x6y x6y2 x6y3 x6y4 x6y5 x6y5z x6y5z2 x6y5z3 x6y5z4 x6y4z x6y4z2 x6y4z3 x6y4z4 x6y3z x6y3z2 x6y3z3 x6y3z4 x6y2z x6y2z2 x6y2z3 x6y2z4 x6yz x6yz2 x6yz3 x6yz4 x6yz5 x6yz6 x6yz7 x6yz8 x6yz9 x6z x6z2 x6z3 x6z4 x6z5 x6z6 x6z7 x6z8 x6z9 x5y x5y2 x5y3 x5y4 x5y5 x5y5z x5y5z2 x5y5z3 x5y5z4 x5y4z x5y4z2 x5y4z3 x5y4z4 x5y3z x5y3z2 x5y3z3 x5y3z4 x5y3z5 x5y3z6 x5y3z7 x5y3z8 x5y3z9 x5y2z x5y2z2 x5y2z3 x5y2z4 x5y2z5 x5y2z6 x5y2z7 x5y2z8 x5y2z9 x5yz x5yz2 x5yz3 x5yz4 x5yz5 x5yz6 x5yz7 x5yz8 x5yz9 x5z x5z2 x5z3 x5z4 x5z5 x5z6 x5z7 x5z8 x5z9 x4y x4y2 x4y3 x4y4 x4y5 x4y5z x4y5z2 x4y5z3 x4y5z4 x4y4z x4y4z2 x4y4z3 x4y4z4 x4y3z x4y3z2 x4y3z3 x4y3z4 x4y3z5 x4y3z6 x4y3z7 x4y3z8 x4y3z9 x4y2z x4y2z2 x4y2z3 x4y2z4 x4y2z5 x4y2z6 x4y2z7 x4y2z8 x4y2z9 x4yz x4yz2 x4yz3 x4yz4 x4yz5 x4yz6 x4yz7 x4yz8 x4yz9 x4yz10 x4yz11 x4yz12 x4yz13 x4yz14 x4z x4z2 x4z3 x4z4 x4z5 x4z6 x4z7 x4z8 x4z9 x4z10 x4z11 x4z12 x4z13 x4z14 x3y x3y2 x3y3 x3y4 x3y5 x3y5z x3y5z2 x3y5z3 x3y5z4 x3y4z x3y4z2 x3y4z3 x3y4z4 x3y3z x3y3z2 x3y3z3 x3y3z4 x3y3z5 x3y3z6 x3y3z7 x3y3z8 x3y3z9 x3y2z x3y2z2 x3y2z3 x3y2z4 x3y2z5 x3y2z6 x3y2z7 x3y2z8 x3y2z9 x3yz x3yz2 x3yz3 x3yz4 x3yz5 x3yz6 x3yz7 x3yz8 x3yz9 x3yz10 x3yz11 x3yz12 x3yz13 x3yz14 x3z x3z2 x3z3 x3z4 x3z5 x3z6 x3z7 x3z8 x3z9 x3z10 x3z11 x3z12 x3z13 x3z14 x2y x2y2 x2y3 x2y4 x2y5 x2y6 x2y7 x2y8 x2y8z x2y8z2 x2y8z3 x2y8z4 x2y7z x2y7z2 x2y7z3 x2y7z4 x2y6z x2y6z2 x2y6z3 x2y6z4 x2y5z x2y5z2 x2y5z3 x2y5z4 x2y4z x2y4z2 x2y4z3 x2y4z4 x2y3z x2y3z2 x2y3z3 x2y3z4 x2y3z5 x2y3z6 x2y3z7 x2y3z8 x2y3z9 x2y2z x2y2z2 x2y2z3 x2y2z4 x2y2z5 x2y2z6 x2y2z7 x2y2z8 x2y2z9 x2yz x2yz2 x2yz3 x2yz4 x2yz5 x2yz6 x2yz7 x2yz8 x2yz9 x2yz10 x2yz11 x2yz12 x2yz13 x2yz14 x2z x2z2 x2z3 x2z4 x2z5 x2z6 x2z7 x2z8 x2z9 x2z10 x2z11 x2z12 x2z13 x2z14 xy xy2 xy3 xy4 xy5 xy6 xy7 xy8 xy9 xy10 xy11 xy11z xy11z2 xy11z3 xy11z4 xy10z xy10z2 xy10z3 xy10z4 xy9z xy9z2 xy9z3 xy9z4 xy8z xy8z2 xy8z3 xy8z4 xy7z xy7z2 xy7z3 xy7z4 xy6z xy6z2 xy6z3 xy6z4 xy6z5 xy6z6 xy6z7 xy6z8 xy6z9 xy5z xy5z2 xy5z3 xy5z4 xy5z5 xy5z6 xy5z7 xy5z8 xy5z9 xy4z xy4z2 xy4z3 xy4z4 xy4z5 xy4z6 xy4z7 xy4z8 xy4z9 xy3z xy3z2 xy3z3 xy3z4 xy3z5 xy3z6 xy3z7 xy3z8 xy3z9 xy2z xy2z2 xy2z3 xy2z4 xy2z5 xy2z6 xy2z7 xy2z8 xy2z9 xyz xyz2 xyz3 xyz4 xyz5 xyz6 xyz7 xyz8 xyz9 xyz10 xyz11 xyz12 xyz13 xyz14 xz xz2 xz3 xz4 xz5 xz6 xz7 xz8 xz9 xz10 xz11 xz12 xz13 xz14 y y2 y3 y4 y5 y6 y7 y8 y9 y10 y11 y12 y13 y14 y14z y14z2 y14z3 y14z4 y13z y13z2 y13z3 y13z4 y12z y12z2 y12z3 y12z4 y11z y11z2 y11z3 y11z4 y10z y10z2 y10z3 y10z4 y9z y9z2 y9z3 y9z4 y9z5 y9z6 y9z7 y9z8 y9z9 y8z y8z2 y8z3 y8z4 y8z5 y8z6 y8z7 y8z8 y8z9 y7z y7z2 y7z3 y7z4 y7z5 y7z6 y7z7 y7z8 y7z9 y6z y6z2 y6z3 y6z4 y6z5 y6z6 y6z7 y6z8 y6z9 y5z y5z2 y5z3 y5z4 y5z5 y5z6 y5z7 y5z8 y5z9 y4z y4z2 y4z3 y4z4 y4z5 y4z6 y4z7 y4z8 y4z9 y4z10 y4z11 y4z12 y4z13 y4z14 y3z y3z2 y3z3 y3z4 y3z5 y3z6 y3z7 y3z8 y3z9 y3z10 y3z11 y3z12 y3z13 y3z14 y2z y2z2 y2z3 y2z4 y2z5 y2z6 y2z7 y2z8 y2z9 y2z10 y2z11 y2z12 y2z13 y2z14 yz yz2 yz3 yz4 yz5 yz6 yz7 yz8 yz9 yz10 yz11 yz12 yz13 yz14 z z2 z3 z4 z5 z6 z7 z8 z9 z10 z11 z12 z13 z14 |

              1       690
o42 : Matrix S  <--- S

i43 : tally apply(flatten entries basis(S),degree)

o43 = Tally{{0} => 1  }
            {1} => 3
            {2} => 6
            {3} => 10
            {4} => 15
            {5} => 21
            {6} => 28
            {7} => 36
            {8} => 45
            {9} => 54
            {10} => 63
            {11} => 69
            {12} => 73
            {13} => 71
            {14} => 66
            {15} => 53
            {16} => 38
            {17} => 23
            {18} => 12
            {19} => 3

o43 : Tally

i44 : basis(19,S)

o44 = | x14yz4 x9yz9 x4yz14 |

              1       3
o44 : Matrix S  <--- S

i45 : (x+y+z)^19

            14   4          9   9         4   14
o45 = 58140x  y*z  + 923780x y*z  + 58140x y*z

o45 : S

i46 : C = res M

       1      16      27      12
o46 = R  <-- R   <-- R   <-- R   <-- 0
                                      
      0      1       2       3       4

o46 : ChainComplex

i47 : C.dd_1

o47 = | x3y6 x7y4 x2y9 x2y4z5 x11y2 xy12 x6y2z5 xy7z5 xy2z10 x15 y15 x10z5 y10z5 x5z10 y5z10 z15 |

              1       16
o47 : Matrix R  <--- R

i48 : set flatten entries gens M - set flatten entries C.dd_1

            5 5 5   5 10   6 7   10 5
o48 = set {x y z , x y  , x y , x  y }

o48 : Set

i49 : C.dd_2

o49 = {9}  | -y3 -x4 0   -z5 0   0   0   0   0   0   0   0   0   0   0   0   0   0   0   0   0   0   0   0   0   0   0   |
      {11} | 0   y2  0   0   0   -x4 0   0   -z5 0   0   0   0   0   0   0   0   0   0   0   0   0   0   0   0   0   0   |
      {11} | x   0   -y3 0   0   0   0   0   0   -z5 0   0   0   0   0   0   0   0   0   0   0   0   0   0   0   0   0   |
      {11} | 0   0   0   xy2 -y3 0   -x4 0   x5  y5  0   -z5 0   0   0   0   0   0   0   0   0   0   0   0   0   0   0   |
      {13} | 0   0   0   0   0   y2  0   0   0   0   0   0   0   -x4 0   0   -z5 0   0   0   0   0   0   0   0   0   0   |
      {13} | 0   0   x   0   0   0   0   -y3 0   0   0   0   0   0   0   0   0   -z5 0   0   0   0   0   0   0   0   0   |
      {13} | 0   0   0   0   0   0   y2  0   0   0   0   0   0   0   -x4 0   x5  0   -z5 0   0   0   0   0   0   0   0   |
      {13} | 0   0   0   0   x   0   0   0   0   0   -y3 0   0   0   0   0   0   y5  0   -z5 0   0   0   0   0   0   0   |
      {13} | 0   0   0   0   0   0   0   0   0   0   0   xy2 -y3 0   0   -x4 0   0   x5  y5  -z5 0   0   0   0   0   0   |
      {15} | 0   0   0   0   0   0   0   0   0   0   0   0   0   y2  0   0   0   0   0   0   0   -z5 0   0   0   0   0   |
      {15} | 0   0   0   0   0   0   0   x   0   0   0   0   0   0   0   0   0   0   0   0   0   0   -z5 0   0   0   0   |
      {15} | 0   0   0   0   0   0   0   0   0   0   0   0   0   0   y2  0   0   0   0   0   0   x5  0   -z5 0   0   0   |
      {15} | 0   0   0   0   0   0   0   0   0   0   x   0   0   0   0   0   0   0   0   0   0   0   y5  0   -z5 0   0   |
      {15} | 0   0   0   0   0   0   0   0   0   0   0   0   0   0   0   y2  0   0   0   0   0   0   0   x5  0   -z5 0   |
      {15} | 0   0   0   0   0   0   0   0   0   0   0   0   x   0   0   0   0   0   0   0   0   0   0   0   y5  0   -z5 |
      {15} | 0   0   0   0   0   0   0   0   0   0   0   0   0   0   0   0   0   0   0   0   xy2 0   0   0   0   x5  y5  |

              16       27
o49 : Matrix R   <--- R

i50 : C.dd_3

o50 = {12} | z5  0   0   0   0   0   0   0   0   0   0   0   |
      {13} | 0   z5  0   0   0   0   0   0   0   0   0   0   |
      {14} | 0   0   z5  0   0   0   0   0   0   0   0   0   |
      {14} | -y3 -x4 0   0   0   0   0   0   0   0   0   0   |
      {14} | 0   0   -y5 z5  0   0   0   0   0   0   0   0   |
      {15} | 0   0   0   0   z5  0   0   0   0   0   0   0   |
      {15} | 0   0   0   0   -x5 z5  0   0   0   0   0   0   |
      {16} | 0   0   0   0   0   0   z5  0   0   0   0   0   |
      {16} | 0   y2  0   0   -x4 0   0   0   0   0   0   0   |
      {16} | x   0   -y3 0   0   0   0   0   0   0   0   0   |
      {16} | 0   0   0   0   0   0   -y5 z5  0   0   0   0   |
      {16} | 0   0   0   -y3 0   -x4 0   0   0   0   0   0   |
      {16} | 0   0   0   0   0   0   0   -y5 z5  0   0   0   |
      {17} | 0   0   0   0   0   0   0   0   0   z5  0   0   |
      {17} | 0   0   0   0   0   0   0   0   0   -x5 z5  0   |
      {17} | 0   0   0   0   0   0   0   0   0   0   -x5 z5  |
      {18} | 0   0   0   0   y2  0   0   0   0   -x4 0   0   |
      {18} | 0   0   x   0   0   0   -y3 0   0   0   0   0   |
      {18} | 0   0   0   0   0   y2  0   0   0   0   -x4 0   |
      {18} | 0   0   0   x   0   0   0   -y3 0   0   0   0   |
      {18} | 0   0   0   0   0   0   0   0   -y3 0   0   -x4 |
      {20} | 0   0   0   0   0   0   0   0   0   y2  0   0   |
      {20} | 0   0   0   0   0   0   x   0   0   0   0   0   |
      {20} | 0   0   0   0   0   0   0   0   0   0   y2  0   |
      {20} | 0   0   0   0   0   0   0   x   0   0   0   0   |
      {20} | 0   0   0   0   0   0   0   0   0   0   0   y2  |
      {20} | 0   0   0   0   0   0   0   0   x   0   0   0   |

              27       12
o50 : Matrix R   <--- R

i51 : A = {{1, 1, 1, 1},
           {1, 5,10,25}}

o51 = {{1, 1, 1, 1}, {1, 5, 10, 25}}

o51 : List

i52 : R = QQ[p,n,d,q, Degrees => transpose A]

o52 = R

o52 : PolynomialRing

i53 : degree d

o53 = {1, 10}

o53 : List

i54 : degree q

o54 = {1, 25}

o54 : List

i55 : degree(p^4*n^8*d^10*q^3)

o55 = {25, 219}

o55 : List

i56 : h = basis({25,219}, R)

o56 = | p14n2d2q7 p9n8d2q6 p9n5d6q5 p9n2d10q4 p4n14d2q5 p4n11d6q4 p4n8d10q3 p4n5d14q2 p4n2d18q |

              1       9
o56 : Matrix R  <--- R

i57 : rank source h

o57 = 9

i58 : rank source basis({100,1000}, R)

o58 = 182

i59 : S = QQ[x, y, d, p, n, q, 
          MonomialOrder => Lex, MonomialSize => 16]

o59 = S

o59 : PolynomialRing

i60 : I = ideal( p - x*y, n - x*y^5, d - x*y^10, q - x*y^25)

                             5           10           25
o60 = ideal (- x*y + p, - x*y  + n, - x*y   + d, - x*y   + q)

o60 : Ideal of S

i61 : transpose gens gb I

o61 = {-6}  | p5q-n6     |
      {-4}  | d4-n3q     |
      {-3}  | yn2-dp     |
      {-6}  | yp4q-dn4   |
      {-4}  | yd3-pnq    |
      {-6}  | y2p3q-d2n2 |
      {-5}  | y2d2n-p2q  |
      {-7}  | y2d2p3-n5  |
      {-6}  | y3p2q-d3   |
      {-6}  | y3dp2-n3   |
      {-5}  | y4p-n      |
      {-6}  | y5n-d      |
      {-8}  | y6d2-pq    |
      {-16} | y15d-q     |
      {-7}  | xq-y5d2    |
      {-5}  | xn-y3p2    |
      {-2}  | xd-n2      |
      {-2}  | xy-p       |

              18       1
o61 : Matrix S   <--- S

i62 : S' = S/I

o62 = S'

o62 : QuotientRing

i63 : x^10 * y^100

       2 6 2
o63 = d n q

o63 : S'

i64 : x^100 * y^1000

       75 25
o64 = n  q

o64 : S'

i65 : x^39 * y^1000

       25 39
o65 = y  q

o65 : S'

i66 : weight = (5,7,13,17)

o66 = (5, 7, 13, 17)

o66 : Sequence

i67 : T = QQ[x, y, p, n, d, q, 
                Weights => {{1,1,0,0,0,0},{0,0,weight}},
                MonomialSize => 16]/
            (p - x*y, n - x*y^5, d - x*y^10, q - x*y^25);

i68 : x^10 * y^100

       5 2 3
o68 = p d q

o68 : T

i69 : x^100 * y^1000

       60 3 37
o69 = p  n q

o69 : T

i70 : x^234 * y^5677

       2 4 3 225
o70 = p n d q

o70 : T

i71 : 
